{
 "array_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA0_9PsshEntry",
   "name" : "PsshEntry[0]",
   "referenced_type" : "_ZTI9PsshEntry",
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaExtractor.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_h",
   "name" : "unsigned char[16]",
   "referenced_type" : "_ZTIh",
   "size" : 16,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaExtractor.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIDn",
   "name" : "std::nullptr_t",
   "size" : 8
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIDs",
   "name" : "char16_t",
   "size" : 2
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "size" : 1
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "size" : 8
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIf",
   "name" : "float",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "size" : 1

  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPP15AHardwareBuffer",
   "name" : "AHardwareBuffer **",
   "referenced_type" : "_ZTIP15AHardwareBuffer",
   "size" : 8,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkImage.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPP6AImage",
   "name" : "AImage **",
   "referenced_type" : "_ZTIP6AImage",
   "size" : 8,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkImageReader.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPKc",
   "name" : "const char **",
   "referenced_type" : "_ZTIPKc",
   "size" : 8,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaFormat.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPKh",
   "name" : "const unsigned char **",
   "referenced_type" : "_ZTIPKh",
   "size" : 8,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaDrm.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPc",
   "name" : "char **",
   "referenced_type" : "_ZTIPc",
   "size" : 8,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaCodec.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPh",
   "name" : "unsigned char **",
   "referenced_type" : "_ZTIPh",
   "size" : 8,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkImage.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPv",
   "name" : "void **",
   "referenced_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaFormat.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "size" : 8,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaCodec.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPd",
   "name" : "double *",
   "referenced_type" : "_ZTId",
   "size" : 8,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaFormat.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPf",
   "name" : "float *",
   "referenced_type" : "_ZTIf",
   "size" : 8,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaFormat.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "size" : 8,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaCodec.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPi",
   "name" : "int *",
   "referenced_type" : "_ZTIi",
   "size" : 8,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaFormat.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPl",
   "name" : "long *",
   "referenced_type" : "_ZTIl",
   "size" : 8,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaFormat.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPm",
   "name" : "unsigned long *",
   "referenced_type" : "_ZTIm",
   "size" : 8,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaCodec.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "size" : 8,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaCodec.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK12AImageReader",
   "name" : "const AImageReader",
   "referenced_type" : "_ZTI12AImageReader",
   "size" : 216,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkImageReader.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK12AMediaFormat",
   "name" : "const AMediaFormat",
   "referenced_type" : "_ZTI12AMediaFormat",
   "size" : 56,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaCodec.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK18AMediaDrmByteArray",
   "name" : "const AMediaDrmByteArray",
   "referenced_type" : "_ZTI18AMediaDrmByteArray",
   "size" : 16,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaDrm.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK18AMediaDrmKeyStatus",
   "name" : "const AMediaDrmKeyStatus",
   "referenced_type" : "_ZTI18AMediaDrmKeyStatus",
   "size" : 24,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaDrm.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK21AMediaCodecBufferInfo",
   "name" : "const AMediaCodecBufferInfo",
   "referenced_type" : "_ZTI21AMediaCodecBufferInfo",
   "size" : 24,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaMuxer.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK21AMediaDrmKeyValuePair",
   "name" : "const AMediaDrmKeyValuePair",
   "referenced_type" : "_ZTI21AMediaDrmKeyValuePair",
   "size" : 16,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaDrm.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK6AImage",
   "name" : "const AImage",
   "referenced_type" : "_ZTI6AImage",
   "size" : 112,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkImage.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "size" : 1,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaFormat.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "size" : 1,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaCrypto.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaCrypto.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14AImageCropRect",
   "name" : "AImageCropRect",
   "size" : 16,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkImage.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ptr",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "length",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI18AMediaDrmByteArray",
   "name" : "AMediaDrmByteArray",
   "size" : 16,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaDrm.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "keyId",
     "referenced_type" : "_ZTI18AMediaDrmByteArray"
    },
    {
     "field_name" : "keyType",
     "field_offset" : 128,
     "referenced_type" : "_ZTI19AMediaKeyStatusType"
    }
   ],
   "linker_set_key" : "_ZTI18AMediaDrmKeyStatus",
   "name" : "AMediaDrmKeyStatus",
   "size" : 24,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaDrm.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "encryptBlocks",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "skipBlocks",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI20cryptoinfo_pattern_t",
   "name" : "cryptoinfo_pattern_t",
   "size" : 8,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaCodec.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "offset",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "presentationTimeUs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI21AMediaCodecBufferInfo",
   "name" : "AMediaCodecBufferInfo",
   "size" : 24,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaCodec.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mKey",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "mValue",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21AMediaDrmKeyValuePair",
   "name" : "AMediaDrmKeyValuePair",
   "size" : 16,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaDrm.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "context",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "onImageAvailable",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPvP12AImageReaderE"
    }
   ],
   "linker_set_key" : "_ZTI26AImageReader_ImageListener",
   "name" : "AImageReader_ImageListener",
   "size" : 16,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkImageReader.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "onAsyncInputAvailable",
     "referenced_type" : "_ZTIPFvP11AMediaCodecPviE"
    },
    {
     "field_name" : "onAsyncOutputAvailable",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvP11AMediaCodecPviP21AMediaCodecBufferInfoE"
    },
    {
     "field_name" : "onAsyncFormatChanged",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvP11AMediaCodecPvP12AMediaFormatE"
    },
    {
     "field_name" : "onAsyncError",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvP11AMediaCodecPv14media_status_tiPKcE"
    }
   ],
   "linker_set_key" : "_ZTI32AMediaCodecOnAsyncNotifyCallback",
   "name" : "AMediaCodecOnAsyncNotifyCallback",
   "size" : 32,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaCodec.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "context",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "onBufferRemoved",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPvP12AImageReaderP15AHardwareBufferE"
    }
   ],
   "linker_set_key" : "_ZTI34AImageReader_BufferRemovedListener",
   "name" : "AImageReader_BufferRemovedListener",
   "size" : 16,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkImageReader.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "numentries",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "entries",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA0_9PsshEntry"
    }
   ],
   "linker_set_key" : "_ZTI8PsshInfo",
   "name" : "PsshInfo",
   "size" : 8,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaExtractor.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uuid",
     "referenced_type" : "_ZTIA16_h"
    },
    {
     "field_name" : "datalen",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "data",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI9PsshEntry",
   "name" : "PsshEntry",
   "size" : 32,
   "source_file" : "frameworks/av/media/ndk/include/media/NdkMediaExtractor.h"
  }
 ],
 "rvalue_reference_types" : []
}
