{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA0_i",
   "name" : "int[0]",
   "referenced_type" : "_ZTIi",
   "source_file" : "system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_N7android8hardware12renderscript4V1_019AllocationUsageTypeE",
   "name" : "android::hardware::renderscript::V1_0::AllocationUsageType[10]",
   "referenced_type" : "_ZTIN7android8hardware12renderscript4V1_019AllocationUsageTypeE",
   "size" : 40,
   "source_file" : "external/libcxx/include/array"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA10_c",
   "name" : "char[10]",
   "referenced_type" : "_ZTIc",
   "size" : 10,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int[10]",
   "referenced_type" : "_ZTIi",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA11_Ds",
   "name" : "char16_t[11]",
   "referenced_type" : "_ZTIDs",
   "size" : 22,
   "source_file" : "external/libcxx/include/string"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA11_c",
   "name" : "char[11]",
   "referenced_type" : "_ZTIc",
   "size" : 11,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA120_c",
   "name" : "char[120]",
   "referenced_type" : "_ZTIc",
   "size" : 120,

   "referenced_type" : "_ZTISt16nested_exception",
   "size" : 16,
   "source_file" : "external/libcxx/include/exception"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9nothrow_t",
   "name" : "const std::nothrow_t",
   "referenced_type" : "_ZTISt9nothrow_t",
   "size" : 1,
   "source_file" : "external/libcxx/include/new"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKSt9type_info",
   "name" : "const std::type_info",
   "referenced_type" : "_ZTISt9type_info",
   "size" : 16,
   "source_file" : "external/libcxx/include/typeinfo"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "size" : 1,
   "source_file" : "frameworks/rs/rsInternalDefines.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 16,
   "is_const" : true,
   "linker_set_key" : "_ZTIKe",
   "name" : "const long double",
   "referenced_type" : "_ZTIe",
   "size" : 16,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "size" : 1,
   "source_file" : "frameworks/rs/rsApiStubs.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "size" : 4,
   "source_file" : "frameworks/rs/rsApiStubs.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "size" : 4,
   "source_file" : "frameworks/rs/rsApiStubs.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKl",
   "name" : "const long",
   "referenced_type" : "_ZTIl",
   "size" : 8,
   "source_file" : "frameworks/rs/rsApiStubs.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKm",
   "name" : "const unsigned long",
   "referenced_type" : "_ZTIm",
   "size" : 8,
   "source_file" : "frameworks/rs/rsApiStubs.h"
  },
  {
   "alignment" : 16,
   "is_const" : true,
   "linker_set_key" : "_ZTIKn",
   "name" : "const __int128",
   "referenced_type" : "_ZTIn",
   "size" : 16,
   "source_file" : "external/libcxx/include/chrono"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "source_file" : "frameworks/rs/rsApiStubs.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKw",
   "name" : "const wchar_t",
   "referenced_type" : "_ZTIw",
   "size" : 4,
   "source_file" : "external/libcxx/include/type_traits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "size" : 8,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "size" : 8,
   "source_file" : "external/libcxx/include/limits"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVNSt3__111atomic_flagE",
   "name" : "volatile std::atomic_flag",
   "referenced_type" : "_ZTINSt3__111atomic_flagE",
   "size" : 1,
   "source_file" : "external/libcxx/include/atomic"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvS_mPKvE",
   "name" : "void *(*volatile)(void *, unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvS_mPKvE",
   "size" : 8,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvmPKvE",
   "name" : "void *(*volatile)(unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvmPKvE",
   "size" : 8,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvmmPKvE",
   "name" : "void *(*volatile)(unsigned long, unsigned long, const void *)",
   "referenced_type" : "_ZTIPFPvmmPKvE",
   "size" : 8,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFvPvPKvE",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "_ZTIPFvPvPKvE",
   "size" : 8,
   "source_file" : "bionic/libc/include/malloc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "func",
     "referenced_type" : "_ZTI14RsBlasFunction"
    },
    {
     "field_name" : "transA",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15RsBlasTranspose"
    },
    {
     "field_name" : "transB",
     "field_offset" : 64,
     "referenced_type" : "_ZTI15RsBlasTranspose"
    },
    {
     "field_name" : "uplo",
     "field_offset" : 96,
     "referenced_type" : "_ZTI10RsBlasUplo"
    },
    {
     "field_name" : "diag",
     "field_offset" : 128,
     "referenced_type" : "_ZTI10RsBlasDiag"
    },
    {
     "field_name" : "side",
     "field_offset" : 160,
     "referenced_type" : "_ZTI10RsBlasSide"
    },
    {
     "field_name" : "M",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "N",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "K",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "alpha",
     "field_offset" : 320,
     "referenced_type" : "_ZTI12RsBlasScalar"
    },
    {
     "field_name" : "beta",
     "field_offset" : 448,
     "referenced_type" : "_ZTI12RsBlasScalar"
    },
    {
     "field_name" : "incX",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "incY",
     "field_offset" : 608,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "KL",
     "field_offset" : 640,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "KU",
     "field_offset" : 672,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "a_offset",
     "field_offset" : 704,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "b_offset",
     "field_offset" : 712,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "c_offset",
     "field_offset" : 736,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "c_mult_int",
     "field_offset" : 768,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI10RsBlasCall",
   "name" : "RsBlasCall",
   "size" : 104,
   "source_file" : "frameworks/rs/rsDefines.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_kill",
     "referenced_type" : "_ZTIN10__sifieldsUt_E"
    },
    {
     "field_name" : "_timer",
     "referenced_type" : "_ZTIN10__sifieldsUt0_E"
    },
    {
     "field_name" : "_rt",
     "referenced_type" : "_ZTIN10__sifieldsUt1_E"
    },
    {
     "field_name" : "_sigchld",
     "referenced_type" : "_ZTIN10__sifieldsUt2_E"
    },
    {
     "field_name" : "_sigfault",
     "referenced_type" : "_ZTIN10__sifieldsUt3_E"
    },
    {
     "field_name" : "_sigpoll",
     "referenced_type" : "_ZTIN10__sifieldsUt4_E"
    },
    {
     "field_name" : "_sigsys",
     "referenced_type" : "_ZTIN10__sifieldsUt5_E"
    }
   ],
   "linker_set_key" : "_ZTI10__sifields",
   "name" : "__sifields",
   "record_kind" : "union",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI10_jintArray",
   "name" : "_jintArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pidfd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "child_tid",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "parent_tid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "exit_signal",
     "field_offset" : 256,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack",
     "field_offset" : 320,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "tls",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid",
     "field_offset" : 512,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "set_tid_size",
     "field_offset" : 576,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "cgroup",
     "field_offset" : 640,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI10clone_args",
   "name" : "clone_args",
   "size" : 88,
   "source_file" : "bionic/libc/kernel/uapi/linux/sched.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI8timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8timespec"
    }
   ],
   "linker_set_key" : "_ZTI10itimerspec",
   "name" : "itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "fault_address",
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "regs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA31_y"
    },
    {
     "field_name" : "sp",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIA4096_h"
    }
   ],
   "linker_set_key" : "_ZTI10sigcontext",
   "name" : "sigcontext",
   "size" : 4384,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "vl",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 80,
     "referenced_type" : "_ZTIA3_t"
    }
   ],
   "linker_set_key" : "_ZTI10za_context",
   "name" : "za_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "nregs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 80,
     "referenced_type" : "_ZTIA3_t"
    }
   ],
   "linker_set_key" : "_ZTI10zt_context",
   "name" : "zt_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jbyteArray",
   "name" : "_jbyteArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jcharArray",
   "name" : "_jcharArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jlongArray",
   "name" : "_jlongArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI11_jthrowable",
   "name" : "_jthrowable",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "esr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI11esr_context",
   "name" : "esr_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "size" : 32,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/__stddef_max_align_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_priority",
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11sched_param",
   "name" : "sched_param",
   "size" : 4,
   "source_file" : "bionic/libc/include/sched.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN11sigaction64Ut_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI11sigaction64",
   "name" : "sigaction64",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ss_sp",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ss_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ss_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI11sigaltstack",
   "name" : "sigaltstack",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "vl",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "flags",
     "field_offset" : 80,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA2_t"
    }
   ],
   "linker_set_key" : "_ZTI11sve_context",
   "name" : "sve_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "optionString",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "extraInfo",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI12JavaVMOption",
   "name" : "JavaVMOption",
   "size" : 16,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "f",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "c",
     "referenced_type" : "_ZTI14RsFloatComplex"
    },
    {
     "field_name" : "d",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "z",
     "referenced_type" : "_ZTI15RsDoubleComplex"
    }
   ],
   "linker_set_key" : "_ZTI12RsBlasScalar",
   "name" : "RsBlasScalar",
   "record_kind" : "union",
   "size" : 16,
   "source_file" : "frameworks/rs/rsDefines.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "strategy",
     "referenced_type" : "_ZTI17RsForEachStrategy"
    },
    {
     "field_name" : "xStart",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xEnd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "yStart",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "yEnd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "zStart",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "zEnd",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "arrayStart",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "arrayEnd",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array2Start",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array2End",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array3Start",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array3End",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array4Start",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array4End",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12RsScriptCall",
   "name" : "RsScriptCall",
   "size" : 60,
   "source_file" : "frameworks/rs/rsDefines.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12_aarch64_ctx",
   "name" : "_aarch64_ctx",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI12_jfloatArray",
   "name" : "_jfloatArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI12_jshortArray",
   "name" : "_jshortArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "m",
     "referenced_type" : "_ZTIA4_f"
    }
   ],
   "linker_set_key" : "_ZTI12rs_matrix2x2",
   "name" : "rs_matrix2x2",
   "size" : 16,
   "source_file" : "frameworks/rs/rsDefines.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "m",
     "referenced_type" : "_ZTIA9_f"
    }
   ],
   "linker_set_key" : "_ZTI12rs_matrix3x3",
   "name" : "rs_matrix3x3",
   "size" : 36,
   "source_file" : "frameworks/rs/rsDefines.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "m",
     "referenced_type" : "_ZTIA16_f"
    }
   ],
   "linker_set_key" : "_ZTI12rs_matrix4x4",
   "name" : "rs_matrix4x4",
   "size" : 64,
   "source_file" : "frameworks/rs/rsDefines.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI13_jdoubleArray",
   "name" : "_jdoubleArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI13_jobjectArray",
   "name" : "_jobjectArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "SetNativeLibDir",
     "referenced_type" : "_ZTIPFvPvPKcmE"
    },
    {
     "field_name" : "Allocation1DData",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPvS_jjjPKvmE"
    },
    {
     "field_name" : "Allocation1DElementData",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvPvS_jjPKvmmE"
    },
    {
     "field_name" : "Allocation1DRead",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvPvS_jjjS_mE"
    },
    {
     "field_name" : "Allocation2DData",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFvPvS_jjj23RsAllocationCubemapFacejjPKvmmE"
    },
    {
     "field_name" : "Allocation2DRead",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFvPvS_jjj23RsAllocationCubemapFacejjS_mmE"
    },
    {
     "field_name" : "Allocation3DData",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFvPvS_jjjjjjjPKvmmE"
    },
    {
     "field_name" : "Allocation3DRead",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFvPvS_jjjjjjjS_mmE"
    },
    {
     "field_name" : "AllocationAdapterCreate",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFPvS_S_S_E"
    },
    {
     "field_name" : "AllocationAdapterOffset",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFvPvS_PKjmE"
    },
    {
     "field_name" : "AllocationCopy2DRange",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFvPvS_jjjjjjS_jjjjE"
    },
    {
     "field_name" : "AllocationCopy3DRange",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFvPvS_jjjjjjjS_jjjjE"
    },
    {
     "field_name" : "AllocationCopyToBitmap",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFvPvS_S_mE"
    },
    {
     "field_name" : "AllocationCreateFromBitmap",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFPvS_S_25RsAllocationMipmapControlPKvmjE"
    },
    {
     "field_name" : "AllocationCreateStrided",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPFPvS_S_25RsAllocationMipmapControljmmE"
    },
    {
     "field_name" : "AllocationCreateTyped",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPFPvS_S_25RsAllocationMipmapControljmE"
    },
    {
     "field_name" : "AllocationCubeCreateFromBitmap",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPFPvS_S_25RsAllocationMipmapControlPKvmjE"
    },
    {
     "field_name" : "AllocationElementData",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPFvPvS_jjjjPKvmmE"
    },
    {
     "field_name" : "AllocationElementRead",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPFvPvS_jjjjS_mmE"
    },
    {
     "field_name" : "AllocationGenerateMipmaps",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPFvPvS_E"
    },
    {
     "field_name" : "AllocationGetPointer",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIPFPvS_S_j23RsAllocationCubemapFacejjPmmE"
    },
    {
     "field_name" : "AllocationGetSurface",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIPFPvS_S_E"
    },
    {
     "field_name" : "AllocationGetType",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIPFPKvPvS1_E"
    },
    {
     "field_name" : "AllocationIoReceive",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIPFlPvS_E"
    },
    {
     "field_name" : "AllocationIoSend",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIPFvPvS_E"
    },
    {
     "field_name" : "AllocationRead",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIPFvPvS_S_mE"
    },
    {
     "field_name" : "AllocationResize1D",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIPFvPvS_jE"
    },
    {
     "field_name" : "AllocationSetSurface",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIPFvPvS_S_E"
    },
    {
     "field_name" : "AllocationSyncAll",
     "field_offset" : 1792,
     "referenced_type" : "_ZTIPFvPvS_21RsAllocationUsageTypeE"
    },
    {
     "field_name" : "AllocationSetupBufferQueue",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIPFvPvS_jE"
    },
    {
     "field_name" : "AllocationShareBufferQueue",
     "field_offset" : 1920,
     "referenced_type" : "_ZTIPFvPvS_S_E"
    },
    {
     "field_name" : "AssignName",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIPFvPvS_PKcmE"
    },
    {
     "field_name" : "ClosureCreate",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIPFPvS_S_S_PS_mPlmPimS0_mS0_mE"
    },
    {
     "field_name" : "ClosureSetArg",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIPFvPvS_jmiE"
    },
    {
     "field_name" : "ClosureSetGlobal",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIPFvPvS_S_liE"
    },
    {
     "field_name" : "ContextCreate",
     "field_offset" : 2240,
     "referenced_type" : "_ZTIPFPvS_jj13RsContextTypejE"
    },
    {
     "field_name" : "ContextCreateVendor",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIPFPvS_jj13RsContextTypejPKcE"
    },
    {
     "field_name" : "ContextDeinitToClient",
     "field_offset" : 2368,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "ContextDestroy",
     "field_offset" : 2432,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "ContextDump",
     "field_offset" : 2496,
     "referenced_type" : "_ZTIPFvPviE"
    },
    {
     "field_name" : "ContextFinish",
     "field_offset" : 2560,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "ContextGetMessage",
     "field_offset" : 2624,
     "referenced_type" : "_ZTIPF21RsMessageToClientTypePvS0_mPmmPjmE"
    },
    {
     "field_name" : "ContextInitToClient",
     "field_offset" : 2688,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "ContextPeekMessage",
     "field_offset" : 2752,
     "referenced_type" : "_ZTIPF21RsMessageToClientTypePvPmmPjmE"
    },
    {
     "field_name" : "ContextSendMessage",
     "field_offset" : 2816,
     "referenced_type" : "_ZTIPFvPvjPKhmE"
    },
    {
     "field_name" : "ContextSetPriority",
     "field_offset" : 2880,
     "referenced_type" : "_ZTIPFvPviE"
    },
    {
     "field_name" : "ContextSetCacheDir",
     "field_offset" : 2944,
     "referenced_type" : "_ZTIPFvPvPKcmE"
    },
    {
     "field_name" : "DeviceCreate",
     "field_offset" : 3008,
     "referenced_type" : "_ZTIPFPvvE"
    },
    {
     "field_name" : "DeviceDestroy",
     "field_offset" : 3072,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "DeviceSetConfig",
     "field_offset" : 3136,
     "referenced_type" : "_ZTIPFvPv13RsDeviceParamiE"
    },
    {
     "field_name" : "ElementCreate2",
     "field_offset" : 3200,
     "referenced_type" : "_ZTIPFPvS_PKS_mPPKcmPKmPKjmE"
    },
    {
     "field_name" : "ElementCreate",
     "field_offset" : 3264,
     "referenced_type" : "_ZTIPFPvS_10RsDataType10RsDataKindbjE"
    },
    {
     "field_name" : "ElementGetNativeData",
     "field_offset" : 3328,
     "referenced_type" : "_ZTIPFvPvS_PjjE"
    },
    {
     "field_name" : "ElementGetSubElements",
     "field_offset" : 3392,
     "referenced_type" : "_ZTIPFvPvS_PmPPKcS0_jE"
    },
    {
     "field_name" : "GetName",
     "field_offset" : 3456,
     "referenced_type" : "_ZTIPFvPvS_PPKcE"
    },
    {
     "field_name" : "InvokeClosureCreate",
     "field_offset" : 3520,
     "referenced_type" : "_ZTIPFPvS_S_PKvmPKS_mPKlmPKimE"
    },
    {
     "field_name" : "ObjDestroy",
     "field_offset" : 3584,
     "referenced_type" : "_ZTIPFvPvS_E"
    },
    {
     "field_name" : "SamplerCreate",
     "field_offset" : 3648,
     "referenced_type" : "_ZTIPFPvS_14RsSamplerValueS0_S0_S0_S0_fE"
    },
    {
     "field_name" : "ScriptBindAllocation",
     "field_offset" : 3712,
     "referenced_type" : "_ZTIPFvPvS_S_jE"
    },
    {
     "field_name" : "ScriptCCreate",
     "field_offset" : 3776,
     "referenced_type" : "_ZTIPFPvS_PKcmS1_mS1_mE"
    },
    {
     "field_name" : "ScriptFieldIDCreate",
     "field_offset" : 3840,
     "referenced_type" : "_ZTIPFPvS_S_iE"
    },
    {
     "field_name" : "ScriptForEach",
     "field_offset" : 3904,
     "referenced_type" : "_ZTIPFvPvS_jS_S_PKvmPK12RsScriptCallmE"
    },
    {
     "field_name" : "ScriptForEachMulti",
     "field_offset" : 3968,
     "referenced_type" : "_ZTIPFvPvS_jPS_mS_PKvmPK12RsScriptCallmE"
    },
    {
     "field_name" : "ScriptGetVarV",
     "field_offset" : 4032,
     "referenced_type" : "_ZTIPFvPvS_jS_mE"
    },
    {
     "field_name" : "ScriptGroup2Create",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIPFPvS_PKcmS1_mPS_mE"
    },
    {
     "field_name" : "ScriptGroupCreate",
     "field_offset" : 4160,
     "referenced_type" : "_ZTIPFPvS_PS_mS0_mS0_mS0_mPKS_mE"
    },
    {
     "field_name" : "ScriptGroupExecute",
     "field_offset" : 4224,
     "referenced_type" : "_ZTIPFvPvS_E"
    },
    {
     "field_name" : "ScriptGroupSetInput",
     "field_offset" : 4288,
     "referenced_type" : "_ZTIPFvPvS_S_S_E"
    },
    {
     "field_name" : "ScriptGroupSetOutput",
     "field_offset" : 4352,
     "referenced_type" : "_ZTIPFvPvS_S_S_E"
    },
    {
     "field_name" : "ScriptIntrinsicCreate",
     "field_offset" : 4416,
     "referenced_type" : "_ZTIPFPvS_jS_E"
    },
    {
     "field_name" : "ScriptInvoke",
     "field_offset" : 4480,
     "referenced_type" : "_ZTIPFvPvS_jE"
    },
    {
     "field_name" : "ScriptInvokeIDCreate",
     "field_offset" : 4544,
     "referenced_type" : "_ZTIPFPvS_S_iE"
    },
    {
     "field_name" : "ScriptInvokeV",
     "field_offset" : 4608,
     "referenced_type" : "_ZTIPFvPvS_jPKvmE"
    },
    {
     "field_name" : "ScriptKernelIDCreate",
     "field_offset" : 4672,
     "referenced_type" : "_ZTIPFPvS_S_iiE"
    },
    {
     "field_name" : "ScriptReduce",
     "field_offset" : 4736,
     "referenced_type" : "_ZTIPFvPvS_jPS_mS_PK12RsScriptCallmE"
    },
    {
     "field_name" : "ScriptSetTimeZone",
     "field_offset" : 4800,
     "referenced_type" : "_ZTIPFvPvS_PKcmE"
    },
    {
     "field_name" : "ScriptSetVarD",
     "field_offset" : 4864,
     "referenced_type" : "_ZTIPFvPvS_jdE"
    },
    {
     "field_name" : "ScriptSetVarF",
     "field_offset" : 4928,
     "referenced_type" : "_ZTIPFvPvS_jfE"
    },
    {
     "field_name" : "ScriptSetVarI",
     "field_offset" : 4992,
     "referenced_type" : "_ZTIPFvPvS_jiE"
    },
    {
     "field_name" : "ScriptSetVarJ",
     "field_offset" : 5056,
     "referenced_type" : "_ZTIPFvPvS_jlE"
    },
    {
     "field_name" : "ScriptSetVarObj",
     "field_offset" : 5120,
     "referenced_type" : "_ZTIPFvPvS_jS_E"
    },
    {
     "field_name" : "ScriptSetVarVE",
     "field_offset" : 5184,
     "referenced_type" : "_ZTIPFvPvS_jPKvmS_PKjmE"
    },
    {
     "field_name" : "ScriptSetVarV",
     "field_offset" : 5248,
     "referenced_type" : "_ZTIPFvPvS_jPKvmE"
    },
    {
     "field_name" : "TypeCreate",
     "field_offset" : 5312,
     "referenced_type" : "_ZTIPFPvS_S_jjjbbjE"
    },
    {
     "field_name" : "TypeGetNativeData",
     "field_offset" : 5376,
     "referenced_type" : "_ZTIPFvPvS_PmjE"
    },
    {
     "field_name" : "ContextCreateGL",
     "field_offset" : 5440,
     "referenced_type" : "_ZTIPFPvS_jj15RsSurfaceConfigjE"
    },
    {
     "field_name" : "ContextPause",
     "field_offset" : 5504,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "ContextResume",
     "field_offset" : 5568,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "ContextBindProgramStore",
     "field_offset" : 5632,
     "referenced_type" : "_ZTIPFvPvS_E"
    },
    {
     "field_name" : "ContextBindProgramFragment",
     "field_offset" : 5696,
     "referenced_type" : "_ZTIPFvPvS_E"
    },
    {
     "field_name" : "ContextBindProgramVertex",
     "field_offset" : 5760,
     "referenced_type" : "_ZTIPFvPvS_E"
    },
    {
     "field_name" : "ContextBindProgramRaster",
     "field_offset" : 5824,
     "referenced_type" : "_ZTIPFvPvS_E"
    },
    {
     "field_name" : "ContextBindFont",
     "field_offset" : 5888,
     "referenced_type" : "_ZTIPFvPvS_E"
    },
    {
     "field_name" : "ContextSetSurface",
     "field_offset" : 5952,
     "referenced_type" : "_ZTIPFvPvjjS_E"
    },
    {
     "field_name" : "ContextBindRootScript",
     "field_offset" : 6016,
     "referenced_type" : "_ZTIPFvPvS_E"
    },
    {
     "field_name" : "ProgramStoreCreate",
     "field_offset" : 6080,
     "referenced_type" : "_ZTIPFPvS_bbbbbb14RsBlendSrcFunc14RsBlendDstFunc11RsDepthFuncE"
    },
    {
     "field_name" : "ProgramRasterCreate",
     "field_offset" : 6144,
     "referenced_type" : "_ZTIPFPvS_b10RsCullModeE"
    },
    {
     "field_name" : "ProgramBindConstants",
     "field_offset" : 6208,
     "referenced_type" : "_ZTIPFvPvS_jS_E"
    },
    {
     "field_name" : "ProgramBindTexture",
     "field_offset" : 6272,
     "referenced_type" : "_ZTIPFvPvS_jS_E"
    },
    {
     "field_name" : "ProgramBindSampler",
     "field_offset" : 6336,
     "referenced_type" : "_ZTIPFvPvS_jS_E"
    },
    {
     "field_name" : "ProgramFragmentCreate",
     "field_offset" : 6400,
     "referenced_type" : "_ZTIPFPvS_PKcmPS1_mPKmS4_mE"
    },
    {
     "field_name" : "ProgramVertexCreate",
     "field_offset" : 6464,
     "referenced_type" : "_ZTIPFPvS_PKcmPS1_mPKmS4_mE"
    },
    {
     "field_name" : "FontCreateFromFile",
     "field_offset" : 6528,
     "referenced_type" : "_ZTIPFPvS_PKcmfjE"
    },
    {
     "field_name" : "FontCreateFromMemory",
     "field_offset" : 6592,
     "referenced_type" : "_ZTIPFPvS_PKcmfjPKvmE"
    },
    {
     "field_name" : "MeshCreate",
     "field_offset" : 6656,
     "referenced_type" : "_ZTIPFPvS_PS_mS0_mPjmE"
    },
    {
     "field_name" : "MeshGetVertexBufferCount",
     "field_offset" : 6720,
     "referenced_type" : "_ZTIPFvPvS_PiE"
    },
    {
     "field_name" : "MeshGetIndexCount",
     "field_offset" : 6784,
     "referenced_type" : "_ZTIPFvPvS_PiE"
    },
    {
     "field_name" : "MeshGetVertices",
     "field_offset" : 6848,
     "referenced_type" : "_ZTIPFvPvS_PS_jE"
    },
    {
     "field_name" : "MeshGetIndices",
     "field_offset" : 6912,
     "referenced_type" : "_ZTIPFvPvS_PS_PjjE"
    },
    {
     "field_name" : "FileA3DGetEntryByIndex",
     "field_offset" : 6976,
     "referenced_type" : "_ZTIPFPvS_jS_E"
    },
    {
     "field_name" : "FileA3DGetNumIndexEntries",
     "field_offset" : 7040,
     "referenced_type" : "_ZTIPFvPvPiS_E"
    },
    {
     "field_name" : "FileA3DGetIndexEntries",
     "field_offset" : 7104,
     "referenced_type" : "_ZTIPFvPvP16RsFileIndexEntryjS_E"
    },
    {
     "field_name" : "FileA3DCreateFromMemory",
     "field_offset" : 7168,
     "referenced_type" : "_ZTIPFPvS_PKvjE"
    },
    {
     "field_name" : "FileA3DCreateFromAsset",
     "field_offset" : 7232,
     "referenced_type" : "_ZTIPFPvS_S_E"
    },
    {
     "field_name" : "FileA3DCreateFromFile",
     "field_offset" : 7296,
     "referenced_type" : "_ZTIPFPvS_PKcE"
    }
   ],
   "linker_set_key" : "_ZTI13dispatchTable",
   "name" : "dispatchTable",
   "size" : 920,
   "source_file" : "frameworks/rs/cpp/rsDispatch.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "datap",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    },
    {
     "field_name" : "size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA3_j"
    }
   ],
   "linker_set_key" : "_ZTI13extra_context",
   "name" : "extra_context",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA0_i"
    }
   ],
   "linker_set_key" : "_ZTI13native_handle",
   "name" : "native_handle",
   "size" : 12,
   "source_file" : "system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTI14GlobalObjGuard",
   "name" : "GlobalObjGuard",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "frameworks/rs/rsApiStubs.cpp"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nOptions",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "options",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP12JavaVMOption"
    },
    {
     "field_name" : "ignoreUnrecognized",
     "field_offset" : 128,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI14JavaVMInitArgs",
   "name" : "JavaVMInitArgs",
   "size" : 24,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "i",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI14RsFloatComplex",
   "name" : "RsFloatComplex",
   "size" : 8,
   "source_file" : "frameworks/rs/rsDefines.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI14_jbooleanArray",
   "name" : "_jbooleanArray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "vregs",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA32_o"
    }
   ],
   "linker_set_key" : "_ZTI14fpsimd_context",
   "name" : "fpsimd_context",
   "size" : 528,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA16_c"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "size" : 56,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA12_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "size" : 48,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "head",
     "referenced_type" : "_ZTI12_aarch64_ctx"
    },
    {
     "field_name" : "tpidr2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI14tpidr2_context",
   "name" : "tpidr2_context",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-arm64/asm/sigcontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "signature",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "fnPtr",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI15JNINativeMethod",
   "name" : "JNINativeMethod",
   "size" : 24,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "i",
     "field_offset" : 64,
     "referenced_type" : "_ZTId"
    }
   ],
   "linker_set_key" : "_ZTI15RsDoubleComplex",
   "name" : "RsDoubleComplex",
   "size" : 16,
   "source_file" : "frameworks/rs/rsDefines.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "colorMin",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "colorPref",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "alphaMin",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "alphaPref",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "depthMin",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "depthPref",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stencilMin",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stencilPref",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "samplesMin",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "samplesPref",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "samplesQ",
     "field_offset" : 320,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI15RsSurfaceConfig",
   "name" : "RsSurfaceConfig",
   "size" : 44,
   "source_file" : "frameworks/rs/rsInternalDefines.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "size" : 40,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "group",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI16JavaVMAttachArgs",
   "name" : "JavaVMAttachArgs",
   "size" : 24,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "context",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "dispatch",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPK13dispatchTable"
    }
   ],
   "linker_set_key" : "_ZTI16RsContextWrapper",
   "name" : "RsContextWrapper",
   "size" : 16,
   "source_file" : "frameworks/rs/rsApiStubs.cpp"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "classID",
     "referenced_type" : "_ZTI12RsA3DClassID"
    },
    {
     "field_name" : "objectName",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI16RsFileIndexEntry",
   "name" : "RsFileIndexEntry",
   "size" : 16,
   "source_file" : "frameworks/rs/rsInternalDefines.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTI16RsHidlAdaptation",
   "name" : "RsHidlAdaptation",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "frameworks/rs/rsHidlAdaptation.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA14_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "size" : 56,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "regs",
     "referenced_type" : "_ZTIA31_m"
    },
    {
     "field_name" : "sp",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pc",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "pstate",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI16user_regs_struct",
   "name" : "user_regs_struct",
   "size" : 272,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI17__kernel_timespec",
   "name" : "__kernel_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA4_l"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "DestroyJavaVM",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiP7_JavaVME"
    },
    {
     "field_name" : "AttachCurrentThread",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP7_JavaVMPP7_JNIEnvPvE"
    },
    {
     "field_name" : "DetachCurrentThread",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFiP7_JavaVME"
    },
    {
     "field_name" : "GetEnv",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFiP7_JavaVMPPviE"
    },
    {
     "field_name" : "AttachCurrentThreadAsDaemon",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFiP7_JavaVMPP7_JNIEnvPvE"
    }
   ],
   "linker_set_key" : "_ZTI18JNIInvokeInterface",
   "name" : "JNIInvokeInterface",
   "size" : 64,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "GetVersion",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP7_JNIEnvE"
    },
    {
     "field_name" : "DefineClass",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvPKcP8_jobjectPKaiE"
    },
    {
     "field_name" : "FindClass",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvPKcE"
    },
    {
     "field_name" : "FromReflectedMethod",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "FromReflectedField",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "ToReflectedMethod",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDhE"
    },
    {
     "field_name" : "GetSuperclass",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvS0_E"
    },
    {
     "field_name" : "IsAssignableFrom",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassS2_E"
    },
    {
     "field_name" : "ToReflectedField",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP9_jfieldIDhE"
    },
    {
     "field_name" : "Throw",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP11_jthrowableE"
    },
    {
     "field_name" : "ThrowNew",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassPKcE"
    },
    {
     "field_name" : "ExceptionOccurred",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPFP11_jthrowableP7_JNIEnvE"
    },
    {
     "field_name" : "ExceptionDescribe",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPFvP7_JNIEnvE"
    },
    {
     "field_name" : "ExceptionClear",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPFvP7_JNIEnvE"
    },
    {
     "field_name" : "FatalError",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPFvP7_JNIEnvPKcE"
    },
    {
     "field_name" : "PushLocalFrame",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPFiP7_JNIEnviE"
    },
    {
     "field_name" : "PopLocalFrame",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "NewGlobalRef",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "DeleteGlobalRef",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "DeleteLocalRef",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "IsSameObject",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectS2_E"
    },
    {
     "field_name" : "NewLocalRef",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "EnsureLocalCapacity",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIPFiP7_JNIEnviE"
    },
    {
     "field_name" : "AllocObject",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassE"
    },
    {
     "field_name" : "NewObject",
     "field_offset" : 1792,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "NewObjectV",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "NewObjectA",
     "field_offset" : 1920,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetObjectClass",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "IsInstanceOf",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassE"
    },
    {
     "field_name" : "GetMethodID",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "CallObjectMethod",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDzE"
    },
    {
     "field_name" : "CallObjectMethodV",
     "field_offset" : 2240,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallObjectMethodA",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallBooleanMethod",
     "field_offset" : 2368,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallBooleanMethodV",
     "field_offset" : 2432,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallBooleanMethodA",
     "field_offset" : 2496,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallByteMethod",
     "field_offset" : 2560,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallByteMethodV",
     "field_offset" : 2624,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallByteMethodA",
     "field_offset" : 2688,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallCharMethod",
     "field_offset" : 2752,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallCharMethodV",
     "field_offset" : 2816,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallCharMethodA",
     "field_offset" : 2880,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallShortMethod",
     "field_offset" : 2944,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallShortMethodV",
     "field_offset" : 3008,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallShortMethodA",
     "field_offset" : 3072,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallIntMethod",
     "field_offset" : 3136,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallIntMethodV",
     "field_offset" : 3200,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallIntMethodA",
     "field_offset" : 3264,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallLongMethod",
     "field_offset" : 3328,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallLongMethodV",
     "field_offset" : 3392,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallLongMethodA",
     "field_offset" : 3456,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallFloatMethod",
     "field_offset" : 3520,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallFloatMethodV",
     "field_offset" : 3584,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallFloatMethodA",
     "field_offset" : 3648,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallDoubleMethod",
     "field_offset" : 3712,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallDoubleMethodV",
     "field_offset" : 3776,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallDoubleMethodA",
     "field_offset" : 3840,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallVoidMethod",
     "field_offset" : 3904,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallVoidMethodV",
     "field_offset" : 3968,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallVoidMethodA",
     "field_offset" : 4032,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethod",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodV",
     "field_offset" : 4160,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodA",
     "field_offset" : 4224,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethod",
     "field_offset" : 4288,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodV",
     "field_offset" : 4352,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodA",
     "field_offset" : 4416,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualByteMethod",
     "field_offset" : 4480,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualByteMethodV",
     "field_offset" : 4544,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualByteMethodA",
     "field_offset" : 4608,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualCharMethod",
     "field_offset" : 4672,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualCharMethodV",
     "field_offset" : 4736,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualCharMethodA",
     "field_offset" : 4800,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualShortMethod",
     "field_offset" : 4864,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualShortMethodV",
     "field_offset" : 4928,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualShortMethodA",
     "field_offset" : 4992,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualIntMethod",
     "field_offset" : 5056,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualIntMethodV",
     "field_offset" : 5120,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualIntMethodA",
     "field_offset" : 5184,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualLongMethod",
     "field_offset" : 5248,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualLongMethodV",
     "field_offset" : 5312,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualLongMethodA",
     "field_offset" : 5376,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethod",
     "field_offset" : 5440,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodV",
     "field_offset" : 5504,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodA",
     "field_offset" : 5568,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethod",
     "field_offset" : 5632,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodV",
     "field_offset" : 5696,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodA",
     "field_offset" : 5760,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethod",
     "field_offset" : 5824,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodV",
     "field_offset" : 5888,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodA",
     "field_offset" : 5952,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetFieldID",
     "field_offset" : 6016,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "GetObjectField",
     "field_offset" : 6080,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P9_jfieldIDE"
    },
    {
     "field_name" : "GetBooleanField",
     "field_offset" : 6144,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetByteField",
     "field_offset" : 6208,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetCharField",
     "field_offset" : 6272,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetShortField",
     "field_offset" : 6336,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetIntField",
     "field_offset" : 6400,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetLongField",
     "field_offset" : 6464,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetFloatField",
     "field_offset" : 6528,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetDoubleField",
     "field_offset" : 6592,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "SetObjectField",
     "field_offset" : 6656,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDS2_E"
    },
    {
     "field_name" : "SetBooleanField",
     "field_offset" : 6720,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDhE"
    },
    {
     "field_name" : "SetByteField",
     "field_offset" : 6784,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDaE"
    },
    {
     "field_name" : "SetCharField",
     "field_offset" : 6848,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDtE"
    },
    {
     "field_name" : "SetShortField",
     "field_offset" : 6912,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDsE"
    },
    {
     "field_name" : "SetIntField",
     "field_offset" : 6976,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDiE"
    },
    {
     "field_name" : "SetLongField",
     "field_offset" : 7040,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDlE"
    },
    {
     "field_name" : "SetFloatField",
     "field_offset" : 7104,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDfE"
    },
    {
     "field_name" : "SetDoubleField",
     "field_offset" : 7168,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDdE"
    },
    {
     "field_name" : "GetStaticMethodID",
     "field_offset" : 7232,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "CallStaticObjectMethod",
     "field_offset" : 7296,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticObjectMethodV",
     "field_offset" : 7360,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticObjectMethodA",
     "field_offset" : 7424,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticBooleanMethod",
     "field_offset" : 7488,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticBooleanMethodV",
     "field_offset" : 7552,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticBooleanMethodA",
     "field_offset" : 7616,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticByteMethod",
     "field_offset" : 7680,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticByteMethodV",
     "field_offset" : 7744,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticByteMethodA",
     "field_offset" : 7808,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticCharMethod",
     "field_offset" : 7872,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticCharMethodV",
     "field_offset" : 7936,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticCharMethodA",
     "field_offset" : 8000,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticShortMethod",
     "field_offset" : 8064,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticShortMethodV",
     "field_offset" : 8128,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticShortMethodA",
     "field_offset" : 8192,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticIntMethod",
     "field_offset" : 8256,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticIntMethodV",
     "field_offset" : 8320,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticIntMethodA",
     "field_offset" : 8384,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticLongMethod",
     "field_offset" : 8448,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticLongMethodV",
     "field_offset" : 8512,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticLongMethodA",
     "field_offset" : 8576,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticFloatMethod",
     "field_offset" : 8640,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticFloatMethodV",
     "field_offset" : 8704,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticFloatMethodA",
     "field_offset" : 8768,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticDoubleMethod",
     "field_offset" : 8832,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticDoubleMethodV",
     "field_offset" : 8896,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticDoubleMethodA",
     "field_offset" : 8960,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticVoidMethod",
     "field_offset" : 9024,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticVoidMethodV",
     "field_offset" : 9088,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticVoidMethodA",
     "field_offset" : 9152,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetStaticFieldID",
     "field_offset" : 9216,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "GetStaticObjectField",
     "field_offset" : 9280,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticBooleanField",
     "field_offset" : 9344,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticByteField",
     "field_offset" : 9408,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticCharField",
     "field_offset" : 9472,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticShortField",
     "field_offset" : 9536,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticIntField",
     "field_offset" : 9600,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticLongField",
     "field_offset" : 9664,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticFloatField",
     "field_offset" : 9728,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticDoubleField",
     "field_offset" : 9792,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "SetStaticObjectField",
     "field_offset" : 9856,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDP8_jobjectE"
    },
    {
     "field_name" : "SetStaticBooleanField",
     "field_offset" : 9920,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDhE"
    },
    {
     "field_name" : "SetStaticByteField",
     "field_offset" : 9984,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDaE"
    },
    {
     "field_name" : "SetStaticCharField",
     "field_offset" : 10048,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDtE"
    },
    {
     "field_name" : "SetStaticShortField",
     "field_offset" : 10112,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDsE"
    },
    {
     "field_name" : "SetStaticIntField",
     "field_offset" : 10176,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDiE"
    },
    {
     "field_name" : "SetStaticLongField",
     "field_offset" : 10240,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDlE"
    },
    {
     "field_name" : "SetStaticFloatField",
     "field_offset" : 10304,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDfE"
    },
    {
     "field_name" : "SetStaticDoubleField",
     "field_offset" : 10368,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDdE"
    },
    {
     "field_name" : "NewString",
     "field_offset" : 10432,
     "referenced_type" : "_ZTIPFP8_jstringP7_JNIEnvPKtiE"
    },
    {
     "field_name" : "GetStringLength",
     "field_offset" : 10496,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jstringE"
    },
    {
     "field_name" : "GetStringChars",
     "field_offset" : 10560,
     "referenced_type" : "_ZTIPFPKtP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringChars",
     "field_offset" : 10624,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKtE"
    },
    {
     "field_name" : "NewStringUTF",
     "field_offset" : 10688,
     "referenced_type" : "_ZTIPFP8_jstringP7_JNIEnvPKcE"
    },
    {
     "field_name" : "GetStringUTFLength",
     "field_offset" : 10752,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jstringE"
    },
    {
     "field_name" : "GetStringUTFChars",
     "field_offset" : 10816,
     "referenced_type" : "_ZTIPFPKcP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringUTFChars",
     "field_offset" : 10880,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKcE"
    },
    {
     "field_name" : "GetArrayLength",
     "field_offset" : 10944,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jarrayE"
    },
    {
     "field_name" : "NewObjectArray",
     "field_offset" : 11008,
     "referenced_type" : "_ZTIPFP13_jobjectArrayP7_JNIEnviP7_jclassP8_jobjectE"
    },
    {
     "field_name" : "GetObjectArrayElement",
     "field_offset" : 11072,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP13_jobjectArrayiE"
    },
    {
     "field_name" : "SetObjectArrayElement",
     "field_offset" : 11136,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jobjectArrayiP8_jobjectE"
    },
    {
     "field_name" : "NewBooleanArray",
     "field_offset" : 11200,
     "referenced_type" : "_ZTIPFP14_jbooleanArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewByteArray",
     "field_offset" : 11264,
     "referenced_type" : "_ZTIPFP11_jbyteArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewCharArray",
     "field_offset" : 11328,
     "referenced_type" : "_ZTIPFP11_jcharArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewShortArray",
     "field_offset" : 11392,
     "referenced_type" : "_ZTIPFP12_jshortArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewIntArray",
     "field_offset" : 11456,
     "referenced_type" : "_ZTIPFP10_jintArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewLongArray",
     "field_offset" : 11520,
     "referenced_type" : "_ZTIPFP11_jlongArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewFloatArray",
     "field_offset" : 11584,
     "referenced_type" : "_ZTIPFP12_jfloatArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewDoubleArray",
     "field_offset" : 11648,
     "referenced_type" : "_ZTIPFP13_jdoubleArrayP7_JNIEnviE"
    },
    {
     "field_name" : "GetBooleanArrayElements",
     "field_offset" : 11712,
     "referenced_type" : "_ZTIPFPhP7_JNIEnvP14_jbooleanArrayS_E"
    },
    {
     "field_name" : "GetByteArrayElements",
     "field_offset" : 11776,
     "referenced_type" : "_ZTIPFPaP7_JNIEnvP11_jbyteArrayPhE"
    },
    {
     "field_name" : "GetCharArrayElements",
     "field_offset" : 11840,
     "referenced_type" : "_ZTIPFPtP7_JNIEnvP11_jcharArrayPhE"
    },
    {
     "field_name" : "GetShortArrayElements",
     "field_offset" : 11904,
     "referenced_type" : "_ZTIPFPsP7_JNIEnvP12_jshortArrayPhE"
    },
    {
     "field_name" : "GetIntArrayElements",
     "field_offset" : 11968,
     "referenced_type" : "_ZTIPFPiP7_JNIEnvP10_jintArrayPhE"
    },
    {
     "field_name" : "GetLongArrayElements",
     "field_offset" : 12032,
     "referenced_type" : "_ZTIPFPlP7_JNIEnvP11_jlongArrayPhE"
    },
    {
     "field_name" : "GetFloatArrayElements",
     "field_offset" : 12096,
     "referenced_type" : "_ZTIPFPfP7_JNIEnvP12_jfloatArrayPhE"
    },
    {
     "field_name" : "GetDoubleArrayElements",
     "field_offset" : 12160,
     "referenced_type" : "_ZTIPFPdP7_JNIEnvP13_jdoubleArrayPhE"
    },
    {
     "field_name" : "ReleaseBooleanArrayElements",
     "field_offset" : 12224,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayPhiE"
    },
    {
     "field_name" : "ReleaseByteArrayElements",
     "field_offset" : 12288,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayPaiE"
    },
    {
     "field_name" : "ReleaseCharArrayElements",
     "field_offset" : 12352,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayPtiE"
    },
    {
     "field_name" : "ReleaseShortArrayElements",
     "field_offset" : 12416,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayPsiE"
    },
    {
     "field_name" : "ReleaseIntArrayElements",
     "field_offset" : 12480,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayPiiE"
    },
    {
     "field_name" : "ReleaseLongArrayElements",
     "field_offset" : 12544,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayPliE"
    },
    {
     "field_name" : "ReleaseFloatArrayElements",
     "field_offset" : 12608,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayPfiE"
    },
    {
     "field_name" : "ReleaseDoubleArrayElements",
     "field_offset" : 12672,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayPdiE"
    },
    {
     "field_name" : "GetBooleanArrayRegion",
     "field_offset" : 12736,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayiiPhE"
    },
    {
     "field_name" : "GetByteArrayRegion",
     "field_offset" : 12800,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayiiPaE"
    },
    {
     "field_name" : "GetCharArrayRegion",
     "field_offset" : 12864,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayiiPtE"
    },
    {
     "field_name" : "GetShortArrayRegion",
     "field_offset" : 12928,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayiiPsE"
    },
    {
     "field_name" : "GetIntArrayRegion",
     "field_offset" : 12992,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayiiPiE"
    },
    {
     "field_name" : "GetLongArrayRegion",
     "field_offset" : 13056,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayiiPlE"
    },
    {
     "field_name" : "GetFloatArrayRegion",
     "field_offset" : 13120,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayiiPfE"
    },
    {
     "field_name" : "GetDoubleArrayRegion",
     "field_offset" : 13184,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayiiPdE"
    },
    {
     "field_name" : "SetBooleanArrayRegion",
     "field_offset" : 13248,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayiiPKhE"
    },
    {
     "field_name" : "SetByteArrayRegion",
     "field_offset" : 13312,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayiiPKaE"
    },
    {
     "field_name" : "SetCharArrayRegion",
     "field_offset" : 13376,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayiiPKtE"
    },
    {
     "field_name" : "SetShortArrayRegion",
     "field_offset" : 13440,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayiiPKsE"
    },
    {
     "field_name" : "SetIntArrayRegion",
     "field_offset" : 13504,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayiiPKiE"
    },
    {
     "field_name" : "SetLongArrayRegion",
     "field_offset" : 13568,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayiiPKlE"
    },
    {
     "field_name" : "SetFloatArrayRegion",
     "field_offset" : 13632,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayiiPKfE"
    },
    {
     "field_name" : "SetDoubleArrayRegion",
     "field_offset" : 13696,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayiiPKdE"
    },
    {
     "field_name" : "RegisterNatives",
     "field_offset" : 13760,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassPK15JNINativeMethodiE"
    },
    {
     "field_name" : "UnregisterNatives",
     "field_offset" : 13824,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassE"
    },
    {
     "field_name" : "MonitorEnter",
     "field_offset" : 13888,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "MonitorExit",
     "field_offset" : 13952,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetJavaVM",
     "field_offset" : 14016,
     "referenced_type" : "_ZTIPFiP7_JNIEnvPP7_JavaVME"
    },
    {
     "field_name" : "GetStringRegion",
     "field_offset" : 14080,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringiiPtE"
    },
    {
     "field_name" : "GetStringUTFRegion",
     "field_offset" : 14144,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringiiPcE"
    },
    {
     "field_name" : "GetPrimitiveArrayCritical",
     "field_offset" : 14208,
     "referenced_type" : "_ZTIPFPvP7_JNIEnvP7_jarrayPhE"
    },
    {
     "field_name" : "ReleasePrimitiveArrayCritical",
     "field_offset" : 14272,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jarrayPviE"
    },
    {
     "field_name" : "GetStringCritical",
     "field_offset" : 14336,
     "referenced_type" : "_ZTIPFPKtP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringCritical",
     "field_offset" : 14400,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKtE"
    },
    {
     "field_name" : "NewWeakGlobalRef",
     "field_offset" : 14464,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "DeleteWeakGlobalRef",
     "field_offset" : 14528,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "ExceptionCheck",
     "field_offset" : 14592,
     "referenced_type" : "_ZTIPFhP7_JNIEnvE"
    },
    {
     "field_name" : "NewDirectByteBuffer",
     "field_offset" : 14656,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvPvlE"
    },
    {
     "field_name" : "GetDirectBufferAddress",
     "field_offset" : 14720,
     "referenced_type" : "_ZTIPFPvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetDirectBufferCapacity",
     "field_offset" : 14784,
     "referenced_type" : "_ZTIPFlP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetObjectRefType",
     "field_offset" : 14848,
     "referenced_type" : "_ZTIPF14jobjectRefTypeP7_JNIEnvP8_jobjectE"
    }
   ],
   "linker_set_key" : "_ZTI18JNINativeInterface",
   "name" : "JNINativeInterface",
   "size" : 1864,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "e",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "dimX",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dimY",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "dimZ",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mipmaps",
     "field_offset" : 160,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "faces",
     "field_offset" : 168,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "yuv",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array0",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array1",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array2",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array3",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18RsTypeCreateParams",
   "name" : "RsTypeCreateParams",
   "size" : 48,
   "source_file" : "frameworks/rs/rsInternalDefines.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_flags",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFvvE"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 192,
     "referenced_type" : "_ZTI8sigset_t"
    }
   ],
   "linker_set_key" : "_ZTI18__kernel_sigaction",
   "name" : "__kernel_sigaction",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/pthread_types.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "vregs",
     "referenced_type" : "_ZTIA32_o"
    },
    {
     "field_name" : "fpsr",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fpcr",
     "field_offset" : 4128,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI18user_fpsimd_struct",
   "name" : "user_fpsimd_struct",
   "size" : 528,
   "source_file" : "bionic/libc/include/sys/user.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI17__kernel_timespec"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI17__kernel_timespec"
    }
   ],
   "linker_set_key" : "_ZTI19__kernel_itimerspec",
   "name" : "__kernel_itimerspec",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__cleanup_prev",
     "referenced_type" : "_ZTIP19__pthread_cleanup_t"
    },
    {
     "field_name" : "__cleanup_routine",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFvPvE"
    },
    {
     "field_name" : "__cleanup_arg",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI19__pthread_cleanup_t",
   "name" : "__pthread_cleanup_t",
   "size" : 24,
   "source_file" : "bionic/libc/include/pthread.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTI20RsFallbackAdaptation",
   "name" : "RsFallbackAdaptation",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "frameworks/rs/rsFallbackAdaptation.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "size" : 48,
   "source_file" : "system/logging/liblog/include/android/log.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_old_timespec",
   "name" : "__kernel_old_timespec",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI21__kernel_sock_timeval",
   "name" : "__kernel_sock_timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tm_sec",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_min",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_hour",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mday",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_mon",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_year",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_wday",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_yday",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_isdst",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tm_gmtoff",
     "field_offset" : 320,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tm_zone",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI2tm",
   "name" : "tm",
   "size" : 56,
   "source_file" : "bionic/libc/include/time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5div_t",
   "name" : "div_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "decimal_point",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "thousands_sep",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "grouping",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "int_curr_symbol",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "currency_symbol",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mon_decimal_point",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mon_thousands_sep",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mon_grouping",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "positive_sign",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "negative_sign",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "int_frac_digits",
     "field_offset" : 640,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "frac_digits",
     "field_offset" : 648,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "p_cs_precedes",
     "field_offset" : 656,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "p_sep_by_space",
     "field_offset" : 664,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "n_cs_precedes",
     "field_offset" : 672,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "n_sep_by_space",
     "field_offset" : 680,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "p_sign_posn",
     "field_offset" : 688,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "n_sign_posn",
     "field_offset" : 696,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_p_cs_precedes",
     "field_offset" : 704,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_p_sep_by_space",
     "field_offset" : 712,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_n_cs_precedes",
     "field_offset" : 720,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_n_sep_by_space",
     "field_offset" : 728,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_p_sign_posn",
     "field_offset" : 736,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "int_n_sign_posn",
     "field_offset" : 744,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI5lconv",
   "name" : "lconv",
   "size" : 96,
   "source_file" : "bionic/libc/include/locale.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_ino",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "d_off",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "d_reclen",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "d_type",
     "field_offset" : 144,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "d_name",
     "field_offset" : 152,
     "referenced_type" : "_ZTIA256_c"
    }
   ],
   "linker_set_key" : "_ZTI6dirent",
   "name" : "dirent",
   "size" : 280,
   "source_file" : "bionic/libc/include/dirent.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI6fd_set",
   "name" : "fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/include/sys/select.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "z",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "b",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "c",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "s",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "i",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "j",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "f",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "d",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "l",
     "referenced_type" : "_ZTIP8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI6jvalue",
   "name" : "jvalue",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI6ldiv_t",
   "name" : "ldiv_t",
   "size" : 16,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sival_int",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sival_ptr",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI6sigval",
   "name" : "sigval",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "dli_fname",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "dli_fbase",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "dli_sname",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "dli_saddr",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI7Dl_info",
   "name" : "Dl_info",
   "size" : 32,
   "source_file" : "bionic/libc/include/dlfcn.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "_ZTIPK18JNINativeInterface"
    }
   ],
   "linker_set_key" : "_ZTI7_JNIEnv",
   "name" : "_JNIEnv",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "_ZTIPK18JNIInvokeInterface"
    }
   ],
   "linker_set_key" : "_ZTI7_JavaVM",
   "name" : "_JavaVM",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI7_jarray",
   "name" : "_jarray",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI7_jclass",
   "name" : "_jclass",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI7lldiv_t",
   "name" : "lldiv_t",
   "size" : 16,
   "source_file" : "bionic/libc/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7siginfo",
   "name" : "siginfo",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_usec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI7timeval",
   "name" : "timeval",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTI8_jobject",
   "name" : "_jobject",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI8_jstring",
   "name" : "_jstring",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d_ino",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "d_off",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "d_reclen",
     "field_offset" : 128,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "d_type",
     "field_offset" : 144,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "d_name",
     "field_offset" : 152,
     "referenced_type" : "_ZTIA256_c"
    }
   ],
   "linker_set_key" : "_ZTI8dirent64",
   "name" : "dirent64",
   "size" : 280,
   "source_file" : "bionic/libc/include/dirent.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sAllocationSetSurface",
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectPvS3_S3_13dispatchTableE"
    }
   ],
   "linker_set_key" : "_ZTI8ioSuppDT",
   "name" : "ioSuppDT",
   "size" : 8,
   "source_file" : "frameworks/rs/cpp/rsDispatch.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "size" : 8,
   "source_file" : "system/logging/liblog/include/log/log_time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI8mallinfo",
   "name" : "mallinfo",
   "size" : 80,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sigev_value",
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "sigev_signo",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sigev_notify",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_un",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN8sigeventUt_E"
    }
   ],
   "linker_set_key" : "_ZTI8sigevent",
   "name" : "sigevent",
   "size" : 64,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sig",
     "referenced_type" : "_ZTIA1_m"
    }
   ],
   "linker_set_key" : "_ZTI8sigset_t",
   "name" : "sigset_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/signal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI8timespec",
   "name" : "timespec",
   "size" : 16,
   "source_file" : "bionic/libc/include/bits/timespec.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "tz_minuteswest",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tz_dsttime",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI8timezone",
   "name" : "timezone",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "uc_flags",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uc_link",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8ucontext"
    },
    {
     "field_name" : "uc_stack",
     "field_offset" : 128,
     "referenced_type" : "_ZTI11sigaltstack"
    },
    {
     "field_offset" : 320,
     "referenced_type" : "_ZTIN8ucontextUt_E"
    },
    {
     "field_name" : "__padding",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA120_c"
    },
    {
     "field_name" : "uc_mcontext",
     "field_offset" : 1408,
     "referenced_type" : "_ZTI10sigcontext"
    }
   ],
   "linker_set_key" : "_ZTI8ucontext",
   "name" : "ucontext",
   "size" : 4560,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__bits",
     "referenced_type" : "_ZTIA16_m"
    }
   ],
   "linker_set_key" : "_ZTI9cpu_set_t",
   "name" : "cpu_set_t",
   "size" : 128,
   "source_file" : "bionic/libc/include/sched.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "it_interval",
     "referenced_type" : "_ZTI7timeval"
    },
    {
     "field_name" : "it_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTI7timeval"
    }
   ],
   "linker_set_key" : "_ZTI9itimerval",
   "name" : "itimerval",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/linux/time.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 512,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 576,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI9mallinfo2",
   "name" : "mallinfo2",
   "size" : 80,
   "source_file" : "bionic/libc/include/malloc.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "__seq",
     "referenced_type" : "_ZTIA4_h"
    },
    {
     "field_name" : "__reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA4_h"
    }
   ],
   "linker_set_key" : "_ZTI9mbstate_t",
   "name" : "mbstate_t",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/mbstate_t.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_flags",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN9sigactionUt_E"
    },
    {
     "field_name" : "sa_mask",
     "field_offset" : 128,
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "sa_restorer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFvvE"
    }
   ],
   "linker_set_key" : "_ZTI9sigaction",
   "name" : "sigaction",
   "size" : 32,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_overrun",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    },
    {
     "field_name" : "_sys_private",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt0_E",
   "name" : "__sifields::(unnamed)",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_sigval",
     "field_offset" : 64,
     "referenced_type" : "_ZTI6sigval"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt1_E",
   "name" : "__sifields::(unnamed)",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_status",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_utime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_stime",
     "field_offset" : 192,
     "referenced_type" : "_ZTIl"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt2_E",
   "name" : "__sifields::(unnamed)",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_offset" : 64,
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_E",
   "name" : "__sifields::(unnamed)",
   "size" : 32,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_trapno",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_addr_lsb",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "_addr_bnd",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut_E"
    },
    {
     "field_name" : "_addr_pkey",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E"
    },
    {
     "field_name" : "_perf",
     "referenced_type" : "_ZTIN10__sifieldsUt3_Ut_Ut1_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_E",
   "name" : "__sifields::(unnamed)::(anonymous)",
   "record_kind" : "union",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_dummy_pkey",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "_pkey",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut0_E",
   "name" : "__sifields::(unnamed)::(anonymous)::(unnamed)",
   "size" : 12,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_data",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "_type",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "_flags",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut1_E",
   "name" : "__sifields::(unnamed)::(anonymous)::(unnamed)",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_dummy_bnd",
     "referenced_type" : "_ZTIA8_c"
    },
    {
     "field_name" : "_lower",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_upper",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt3_Ut_Ut_E",
   "name" : "__sifields::(unnamed)::(anonymous)::(unnamed)",
   "size" : 24,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_band",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "_fd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt4_E",
   "name" : "__sifields::(unnamed)",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_call_addr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "_syscall",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_arch",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt5_E",
   "name" : "__sifields::(unnamed)",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "_pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_uid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10__sifieldsUt_E",
   "name" : "__sifields::(unnamed)",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11sigaction64Ut_E",
   "name" : "sigaction64::(anonymous)",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "template_args" :
   [
    "_ZTIN7android12NativeHandleE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "template_args" :
   [
    "_ZTIN7android19VirtualLightRefBaseE"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_12NativeHandleEEE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP13native_handle"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android12NativeHandleE",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "size" : 24,
   "source_file" : "system/core/libutils/include/utils/NativeHandle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android14ReferenceMoverE",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIN7android16ReferenceRenamerE",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEm"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIbEE",
   "name" : "android::trait_trivial_copy<bool>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIcEE",
   "name" : "android::trait_trivial_copy<char>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIdEE",
   "name" : "android::trait_trivial_copy<double>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIfEE",
   "name" : "android::trait_trivial_copy<float>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIhEE",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIiEE",
   "name" : "android::trait_trivial_copy<int>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIjEE",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIlEE",
   "name" : "android::trait_trivial_copy<long>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyImEE",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIsEE",
   "name" : "android::trait_trivial_copy<short>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIs"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyItEE",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIt"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIvEE",
   "name" : "android::trait_trivial_copy<void>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIxEE",
   "name" : "android::trait_trivial_copy<long long>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIyEE",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "name" : "android::trait_trivial_ctor<bool>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "name" : "android::trait_trivial_ctor<char>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "name" : "android::trait_trivial_ctor<double>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "name" : "android::trait_trivial_ctor<float>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "name" : "android::trait_trivial_ctor<int>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "name" : "android::trait_trivial_ctor<long>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorImEE",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "name" : "android::trait_trivial_ctor<short>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIs"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorItEE",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIt"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "name" : "android::trait_trivial_ctor<void>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "name" : "android::trait_trivial_ctor<long long>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "name" : "android::trait_trivial_dtor<bool>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "name" : "android::trait_trivial_dtor<char>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "name" : "android::trait_trivial_dtor<double>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "name" : "android::trait_trivial_dtor<float>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "name" : "android::trait_trivial_dtor<int>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "name" : "android::trait_trivial_dtor<long>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorImEE",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "name" : "android::trait_trivial_dtor<short>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIs"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorItEE",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIt"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "name" : "android::trait_trivial_dtor<void>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "name" : "android::trait_trivial_dtor<long long>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIbEE",
   "name" : "android::trait_trivial_move<bool>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIcEE",
   "name" : "android::trait_trivial_move<char>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIdEE",
   "name" : "android::trait_trivial_move<double>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIfEE",
   "name" : "android::trait_trivial_move<float>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIhEE",
   "name" : "android::trait_trivial_move<unsigned char>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIiEE",
   "name" : "android::trait_trivial_move<int>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIjEE",
   "name" : "android::trait_trivial_move<unsigned int>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIlEE",
   "name" : "android::trait_trivial_move<long>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveImEE",
   "name" : "android::trait_trivial_move<unsigned long>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIsEE",
   "name" : "android::trait_trivial_move<short>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIs"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveItEE",
   "name" : "android::trait_trivial_move<unsigned short>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIt"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIvEE",
   "name" : "android::trait_trivial_move<void>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIxEE",
   "name" : "android::trait_trivial_move<long long>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIyEE",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android19VirtualLightRefBaseE",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl4base4V1_05IBaseEEE",
   "name" : "android::sp<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" :
   [
    "_ZTIN7android4hidl4base4V1_05IBaseE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android4hidl7manager4V1_020IServiceNotificationE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE",
   "name" : "android::sp<android::hidl::manager::V1_0::IServiceNotification>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" :
   [
    "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware12renderscript4V1_07IDeviceE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware12renderscript4V1_07IDeviceEEE",
   "name" : "android::sp<android::hardware::renderscript::V1_0::IDevice>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" :
   [
    "_ZTIN7android8hardware12renderscript4V1_07IDeviceE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware12renderscript4V1_08IContextE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware12renderscript4V1_08IContextEEE",
   "name" : "android::sp<android::hardware::renderscript::V1_0::IContext>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" :
   [
    "_ZTIN7android8hardware12renderscript4V1_08IContextE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android8hardware20hidl_death_recipientE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_8hardware20hidl_death_recipientEEE",
   "name" : "android::sp<android::hardware::hidl_death_recipient>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" :
   [
    "_ZTIN7android8hardware20hidl_death_recipientE"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl4base4V1_05IBaseE",
   "name" : "android::hidl::base::V1_0::IBase",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/IBase.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_05IBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ptr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "arch",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android4hidl4base4V1_09DebugInfo12ArchitectureE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl4base4V1_09DebugInfoE",
   "name" : "android::hidl::base::V1_0::DebugInfo",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/types.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE",
   "name" : "android::hidl::manager::V1_0::IServiceNotification",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceNotification.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl7manager4V1_020IServiceNotification8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14onRegistrationERKNS_8hardware11hidl_stringES7_b"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7RefBase12weakref_typeE",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPN7android7RefBase12weakref_implE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7RefBaseE",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android8hardware11hidl_memoryE"
    },
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware10HidlMemoryE",
   "name" : "android::hardware::HidlMemory",
   "record_kind" : "class",
   "size" : 64,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware10HidlMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEE"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 72,
     "referenced_type" : "_ZTIA7_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11hidl_handleE",
   "name" : "android::hardware::hidl_handle",
   "size" : 16,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "_ZTIN7android8hardware11hidl_handleE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 192,
     "referenced_type" : "_ZTIN7android8hardware11hidl_stringE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11hidl_memoryE",
   "name" : "android::hardware::hidl_memory",
   "size" : 40,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware11hidl_stringE",
   "name" : "android::hardware::hidl_string",
   "size" : 16,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMajor",
     "referenced_type" : "_ZTIt"
    },
    {
     "access" : "private",
     "field_name" : "mMinor",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware12hidl_versionE",
   "name" : "android::hardware::hidl_version",
   "size" : 4,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "strategy",
     "referenced_type" : "_ZTIN7android8hardware12renderscript4V1_015ForEachStrategyE"
    },
    {
     "field_name" : "xStart",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "xEnd",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "yStart",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "yEnd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "zStart",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "zEnd",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "arrayStart",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "arrayEnd",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array2Start",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array2End",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array3Start",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array3End",
     "field_offset" : 384,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array4Start",
     "field_offset" : 416,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "array4End",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware12renderscript4V1_010ScriptCallE",
   "name" : "android::hardware::renderscript::V1_0::ScriptCall",
   "size" : 60,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/renderscript/1.0/android.hardware.renderscript@1.0_genc++_headers/gen/android/hardware/renderscript/1.0/types.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware12renderscript4V1_07IDeviceE",
   "name" : "android::hardware::renderscript::V1_0::IDevice",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/renderscript/1.0/android.hardware.renderscript@1.0_genc++_headers/gen/android/hardware/renderscript/1.0/IDevice.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12renderscript4V1_07IDeviceE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware12renderscript4V1_07IDevice8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_07IDevice14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_07IDevice5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_07IDevice19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_07IDevice12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_07IDevice21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_07IDevice11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_07IDevice4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_07IDevice12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_07IDevice21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_07IDevice13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_07IDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_07IDeviceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_07IDevice13contextCreateEjNS2_11ContextTypeEi"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12renderscript4V1_07IDeviceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware12renderscript4V1_07IDeviceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware12renderscript4V1_07IDeviceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware12renderscript4V1_08IContextE",
   "name" : "android::hardware::renderscript::V1_0::IContext",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/hardware/interfaces/renderscript/1.0/android.hardware.renderscript@1.0_genc++_headers/gen/android/hardware/renderscript/1.0/IContext.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12renderscript4V1_08IContextE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware12renderscript4V1_08IContext8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLm32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEm"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContextD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext23allocationAdapterCreateEmm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext23allocationAdapterOffsetEmRKNS0_8hidl_vecIjEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext17allocationGetTypeEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext21allocationCreateTypedEmNS2_23AllocationMipmapControlEiPv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext26allocationCreateFromBitmapEmNS2_23AllocationMipmapControlERKNS0_8hidl_vecIhEEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext30allocationCubeCreateFromBitmapEmNS2_23AllocationMipmapControlERKNS0_8hidl_vecIhEEi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext25allocationGetNativeWindowEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext25allocationSetNativeWindowEmm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext26allocationSetupBufferQueueEmj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext26allocationShareBufferQueueEmm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext22allocationCopyToBitmapEmPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext17allocation1DWriteEmjjjRKNS0_8hidl_vecIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext22allocationElementWriteEmjjjjRKNS0_8hidl_vecIhEEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext17allocation2DWriteEmjjjNS2_21AllocationCubemapFaceEjjRKNS0_8hidl_vecIhEEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext17allocation3DWriteEmjjjjjjjRKNS0_8hidl_vecIhEEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext25allocationGenerateMipmapsEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext14allocationReadEmPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext16allocation1DReadEmjjjPvm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext21allocationElementReadEmjjjjPvmm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext16allocation2DReadEmjjjNS2_21AllocationCubemapFaceEjjPvmm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext16allocation3DReadEmjjjjjjjPvmm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext17allocationSyncAllEmNS2_19AllocationUsageTypeE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext18allocationResize1DEmj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext21allocationCopy2DRangeEmjjjNS2_21AllocationCubemapFaceEjjmjjjS4_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext21allocationCopy3DRangeEmjjjjjjjmjjjj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext16allocationIoSendEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext19allocationIoReceiveEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext20allocationGetPointerEmjNS2_21AllocationCubemapFaceEjNSt3__18functionIFvPvmEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext24elementGetNativeMetadataEmNSt3__18functionIFvRKNS0_8hidl_vecIjEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext21elementGetSubElementsEmmNSt3__18functionIFvRKNS0_8hidl_vecImEERKNS6_INS0_11hidl_stringEEES9_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext13elementCreateENS2_8DataTypeENS2_8DataKindEbj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext20elementComplexCreateERKNS0_8hidl_vecImEERKNS4_INS0_11hidl_stringEEES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext21typeGetNativeMetadataEmNSt3__18functionIFvRKNS0_8hidl_vecImEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext10typeCreateEmjjjbbNS2_9YuvFormatE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext14contextDestroyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext17contextGetMessageEPvmNSt3__18functionIFvNS2_19MessageToClientTypeEmEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext18contextPeekMessageENSt3__18functionIFvNS2_19MessageToClientTypeEmjEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext18contextSendMessageEjRKNS0_8hidl_vecIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext19contextInitToClientEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext21contextDeinitToClientEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext13contextFinishEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext10contextLogEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext18contextSetCacheDirERKNS0_11hidl_stringE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext18contextSetPriorityENS2_16ThreadPrioritiesE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext10assignNameEmRKNS0_11hidl_stringE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext7getNameEmNSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext13closureCreateEmmRKNS0_8hidl_vecImEERKNS4_IlEERKNS4_IiEES7_S7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext19invokeClosureCreateEmRKNS0_8hidl_vecIhEERKNS4_ImEERKNS4_IlEERKNS4_IiEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext13closureSetArgEmjPvi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext16closureSetGlobalEmmli"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext20scriptKernelIDCreateEmii"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext20scriptInvokeIDCreateEmi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext19scriptFieldIDCreateEmi"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext17scriptGroupCreateERKNS0_8hidl_vecImEES7_S7_S7_S7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext18scriptGroup2CreateERKNS0_11hidl_stringES6_RKNS0_8hidl_vecImEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext20scriptGroupSetOutputEmmm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext19scriptGroupSetInputEmmm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext18scriptGroupExecuteEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext10objDestroyEm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext13samplerCreateENS2_12SamplerValueES4_S4_S4_S4_f"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext20scriptBindAllocationEmmj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext17scriptSetTimeZoneEmRKNS0_11hidl_stringE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext12scriptInvokeEmj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext13scriptInvokeVEmjRKNS0_8hidl_vecIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext13scriptForEachEmjRKNS0_8hidl_vecImEEmRKNS4_IhEEPv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext12scriptReduceEmjRKNS0_8hidl_vecImEEmPv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext13scriptSetVarIEmji"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext15scriptSetVarObjEmjm"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext13scriptSetVarJEmjl"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext13scriptSetVarFEmjf"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext13scriptSetVarDEmjd"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext13scriptSetVarVEmjRKNS0_8hidl_vecIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext13scriptGetVarVEmjmNSt3__18functionIFvRKNS0_8hidl_vecIhEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext14scriptSetVarVEEmjRKNS0_8hidl_vecIhEEmRKNS4_IjEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext13scriptCCreateERKNS0_11hidl_stringES6_RKNS0_8hidl_vecIhEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware12renderscript4V1_08IContext21scriptIntrinsicCreateENS2_17ScriptIntrinsicIDEm"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12renderscript4V1_08IContextE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware12renderscript4V1_08IContextD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware12renderscript4V1_08IContextD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fdIndex",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "extent",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware17GrantorDescriptorE",
   "name" : "android::hardware::GrantorDescriptor",
   "size" : 24,
   "source_file" : "system/libfmq/base/fmq/MQDescriptorBase.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware20hidl_death_recipientE",
   "name" : "android::hardware::hidl_death_recipient",
   "size" : 24,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h",
   "vtable_components" :
   [
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipient11serviceDiedEmRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware7details13return_statusE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 320,
     "referenced_type" : "_ZTIN7android2spINS_8hardware12renderscript4V1_08IContextEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6ReturnINS_2spINS0_12renderscript4V1_08IContextEEEEE",
   "name" : "android::hardware::Return<android::sp<android::hardware::renderscript::V1_0::IContext>>",
   "record_kind" : "class",
   "size" : 48,
   "source_file" : "system/libhidl/base/include/hidl/Status.h",
   "template_args" :
   [
    "_ZTIN7android2spINS_8hardware12renderscript4V1_08IContextEEE"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware7details13return_statusE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 320,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6ReturnImEE",
   "name" : "android::hardware::Return<unsigned long>",
   "record_kind" : "class",
   "size" : 48,
   "source_file" : "system/libhidl/base/include/hidl/Status.h",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android8hardware7details13return_statusE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6ReturnIvEE",
   "name" : "android::hardware::Return<void>",
   "record_kind" : "class",
   "size" : 40,
   "source_file" : "system/libhidl/base/include/hidl/Status.h",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware6StatusE",
   "name" : "android::hardware::Status",
   "record_kind" : "class",
   "size" : 32,
   "source_file" : "system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEE",
   "name" : "android::hardware::details::hidl_pointer<native_handle>",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" :
   [
    "_ZTI13native_handle"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIP13native_handle"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIm"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerI13native_handleEUt_E",
   "name" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous)",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEE",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" :
   [
    "_ZTIK13native_handle"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPK13native_handle"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIm"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIK13native_handleEUt_E",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous)",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIKcEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIKcEE",
   "name" : "android::hardware::details::hidl_pointer<const char>",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" :
   [
    "_ZTIKc"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIm"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIKcEUt_E",
   "name" : "android::hardware::details::hidl_pointer<const char>::(anonymous)",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEE",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::hidl_string>",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" :
   [
    "_ZTIN7android8hardware11hidl_stringE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPN7android8hardware11hidl_stringE"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIm"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEUt_E",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::hidl_string>::(anonymous)",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" :
   [
    "_ZTIN7android8hardware17GrantorDescriptorE"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPN7android8hardware17GrantorDescriptorE"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIm"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>::(anonymous)",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIhEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIhEE",
   "name" : "android::hardware::details::hidl_pointer<unsigned char>",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIm"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIhEUt_E",
   "name" : "android::hardware::details::hidl_pointer<unsigned char>::(anonymous)",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIiEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIiEE",
   "name" : "android::hardware::details::hidl_pointer<int>",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPi"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIm"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIiEUt_E",
   "name" : "android::hardware::details::hidl_pointer<int>::(anonymous)",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIjEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIjEE",
   "name" : "android::hardware::details::hidl_pointer<unsigned int>",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPj"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIm"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIjEUt_E",
   "name" : "android::hardware::details::hidl_pointer<unsigned int>::(anonymous)",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIlEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIlEE",
   "name" : "android::hardware::details::hidl_pointer<long>",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPl"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIm"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerIlEUt_E",
   "name" : "android::hardware::details::hidl_pointer<long>::(anonymous)",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerImEUt_E"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerImEE",
   "name" : "android::hardware::details::hidl_pointer<unsigned long>",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "access" : "private",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "_ZTIPm"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIm"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details12hidl_pointerImEUt_E",
   "name" : "android::hardware::details::hidl_pointer<unsigned long>::(anonymous)",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStatus",
     "referenced_type" : "_ZTIN7android8hardware6StatusE"
    },
    {
     "access" : "private",
     "field_name" : "mCheckedStatus",
     "field_offset" : 256,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details13return_statusE",
   "name" : "android::hardware::details::return_status",
   "record_kind" : "class",
   "size" : 40,
   "source_file" : "system/libhidl/base/include/hidl/Status.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mInstrumentationCallbacks",
     "field_offset" : 64,
     "referenced_type" : "_ZTINSt3__16vectorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS8_S8_S8_PNS0_IPvNS_9allocatorIS9_EEEEEEENSA_ISF_EEEE"
    },
    {
     "access" : "protected",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN7android8hardware7details16HidlInstrumentorUt_E"
    },
    {
     "access" : "protected",
     "field_name" : "mInstrumentationLibPackage",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "access" : "protected",
     "field_name" : "mInterfaceName",
     "field_offset" : 512,
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware7details16HidlInstrumentorE",
   "name" : "android::hardware::details::HidlInstrumentor",
   "size" : 88,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD0Ev"
    }
   ]
  },
  {
   "access" : "protected",
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mEnableInstrumentation",
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "mReserved0",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7android8hardware7details16HidlInstrumentorUt_E",
   "name" : "android::hardware::details::HidlInstrumentor::(anonymous)",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware7details5i_tagE",
   "name" : "android::hardware::details::i_tag",
   "size" : 1,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware7details6bs_tagE",
   "name" : "android::hardware::details::bs_tag",
   "size" : 1,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware7details8bnhw_tagE",
   "name" : "android::hardware::details::bnhw_tag",
   "size" : 1,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android8hardware7details8bphw_tagE",
   "name" : "android::hardware::details::bphw_tag",
   "size" : 1,
   "source_file" : "system/libhidl/base/include/hidl/HidlInternal.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware8hidl_vecINS0_11hidl_stringEEE",
   "name" : "android::hardware::hidl_vec<android::hardware::hidl_string>",
   "size" : 16,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" :
   [
    "_ZTIN7android8hardware11hidl_stringE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE",
   "name" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "size" : 16,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" :
   [
    "_ZTIN7android8hardware17GrantorDescriptorE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIhEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware8hidl_vecIhEE",
   "name" : "android::hardware::hidl_vec<unsigned char>",
   "size" : 16,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIiEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware8hidl_vecIiEE",
   "name" : "android::hardware::hidl_vec<int>",
   "size" : 16,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIjEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware8hidl_vecIjEE",
   "name" : "android::hardware::hidl_vec<unsigned int>",
   "size" : 16,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerIlEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware8hidl_vecIlEE",
   "name" : "android::hardware::hidl_vec<long>",
   "size" : 16,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "_ZTIN7android8hardware7details12hidl_pointerImEE"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mPad",
     "field_offset" : 104,
     "referenced_type" : "_ZTIA3_h"
    }
   ],
   "linker_set_key" : "_ZTIN7android8hardware8hidl_vecImEE",
   "name" : "android::hardware::hidl_vec<unsigned long>",
   "size" : 16,
   "source_file" : "system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7siginfoUt_Ut_E"
    },
    {
     "field_name" : "_si_pad",
     "referenced_type" : "_ZTIA32_i"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_E",
   "name" : "siginfo::(anonymous)",
   "record_kind" : "union",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "si_signo",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_errno",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "si_code",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sifields",
     "field_offset" : 128,
     "referenced_type" : "_ZTI10__sifields"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7siginfoUt_Ut_E",
   "name" : "siginfo::(anonymous)::(anonymous)",
   "size" : 48,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_pad",
     "referenced_type" : "_ZTIA12_i"
    },
    {
     "field_name" : "_tid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "_sigev_thread",
     "referenced_type" : "_ZTIN8sigeventUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_E",
   "name" : "sigevent::(unnamed)",
   "record_kind" : "union",
   "size" : 48,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "_function",
     "referenced_type" : "_ZTIPFv6sigvalE"
    },
    {
     "field_name" : "_attribute",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8sigeventUt_Ut_E",
   "name" : "sigevent::(unnamed)::(unnamed)",
   "size" : 16,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/siginfo.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "uc_sigmask",
     "referenced_type" : "_ZTI8sigset_t"
    },
    {
     "field_name" : "uc_sigmask64",
     "referenced_type" : "_ZTI8sigset_t"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN8ucontextUt_E",
   "name" : "ucontext::(anonymous)",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "bionic/libc/include/sys/ucontext.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sa_handler",
     "referenced_type" : "_ZTIPFviE"
    },
    {
     "field_name" : "sa_sigaction",
     "referenced_type" : "_ZTIPFviP7siginfoPvE"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9sigactionUt_E",
   "name" : "sigaction::(anonymous)",
   "record_kind" : "union",
   "size" : 8,
   "source_file" : "bionic/libc/include/bits/signal_types.h"
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__buf_",
     "referenced_type" : "_ZTINSt3__115aligned_storageILm24ELm16EE4typeE"
    },
    {
     "access" : "private",
     "field_name" : "__f_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPNSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function12__value_funcIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmEEE",
   "name" : "std::__function::__value_func<void (MessageToClientType, unsigned long)>",
   "record_kind" : "class",
   "size" : 48,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmE"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__buf_",
     "referenced_type" : "_ZTINSt3__115aligned_storageILm24ELm16EE4typeE"
    },
    {
     "access" : "private",
     "field_name" : "__f_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPNSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmjEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function12__value_funcIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmjEEE",
   "name" : "std::__function::__value_func<void (MessageToClientType, unsigned long, unsigned int)>",
   "record_kind" : "class",
   "size" : 48,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmjE"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__buf_",
     "referenced_type" : "_ZTINSt3__115aligned_storageILm24ELm16EE4typeE"
    },
    {
     "access" : "private",
     "field_name" : "__f_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPNSt3__110__function6__baseIFvPvmEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function12__value_funcIFvPvmEEE",
   "name" : "std::__function::__value_func<void (void *, unsigned long)>",
   "record_kind" : "class",
   "size" : 48,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvPvmE"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__buf_",
     "referenced_type" : "_ZTINSt3__115aligned_storageILm24ELm16EE4typeE"
    },
    {
     "access" : "private",
     "field_name" : "__f_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPNSt3__110__function6__baseIFvRKN7android8hardware11hidl_stringEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function12__value_funcIFvRKN7android8hardware11hidl_stringEEEE",
   "name" : "std::__function::__value_func<void (const hidl_string &)>",
   "record_kind" : "class",
   "size" : 48,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware11hidl_stringEE"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__buf_",
     "referenced_type" : "_ZTINSt3__115aligned_storageILm24ELm16EE4typeE"
    },
    {
     "access" : "private",
     "field_name" : "__f_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIhEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function12__value_funcIFvRKN7android8hardware8hidl_vecIhEEEEE",
   "name" : "std::__function::__value_func<void (const hidl_vec<unsigned char> &)>",
   "record_kind" : "class",
   "size" : 48,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware8hidl_vecIhEEE"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__buf_",
     "referenced_type" : "_ZTINSt3__115aligned_storageILm24ELm16EE4typeE"
    },
    {
     "access" : "private",
     "field_name" : "__f_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIjEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function12__value_funcIFvRKN7android8hardware8hidl_vecIjEEEEE",
   "name" : "std::__function::__value_func<void (const hidl_vec<unsigned int> &)>",
   "record_kind" : "class",
   "size" : 48,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware8hidl_vecIjEEE"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__buf_",
     "referenced_type" : "_ZTINSt3__115aligned_storageILm24ELm16EE4typeE"
    },
    {
     "access" : "private",
     "field_name" : "__f_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function12__value_funcIFvRKN7android8hardware8hidl_vecImEEEEE",
   "name" : "std::__function::__value_func<void (const hidl_vec<unsigned long> &)>",
   "record_kind" : "class",
   "size" : 48,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware8hidl_vecImEEE"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__buf_",
     "referenced_type" : "_ZTINSt3__115aligned_storageILm24ELm16EE4typeE"
    },
    {
     "access" : "private",
     "field_name" : "__f_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEERKNS4_INS3_11hidl_stringEEES7_EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function12__value_funcIFvRKN7android8hardware8hidl_vecImEERKNS4_INS3_11hidl_stringEEES7_EEE",
   "name" : "std::__function::__value_func<void (const hidl_vec<unsigned long> &, const hidl_vec<hidl_string> &, const hidl_vec<unsigned long> &)>",
   "record_kind" : "class",
   "size" : 48,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware8hidl_vecImEERKNS1_INS0_11hidl_stringEEES4_E"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__small",
     "referenced_type" : "_ZTIA16_c"
    },
    {
     "field_name" : "__large",
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function16__policy_storageE",
   "name" : "std::__function::__policy_storage",
   "record_kind" : "union",
   "size" : 16,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__function34__maybe_derive_from_unary_functionIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmEEE",
   "name" : "std::__function::__maybe_derive_from_unary_function<void (MessageToClientType, unsigned long)>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__function34__maybe_derive_from_unary_functionIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmjEEE",
   "name" : "std::__function::__maybe_derive_from_unary_function<void (MessageToClientType, unsigned long, unsigned int)>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmjE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__function34__maybe_derive_from_unary_functionIFvPvmEEE",
   "name" : "std::__function::__maybe_derive_from_unary_function<void (void *, unsigned long)>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvPvmE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIRKN7android8hardware11hidl_stringEvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function34__maybe_derive_from_unary_functionIFvRKN7android8hardware11hidl_stringEEEE",
   "name" : "std::__function::__maybe_derive_from_unary_function<void (const hidl_string &)>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware11hidl_stringEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIRKN7android8hardware8hidl_vecIhEEvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function34__maybe_derive_from_unary_functionIFvRKN7android8hardware8hidl_vecIhEEEEE",
   "name" : "std::__function::__maybe_derive_from_unary_function<void (const hidl_vec<unsigned char> &)>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware8hidl_vecIhEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIRKN7android8hardware8hidl_vecIjEEvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function34__maybe_derive_from_unary_functionIFvRKN7android8hardware8hidl_vecIjEEEEE",
   "name" : "std::__function::__maybe_derive_from_unary_function<void (const hidl_vec<unsigned int> &)>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware8hidl_vecIjEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__114unary_functionIRKN7android8hardware8hidl_vecImEEvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function34__maybe_derive_from_unary_functionIFvRKN7android8hardware8hidl_vecImEEEEE",
   "name" : "std::__function::__maybe_derive_from_unary_function<void (const hidl_vec<unsigned long> &)>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware8hidl_vecImEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__function34__maybe_derive_from_unary_functionIFvRKN7android8hardware8hidl_vecImEERKNS4_INS3_11hidl_stringEEES7_EEE",
   "name" : "std::__function::__maybe_derive_from_unary_function<void (const hidl_vec<unsigned long> &, const hidl_vec<hidl_string> &, const hidl_vec<unsigned long> &)>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware8hidl_vecImEERKNS1_INS0_11hidl_stringEEES4_E"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115binary_functionIN7android8hardware12renderscript4V1_019MessageToClientTypeEmvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function35__maybe_derive_from_binary_functionIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmEEE",
   "name" : "std::__function::__maybe_derive_from_binary_function<void (MessageToClientType, unsigned long)>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__function35__maybe_derive_from_binary_functionIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmjEEE",
   "name" : "std::__function::__maybe_derive_from_binary_function<void (MessageToClientType, unsigned long, unsigned int)>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmjE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115binary_functionIPvmvEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function35__maybe_derive_from_binary_functionIFvPvmEEE",
   "name" : "std::__function::__maybe_derive_from_binary_function<void (void *, unsigned long)>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvPvmE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__function35__maybe_derive_from_binary_functionIFvRKN7android8hardware11hidl_stringEEEE",
   "name" : "std::__function::__maybe_derive_from_binary_function<void (const hidl_string &)>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware11hidl_stringEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__function35__maybe_derive_from_binary_functionIFvRKN7android8hardware8hidl_vecIhEEEEE",
   "name" : "std::__function::__maybe_derive_from_binary_function<void (const hidl_vec<unsigned char> &)>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware8hidl_vecIhEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__function35__maybe_derive_from_binary_functionIFvRKN7android8hardware8hidl_vecIjEEEEE",
   "name" : "std::__function::__maybe_derive_from_binary_function<void (const hidl_vec<unsigned int> &)>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware8hidl_vecIjEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__function35__maybe_derive_from_binary_functionIFvRKN7android8hardware8hidl_vecImEEEEE",
   "name" : "std::__function::__maybe_derive_from_binary_function<void (const hidl_vec<unsigned long> &)>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware8hidl_vecImEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__function35__maybe_derive_from_binary_functionIFvRKN7android8hardware8hidl_vecImEERKNS4_INS3_11hidl_stringEEES7_EEE",
   "name" : "std::__function::__maybe_derive_from_binary_function<void (const hidl_vec<unsigned long> &, const hidl_vec<hidl_string> &, const hidl_vec<unsigned long> &)>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware8hidl_vecImEERKNS1_INS0_11hidl_stringEEES4_E"
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTINSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmEEE",
   "name" : "std::__function::__base<void (MessageToClientType, unsigned long)>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmEE7__cloneEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmEE7__cloneEPS8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmEE7destroyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmEE18destroy_deallocateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmEEclEOS6_Om"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTINSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmjEEE",
   "name" : "std::__function::__base<void (MessageToClientType, unsigned long, unsigned int)>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmjE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmjEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmjEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmjEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmjEE7__cloneEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmjEE7__cloneEPS8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmjEE7destroyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmjEE18destroy_deallocateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvN7android8hardware12renderscript4V1_019MessageToClientTypeEmjEEclEOS6_OmOj"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTINSt3__110__function6__baseIFvPvmEEE",
   "name" : "std::__function::__base<void (void *, unsigned long)>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvPvmE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110__function6__baseIFvPvmEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvPvmEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvPvmEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__110__function6__baseIFvPvmEE7__cloneEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__110__function6__baseIFvPvmEE7__cloneEPS4_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvPvmEE7destroyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvPvmEE18destroy_deallocateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvPvmEEclEOS2_Om"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTINSt3__110__function6__baseIFvRKN7android8hardware11hidl_stringEEEE",
   "name" : "std::__function::__base<void (const hidl_string &)>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware11hidl_stringEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110__function6__baseIFvRKN7android8hardware11hidl_stringEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware11hidl_stringEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware11hidl_stringEEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__110__function6__baseIFvRKN7android8hardware11hidl_stringEEE7__cloneEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__110__function6__baseIFvRKN7android8hardware11hidl_stringEEE7__cloneEPS8_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware11hidl_stringEEE7destroyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware11hidl_stringEEE18destroy_deallocateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware11hidl_stringEEEclES6_"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTINSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIhEEEEE",
   "name" : "std::__function::__base<void (const hidl_vec<unsigned char> &)>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware8hidl_vecIhEEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIhEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIhEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIhEEEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIhEEEE7__cloneEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIhEEEE7__cloneEPS9_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIhEEEE7destroyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIhEEEE18destroy_deallocateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIhEEEEclES7_"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTINSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIjEEEEE",
   "name" : "std::__function::__base<void (const hidl_vec<unsigned int> &)>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware8hidl_vecIjEEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIjEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIjEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIjEEEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIjEEEE7__cloneEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIjEEEE7__cloneEPS9_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIjEEEE7destroyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIjEEEE18destroy_deallocateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecIjEEEEclES7_"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTINSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEEEEE",
   "name" : "std::__function::__base<void (const hidl_vec<unsigned long> &)>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware8hidl_vecImEEE"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEEEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEEEE7__cloneEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEEEE7__cloneEPS9_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEEEE7destroyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEEEE18destroy_deallocateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEEEEclES7_"
    }
   ]
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTINSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEERKNS4_INS3_11hidl_stringEEES7_EEE",
   "name" : "std::__function::__base<void (const hidl_vec<unsigned long> &, const hidl_vec<hidl_string> &, const hidl_vec<unsigned long> &)>",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIFvRKN7android8hardware8hidl_vecImEERKNS1_INS0_11hidl_stringEEES4_E"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEERKNS4_INS3_11hidl_stringEEES7_EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEERKNS4_INS3_11hidl_stringEEES7_EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEERKNS4_INS3_11hidl_stringEEES7_EED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEERKNS4_INS3_11hidl_stringEEES7_EE7__cloneEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNKSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEERKNS4_INS3_11hidl_stringEEES7_EE7__cloneEPSD_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEERKNS4_INS3_11hidl_stringEEES7_EE7destroyEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEERKNS4_INS3_11hidl_stringEEES7_EE18destroy_deallocateEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNSt3__110__function6__baseIFvRKN7android8hardware8hidl_vecImEERKNS4_INS3_11hidl_stringEEES7_EEclES7_SB_S7_"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clone",
     "referenced_type" : "_ZTIKPFPvPKvE"
    },
    {
     "field_name" : "__destroy",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKPFvPvE"
    },
    {
     "field_name" : "__is_null",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKb"
    },
    {
     "field_name" : "__type_info",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKPKSt9type_info"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__function8__policyE",
   "name" : "std::__function::__policy",
   "size" : 32,
   "source_file" : "external/libcxx/include/functional"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILm0EEE",
   "name" : "std::__get_pair<0>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__get_pairILm1EEE",
   "name" : "std::__get_pair<1>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_22__tree_node_destructorINS_9allocatorINS_11__tree_nodeIN7android2spINS4_8hardware12renderscript4V1_08IContextEEEPvEEEEEEEE",
   "name" : "std::__identity<std::__tree_node_destructor<std::allocator<std::__tree_node<android::sp<android::hardware::renderscript::V1_0::IContext>, void *>>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__tree_node_destructorINS_9allocatorINS_11__tree_nodeIN7android2spINS3_8hardware12renderscript4V1_08IContextEEEPvEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__identityINS_22__tree_node_destructorINS_9allocatorINS_11__tree_nodeINS_12__value_typeIPvP16RsContextWrapperEES5_EEEEEEEE",
   "name" : "std::__identity<std::__tree_node_destructor<std::allocator<std::__tree_node<std::__value_type<void *, RsContextWrapper *>, void *>>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__tree_node_destructorINS_9allocatorINS_11__tree_nodeINS_12__value_typeIPvP16RsContextWrapperEES4_EEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110__ignore_tIhEE",
   "name" : "std::__ignore_t<unsigned char>",
   "size" : 1,
   "source_file" : "external/libcxx/include/tuple",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1000000000EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1000000000>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000000000EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1000000EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1000000>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000000EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1000EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1000>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl1ELl1EEEEE",
   "name" : "std::__is_ratio<std::ratio<1, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl2629746ELl1EEEEE",
   "name" : "std::__is_ratio<std::ratio<2629746, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl2629746ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl31556952ELl1EEEEE",
   "name" : "std::__is_ratio<std::ratio<31556952, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl31556952ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl3600ELl1EEEEE",
   "name" : "std::__is_ratio<std::ratio<3600, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl3600ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl60ELl1EEEEE",
   "name" : "std::__is_ratio<std::ratio<60, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl60ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__is_ratioINS_5ratioILl86400ELl1EEEEE",
   "name" : "std::__is_ratio<std::ratio<86400, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl86400ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb0EJNS_16is_constructibleINS_9allocatorIN7android2spINS3_8hardware12renderscript4V1_08IContextEEEEEJOSA_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_9allocatorIN7android2spINS4_8hardware12renderscript4V1_08IContextEEEEESB_EEEEJNS_16is_constructibleISB_JOSB_EEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<std::allocator<android::sp<android::hardware::renderscript::V1_0::IContext>>, std::allocator<android::sp<android::hardware::renderscript::V1_0::IContext>>>>, is_constructible<allocator<sp<IContext>>, allocator<sp<IContext>> &&>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__110__lazy_notINS_7is_sameINS_9allocatorIN7android2spINS3_8hardware12renderscript4V1_08IContextEEEEESA_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb0EJNS_16is_constructibleINS_9allocatorIN7android2spINS3_8hardware12renderscript4V1_08IContextEEEEEJRKSA_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_9allocatorIN7android2spINS4_8hardware12renderscript4V1_08IContextEEEEESB_EEEEJNS_16is_constructibleISB_JRKSB_EEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<std::allocator<android::sp<android::hardware::renderscript::V1_0::IContext>>, std::allocator<android::sp<android::hardware::renderscript::V1_0::IContext>>>>, is_constructible<allocator<sp<IContext>>, const allocator<sp<IContext>> &>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__110__lazy_notINS_7is_sameINS_9allocatorIN7android2spINS3_8hardware12renderscript4V1_08IContextEEEEESA_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb0EJNS_16is_constructibleINS_9allocatorIN7android2spINS3_8hardware12renderscript4V1_08IContextEEEEEJRKSA_EEENS_13is_assignableIRSA_SC_EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_9allocatorIN7android2spINS4_8hardware12renderscript4V1_08IContextEEEEESB_EEEEJNS_16is_constructibleISB_JRKSB_EEENS_13is_assignableIRSB_SG_EEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<std::allocator<android::sp<android::hardware::renderscript::V1_0::IContext>>, std::allocator<android::sp<android::hardware::renderscript::V1_0::IContext>>>>, is_constructible<allocator<sp<IContext>>, const allocator<sp<IContext>> &>, is_assignable<allocator<sp<IContext>> &, const allocator<sp<IContext>> &>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__110__lazy_notINS_7is_sameINS_9allocatorIN7android2spINS3_8hardware12renderscript4V1_08IContextEEEEESA_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb0EJNS_16is_constructibleINS_9allocatorINS_4pairIKPvP16RsContextWrapperEEEEJOS9_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_9allocatorINS_4pairIKPvP16RsContextWrapperEEEESA_EEEEJNS_16is_constructibleISA_JOSA_EEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<std::allocator<std::pair<void *const, RsContextWrapper *>>, std::allocator<std::pair<void *const, RsContextWrapper *>>>>, is_constructible<allocator<pair<void *const, RsContextWrapper *>>, allocator<pair<void *const, RsContextWrapper *>> &&>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__110__lazy_notINS_7is_sameINS_9allocatorINS_4pairIKPvP16RsContextWrapperEEEES9_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb0EJNS_16is_constructibleINS_9allocatorINS_4pairIKPvP16RsContextWrapperEEEEJRKS9_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_9allocatorINS_4pairIKPvP16RsContextWrapperEEEESA_EEEEJNS_16is_constructibleISA_JRKSA_EEEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<std::allocator<std::pair<void *const, RsContextWrapper *>>, std::allocator<std::pair<void *const, RsContextWrapper *>>>>, is_constructible<allocator<pair<void *const, RsContextWrapper *>>, const allocator<pair<void *const, RsContextWrapper *>> &>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__110__lazy_notINS_7is_sameINS_9allocatorINS_4pairIKPvP16RsContextWrapperEEEES9_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb0EJNS_16is_constructibleINS_9allocatorINS_4pairIKPvP16RsContextWrapperEEEEJRKS9_EEENS_13is_assignableIRS9_SB_EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_10__lazy_notINS_7is_sameINS_9allocatorINS_4pairIKPvP16RsContextWrapperEEEESA_EEEEJNS_16is_constructibleISA_JRKSA_EEENS_13is_assignableIRSA_SF_EEEEE",
   "name" : "std::__lazy_and<std::__lazy_not<std::is_same<std::allocator<std::pair<void *const, RsContextWrapper *>>, std::allocator<std::pair<void *const, RsContextWrapper *>>>>, is_constructible<allocator<pair<void *const, RsContextWrapper *>>, const allocator<pair<void *const, RsContextWrapper *>> &>, is_assignable<allocator<pair<void *const, RsContextWrapper *>> &, const allocator<pair<void *const, RsContextWrapper *>> &>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__110__lazy_notINS_7is_sameINS_9allocatorINS_4pairIKPvP16RsContextWrapperEEEES9_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb0EJNS_16is_constructibleINS_9allocatorIN7android2spINS3_8hardware12renderscript4V1_08IContextEEEEEJRKNS_8optionalISA_EEEEENS_13is_assignableIRSA_SE_EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_17integral_constantIbLb0EEEJNS_16is_constructibleINS_9allocatorIN7android2spINS5_8hardware12renderscript4V1_08IContextEEEEEJRKNS_8optionalISC_EEEEENS_13is_assignableIRSC_SG_EEEEE",
   "name" : "std::__lazy_and<std::integral_constant<bool, false>, is_constructible<allocator<sp<IContext>>, const optional<allocator<sp<IContext>>> &>, is_assignable<allocator<sp<IContext>> &, const optional<allocator<sp<IContext>>> &>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__117integral_constantIbLb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__115__lazy_and_implILb0EJNS_16is_constructibleINS_9allocatorINS_4pairIKPvP16RsContextWrapperEEEEJRKNS_8optionalIS9_EEEEENS_13is_assignableIRS9_SD_EEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_andINS_17integral_constantIbLb0EEEJNS_16is_constructibleINS_9allocatorINS_4pairIKPvP16RsContextWrapperEEEEJRKNS_8optionalISB_EEEEENS_13is_assignableIRSB_SF_EEEEE",
   "name" : "std::__lazy_and<std::integral_constant<bool, false>, is_constructible<allocator<pair<void *const, RsContextWrapper *>>, const optional<allocator<pair<void *const, RsContextWrapper *>>> &>, is_assignable<allocator<pair<void *const, RsContextWrapper *>> &, const optional<allocator<pair<void *const, RsContextWrapper *>>> &>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__117integral_constantIbLb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_notINS_7is_sameINS_9allocatorIN7android2spINS3_8hardware12renderscript4V1_08IContextEEEEESA_EEEE",
   "name" : "std::__lazy_not<std::is_same<std::allocator<android::sp<android::hardware::renderscript::V1_0::IContext>>, std::allocator<android::sp<android::hardware::renderscript::V1_0::IContext>>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__17is_sameINS_9allocatorIN7android2spINS2_8hardware12renderscript4V1_08IContextEEEEES9_EE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__lazy_notINS_7is_sameINS_9allocatorINS_4pairIKPvP16RsContextWrapperEEEES9_EEEE",
   "name" : "std::__lazy_not<std::is_same<std::allocator<std::pair<void *const, RsContextWrapper *>>, std::allocator<std::pair<void *const, RsContextWrapper *>>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__17is_sameINS_9allocatorINS_4pairIKPvP16RsContextWrapperEEEES8_EE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "__loc_",
     "referenced_type" : "_ZTIP10__locale_t"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__time_getE",
   "name" : "std::__time_get",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/libcxx/include/locale"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__loc_",
     "referenced_type" : "_ZTIP10__locale_t"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110__time_putE",
   "name" : "std::__time_put",
   "record_kind" : "class",
   "size" : 8,
   "source_file" : "external/libcxx/include/locale"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110ctype_baseE",
   "name" : "std::ctype_base",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "external/libcxx/include/__locale"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__val_",
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "__cat_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKNSt3__114error_categoryE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110error_codeE",
   "name" : "std::error_code",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "external/libcxx/include/system_error"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110in_place_tE",
   "name" : "std::in_place_t",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_base_ofINS_8ios_baseERNS_13basic_ostreamIcNS_11char_traitsIcEEEEEE",
   "name" : "std::is_base_of<std::ios_base, std::basic_ostream<char, std::char_traits<char>> &>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18ios_baseE",
    "_ZTIRNSt3__113basic_ostreamIcNS_11char_traitsIcEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_base_ofINS_8ios_baseERNS_19basic_ostringstreamIcNS_11char_traitsIcEENS_9allocatorIcEEEEEE",
   "name" : "std::is_base_of<std::ios_base, std::basic_ostringstream<char, std::char_traits<char>, std::allocator<char>> &>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__18ios_baseE",
    "_ZTIRNSt3__119basic_ostringstreamIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_22__tree_node_destructorINS_9allocatorINS_11__tree_nodeIN7android2spINS4_8hardware12renderscript4V1_08IContextEEEPvEEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_22__tree_node_destructorINS_9allocatorINS_11__tree_nodeIN7android2spINS4_8hardware12renderscript4V1_08IContextEEEPvEEEEEEEE",
   "name" : "std::is_pointer<std::__tree_node_destructor<std::allocator<std::__tree_node<android::sp<android::hardware::renderscript::V1_0::IContext>, void *>>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__tree_node_destructorINS_9allocatorINS_11__tree_nodeIN7android2spINS3_8hardware12renderscript4V1_08IContextEEEPvEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_22__tree_node_destructorINS_9allocatorINS_11__tree_nodeINS_12__value_typeIPvP16RsContextWrapperEES5_EEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_22__tree_node_destructorINS_9allocatorINS_11__tree_nodeINS_12__value_typeIPvP16RsContextWrapperEES5_EEEEEEEE",
   "name" : "std::is_pointer<std::__tree_node_destructor<std::allocator<std::__tree_node<std::__value_type<void *, RsContextWrapper *>, void *>>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__122__tree_node_destructorINS_9allocatorINS_11__tree_nodeINS_12__value_typeIPvP16RsContextWrapperEES4_EEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_9allocatorIN7android2spINS2_8hardware12renderscript4V1_08IContextEEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_9allocatorIN7android2spINS2_8hardware12renderscript4V1_08IContextEEEEEEE",
   "name" : "std::is_pointer<std::allocator<android::sp<android::hardware::renderscript::V1_0::IContext>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIN7android2spINS1_8hardware12renderscript4V1_08IContextEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerINS_9allocatorINS_4pairIKPvP16RsContextWrapperEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerINS_9allocatorINS_4pairIKPvP16RsContextWrapperEEEEEE",
   "name" : "std::is_pointer<std::allocator<std::pair<void *const, RsContextWrapper *>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__19allocatorINS_4pairIKPvP16RsContextWrapperEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerIPNS_11__tree_nodeIN7android2spINS2_8hardware12renderscript4V1_08IContextEEEPvEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerIPNS_11__tree_nodeIN7android2spINS2_8hardware12renderscript4V1_08IContextEEEPvEEEE",
   "name" : "std::is_pointer<std::__tree_node<android::sp<android::hardware::renderscript::V1_0::IContext>, void *> *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__111__tree_nodeIN7android2spINS1_8hardware12renderscript4V1_08IContextEEEPvEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerIPNS_11__tree_nodeINS_12__value_typeIPvP16RsContextWrapperEES3_EEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerIPNS_11__tree_nodeINS_12__value_typeIPvP16RsContextWrapperEES3_EEEE",
   "name" : "std::is_pointer<std::__tree_node<std::__value_type<void *, RsContextWrapper *>, void *> *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__111__tree_nodeINS_12__value_typeIPvP16RsContextWrapperEES2_EE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__119__libcpp_is_pointerIPNS_15__tree_end_nodeIPNS_16__tree_node_baseIPvEEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_pointerIPNS_15__tree_end_nodeIPNS_16__tree_node_baseIPvEEEEEE",
   "name" : "std::is_pointer<std::__tree_end_node<std::__tree_node_base<void *> *> *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPNSt3__115__tree_end_nodeIPNS_16__tree_node_baseIPvEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDiEE",
   "name" : "std::is_trivial<char32_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIDi"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDsEE",
   "name" : "std::is_trivial<char16_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIDs"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIDuEE",
   "name" : "std::is_trivial<char8_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIDu"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIcEE",
   "name" : "std::is_trivial<char>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110is_trivialIwEE",
   "name" : "std::is_trivial<wchar_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIw"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110less_equalIvEE",
   "name" : "std::less_equal<void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110logical_orIvEE",
   "name" : "std::logical_or<void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "field",
     "referenced_type" : "_ZTIA4_c"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110money_base7patternE",
   "name" : "std::money_base::pattern",
   "size" : 4,
   "source_file" : "external/libcxx/include/locale"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110money_baseE",
   "name" : "std::money_base",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "external/libcxx/include/locale"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__16locale5facetE"
    },
    {
     "referenced_type" : "_ZTINSt3__110money_baseE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110moneypunctIcLb0EEE",
   "name" : "std::moneypunct<char, false>",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "external/libcxx/include/locale",
   "template_args" :
   [
    "_ZTIc"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110moneypunctIcLb0EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIcLb0EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIcLb0EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNSt3__16locale5facet16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE16do_decimal_pointEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE16do_thousands_sepEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE11do_groupingEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE14do_curr_symbolEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE16do_positive_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE16do_negative_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE14do_frac_digitsEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE13do_pos_formatEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb0EE13do_neg_formatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__16locale5facetE"
    },
    {
     "referenced_type" : "_ZTINSt3__110money_baseE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110moneypunctIcLb1EEE",
   "name" : "std::moneypunct<char, true>",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "external/libcxx/include/locale",
   "template_args" :
   [
    "_ZTIc"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110moneypunctIcLb1EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIcLb1EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIcLb1EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNSt3__16locale5facet16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE16do_decimal_pointEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE16do_thousands_sepEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE11do_groupingEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE14do_curr_symbolEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE16do_positive_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE16do_negative_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE14do_frac_digitsEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE13do_pos_formatEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIcLb1EE13do_neg_formatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__16locale5facetE"
    },
    {
     "referenced_type" : "_ZTINSt3__110money_baseE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110moneypunctIwLb0EEE",
   "name" : "std::moneypunct<wchar_t, false>",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "external/libcxx/include/locale",
   "template_args" :
   [
    "_ZTIw"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110moneypunctIwLb0EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIwLb0EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIwLb0EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNSt3__16locale5facet16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE16do_decimal_pointEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE16do_thousands_sepEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE11do_groupingEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE14do_curr_symbolEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE16do_positive_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE16do_negative_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE14do_frac_digitsEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE13do_pos_formatEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb0EE13do_neg_formatEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__16locale5facetE"
    },
    {
     "referenced_type" : "_ZTINSt3__110money_baseE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110moneypunctIwLb1EEE",
   "name" : "std::moneypunct<wchar_t, true>",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "external/libcxx/include/locale",
   "template_args" :
   [
    "_ZTIw"
   ],
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTINSt3__110moneypunctIwLb1EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIwLb1EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZNSt3__110moneypunctIwLb1EED0Ev"
    },
    {
     "mangled_component_name" : "_ZNSt3__16locale5facet16__on_zero_sharedEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE16do_decimal_pointEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE16do_thousands_sepEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE11do_groupingEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE14do_curr_symbolEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE16do_positive_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE16do_negative_signEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE14do_frac_digitsEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE13do_pos_formatEv"
    },
    {
     "mangled_component_name" : "_ZNKSt3__110moneypunctIwLb1EE13do_neg_formatEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110multipliesIvEE",
   "name" : "std::multiplies<void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/functional",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__110owner_lessIvEE",
   "name" : "std::owner_less<void>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairIKPvP16RsContextWrapperEEEE",
   "name" : "std::tuple_size<std::pair<void *const, RsContextWrapper *>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" :
   [
    "_ZTINSt3__14pairIKPvP16RsContextWrapperEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairINS_14__map_iteratorINS_15__tree_iteratorINS_12__value_typeIPvP16RsContextWrapperEEPNS_11__tree_nodeIS8_S5_EElEEEEbEEEE",
   "name" : "std::tuple_size<std::pair<std::__map_iterator<std::__tree_iterator<std::__value_type<void *, RsContextWrapper *>, std::__tree_node<std::__value_type<void *, RsContextWrapper *>, void *> *, long>>, bool>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" :
   [
    "_ZTINSt3__14pairINS_14__map_iteratorINS_15__tree_iteratorINS_12__value_typeIPvP16RsContextWrapperEEPNS_11__tree_nodeIS7_S4_EElEEEEbEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairINS_15__tree_iteratorIN7android2spINS3_8hardware12renderscript4V1_08IContextEEEPNS_11__tree_nodeIS9_PvEElEEbEEEE",
   "name" : "std::tuple_size<std::pair<std::__tree_iterator<android::sp<android::hardware::renderscript::V1_0::IContext>, std::__tree_node<android::sp<android::hardware::renderscript::V1_0::IContext>, void *> *, long>, bool>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" :
   [
    "_ZTINSt3__14pairINS_15__tree_iteratorIN7android2spINS2_8hardware12renderscript4V1_08IContextEEEPNS_11__tree_nodeIS8_PvEElEEbEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairINS_15__tree_iteratorINS_12__value_typeIPvP16RsContextWrapperEEPNS_11__tree_nodeIS7_S4_EElEEbEEEE",
   "name" : "std::tuple_size<std::pair<std::__tree_iterator<std::__value_type<void *, RsContextWrapper *>, std::__tree_node<std::__value_type<void *, RsContextWrapper *>, void *> *, long>, bool>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" :
   [
    "_ZTINSt3__14pairINS_15__tree_iteratorINS_12__value_typeIPvP16RsContextWrapperEEPNS_11__tree_nodeIS6_S3_EElEEbEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairINS_21__tree_const_iteratorIN7android2spINS3_8hardware12renderscript4V1_08IContextEEEPNS_11__tree_nodeIS9_PvEElEEbEEEE",
   "name" : "std::tuple_size<std::pair<std::__tree_const_iterator<android::sp<android::hardware::renderscript::V1_0::IContext>, std::__tree_node<android::sp<android::hardware::renderscript::V1_0::IContext>, void *> *, long>, bool>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" :
   [
    "_ZTINSt3__14pairINS_21__tree_const_iteratorIN7android2spINS2_8hardware12renderscript4V1_08IContextEEEPNS_11__tree_nodeIS8_PvEElEEbEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairIPvP16RsContextWrapperEEEE",
   "name" : "std::tuple_size<std::pair<void *, RsContextWrapper *>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" :
   [
    "_ZTINSt3__14pairIPvP16RsContextWrapperEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantImLm2EEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110tuple_sizeINS_4pairImmEEEE",
   "name" : "std::tuple_size<std::pair<unsigned long, unsigned long>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/utility",
   "template_args" :
   [
    "_ZTINSt3__14pairImmEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPNS_11__tree_nodeIN7android2spINS2_8hardware12renderscript4V1_08IContextEEEPvEENS_22__tree_node_destructorINS_9allocatorISA_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrINS_11__tree_nodeIN7android2spINS2_8hardware12renderscript4V1_08IContextEEEPvEENS_22__tree_node_destructorINS_9allocatorISA_EEEEEE",
   "name" : "std::unique_ptr<std::__tree_node<android::sp<android::hardware::renderscript::V1_0::IContext>, void *>, std::__tree_node_destructor<std::allocator<std::__tree_node<android::sp<android::hardware::renderscript::V1_0::IContext>, void *>>>>",
   "record_kind" : "class",
   "size" : 24,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__111__tree_nodeIN7android2spINS1_8hardware12renderscript4V1_08IContextEEEPvEE",
    "_ZTINSt3__122__tree_node_destructorINS_9allocatorINS_11__tree_nodeIN7android2spINS3_8hardware12renderscript4V1_08IContextEEEPvEEEEEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPNS_11__tree_nodeINS_12__value_typeIPvP16RsContextWrapperEES3_EENS_22__tree_node_destructorINS_9allocatorIS7_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrINS_11__tree_nodeINS_12__value_typeIPvP16RsContextWrapperEES3_EENS_22__tree_node_destructorINS_9allocatorIS7_EEEEEE",
   "name" : "std::unique_ptr<std::__tree_node<std::__value_type<void *, RsContextWrapper *>, void *>, std::__tree_node_destructor<std::allocator<std::__tree_node<std::__value_type<void *, RsContextWrapper *>, void *>>>>",
   "record_kind" : "class",
   "size" : 24,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__111__tree_nodeINS_12__value_typeIPvP16RsContextWrapperEES2_EE",
    "_ZTINSt3__122__tree_node_destructorINS_9allocatorINS_11__tree_nodeINS_12__value_typeIPvP16RsContextWrapperEES4_EEEEEE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPcPFvPvEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrIcPFvPvEEE",
   "name" : "std::unique_ptr<char, void (*)(void *)>",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIc",
    "_ZTIPFvPvE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPhPFvPvEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrIhPFvPvEEE",
   "name" : "std::unique_ptr<unsigned char, void (*)(void *)>",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIh",
    "_ZTIPFvPvE"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "__ptr_",
     "referenced_type" : "_ZTINSt3__117__compressed_pairIPjPFvPvEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__110unique_ptrIjPFvPvEEE",
   "name" : "std::unique_ptr<unsigned int, void (*)(void *)>",
   "record_kind" : "class",
   "size" : 16,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTIj",
    "_ZTIPFvPvE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIKPvLb1EEE",
   "name" : "std::__add_const<void *const>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKPv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constINS_14__map_iteratorINS_15__tree_iteratorINS_12__value_typeIPvP16RsContextWrapperEEPNS_11__tree_nodeIS7_S4_EElEEEELb0EEE",
   "name" : "std::__add_const<std::__map_iterator<std::__tree_iterator<std::__value_type<void *, RsContextWrapper *>, std::__tree_node<std::__value_type<void *, RsContextWrapper *>, void *> *, long>>, false>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__114__map_iteratorINS_15__tree_iteratorINS_12__value_typeIPvP16RsContextWrapperEEPNS_11__tree_nodeIS6_S3_EElEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constINS_15__tree_iteratorIN7android2spINS2_8hardware12renderscript4V1_08IContextEEEPNS_11__tree_nodeIS8_PvEElEELb0EEE",
   "name" : "std::__add_const<std::__tree_iterator<android::sp<android::hardware::renderscript::V1_0::IContext>, std::__tree_node<android::sp<android::hardware::renderscript::V1_0::IContext>, void *> *, long>, false>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__115__tree_iteratorIN7android2spINS1_8hardware12renderscript4V1_08IContextEEEPNS_11__tree_nodeIS7_PvEElEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constINS_15__tree_iteratorINS_12__value_typeIPvP16RsContextWrapperEEPNS_11__tree_nodeIS6_S3_EElEELb0EEE",
   "name" : "std::__add_const<std::__tree_iterator<std::__value_type<void *, RsContextWrapper *>, std::__tree_node<std::__value_type<void *, RsContextWrapper *>, void *> *, long>, false>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__115__tree_iteratorINS_12__value_typeIPvP16RsContextWrapperEEPNS_11__tree_nodeIS5_S2_EElEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constINS_19__map_value_compareIPvNS_12__value_typeIS2_P16RsContextWrapperEENS_4lessIS2_EELb1EEELb0EEE",
   "name" : "std::__add_const<std::__map_value_compare<void *, std::__value_type<void *, RsContextWrapper *>, std::less<void *>, true>, false>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__119__map_value_compareIPvNS_12__value_typeIS1_P16RsContextWrapperEENS_4lessIS1_EELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constINS_21__tree_const_iteratorIN7android2spINS2_8hardware12renderscript4V1_08IContextEEEPNS_11__tree_nodeIS8_PvEElEELb0EEE",
   "name" : "std::__add_const<std::__tree_const_iterator<android::sp<android::hardware::renderscript::V1_0::IContext>, std::__tree_node<android::sp<android::hardware::renderscript::V1_0::IContext>, void *> *, long>, false>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__121__tree_const_iteratorIN7android2spINS1_8hardware12renderscript4V1_08IContextEEEPNS_11__tree_nodeIS7_PvEElEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constINS_4lessIN7android2spINS2_8hardware12renderscript4V1_08IContextEEEEELb0EEE",
   "name" : "std::__add_const<std::less<android::sp<android::hardware::renderscript::V1_0::IContext>>, false>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14lessIN7android2spINS1_8hardware12renderscript4V1_08IContextEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constINS_4lessIPvEELb0EEE",
   "name" : "std::__add_const<std::less<void *>, false>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__14lessIPvEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constINS_9allocatorIN7android2spINS2_8hardware12renderscript4V1_08IContextEEEEELb0EEE",
   "name" : "std::__add_const<std::allocator<android::sp<android::hardware::renderscript::V1_0::IContext>>, false>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIN7android2spINS1_8hardware12renderscript4V1_08IContextEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constINS_9allocatorINS_4pairIKPvP16RsContextWrapperEEEELb0EEE",
   "name" : "std::__add_const<std::allocator<std::pair<void *const, RsContextWrapper *>>, false>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTINSt3__19allocatorINS_4pairIKPvP16RsContextWrapperEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIP16RsContextWrapperLb0EEE",
   "name" : "std::__add_const<RsContextWrapper *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIP16RsContextWrapper"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIPvLb0EEE",
   "name" : "std::__add_const<void *>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIPv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constIbLb0EEE",
   "name" : "std::__add_const<bool>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__add_constImLb0EEE",
   "name" : "std::__add_const<unsigned long>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__money_getIcEE",
   "name" : "std::__money_get<char>",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "external/libcxx/include/locale",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__money_getIwEE",
   "name" : "std::__money_get<wchar_t>",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "external/libcxx/include/locale",
   "template_args" :
   [
    "_ZTIw"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__money_putIcEE",
   "name" : "std::__money_put<char>",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "external/libcxx/include/locale",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__money_putIwEE",
   "name" : "std::__money_put<wchar_t>",
   "record_kind" : "class",
   "size" : 1,
   "source_file" : "external/libcxx/include/locale",
   "template_args" :
   [
    "_ZTIw"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000000000EEENS1_ILl1ELl1EEEEE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000000000>, std::ratio<1, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000000000EEE",
    "_ZTINSt3__15ratioILl1ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000000000EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000000000>, std::ratio<1, 1000000000>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000000000EEE",
    "_ZTINSt3__15ratioILl1ELl1000000000EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000000EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000000>, std::ratio<1, 1000000>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000000EEE",
    "_ZTINSt3__15ratioILl1ELl1000000EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1000EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1000>, std::ratio<1, 1000>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1000EEE",
    "_ZTINSt3__15ratioILl1ELl1000EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl1ELl1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<1, 1>, std::ratio<1, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl1ELl1EEE",
    "_ZTINSt3__15ratioILl1ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl2629746ELl1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<2629746, 1>, std::ratio<2629746, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl2629746ELl1EEE",
    "_ZTINSt3__15ratioILl2629746ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl31556952ELl1EEENS1_ILl2629746ELl1EEEEE",
   "name" : "std::__ratio_gcd<std::ratio<31556952, 1>, std::ratio<2629746, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl31556952ELl1EEE",
    "_ZTINSt3__15ratioILl2629746ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl31556952ELl1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<31556952, 1>, std::ratio<31556952, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl31556952ELl1EEE",
    "_ZTINSt3__15ratioILl31556952ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl3600ELl1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<3600, 1>, std::ratio<3600, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl3600ELl1EEE",
    "_ZTINSt3__15ratioILl3600ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl60ELl1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<60, 1>, std::ratio<60, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl60ELl1EEE",
    "_ZTINSt3__15ratioILl60ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__ratio_gcdINS_5ratioILl86400ELl1EEES2_EE",
   "name" : "std::__ratio_gcd<std::ratio<86400, 1>, std::ratio<86400, 1>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/ratio",
   "template_args" :
   [
    "_ZTINSt3__15ratioILl86400ELl1EEE",
    "_ZTINSt3__15ratioILl86400ELl1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDiEElLb1EEE",
   "name" : "std::__size_type<std::allocator<char32_t>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIDiEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDsEElLb1EEE",
   "name" : "std::__size_type<std::allocator<char16_t>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIDsEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIDuEElLb1EEE",
   "name" : "std::__size_type<std::allocator<char8_t>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIDuEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIN7android2spINS2_8hardware12renderscript4V1_08IContextEEEEElLb1EEE",
   "name" : "std::__size_type<std::allocator<android::sp<android::hardware::renderscript::V1_0::IContext>>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIN7android2spINS1_8hardware12renderscript4V1_08IContextEEEEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIN7android8hardware11hidl_stringEEElLb1EEE",
   "name" : "std::__size_type<std::allocator<android::hardware::hidl_string>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIN7android8hardware11hidl_stringEEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIN7android8hardware17GrantorDescriptorEEElLb1EEE",
   "name" : "std::__size_type<std::allocator<android::hardware::GrantorDescriptor>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIN7android8hardware17GrantorDescriptorEEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorINS_11__tree_nodeIN7android2spINS3_8hardware12renderscript4V1_08IContextEEEPvEEEElLb1EEE",
   "name" : "std::__size_type<std::allocator<std::__tree_node<android::sp<android::hardware::renderscript::V1_0::IContext>, void *>>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorINS_11__tree_nodeIN7android2spINS2_8hardware12renderscript4V1_08IContextEEEPvEEEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorINS_11__tree_nodeINS_12__value_typeIPvP16RsContextWrapperEES4_EEEElLb1EEE",
   "name" : "std::__size_type<std::allocator<std::__tree_node<std::__value_type<void *, RsContextWrapper *>, void *>>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorINS_11__tree_nodeINS_12__value_typeIPvP16RsContextWrapperEES3_EEEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorINS_12__value_typeIPvP16RsContextWrapperEEEElLb1EEE",
   "name" : "std::__size_type<std::allocator<std::__value_type<void *, RsContextWrapper *>>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorINS_12__value_typeIPvP16RsContextWrapperEEEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorINS_16__tree_node_baseIPvEEEElLb1EEE",
   "name" : "std::__size_type<std::allocator<std::__tree_node_base<void *>>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorINS_16__tree_node_baseIPvEEEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorINS_4pairIKPvP16RsContextWrapperEEEElLb1EEE",
   "name" : "std::__size_type<std::allocator<std::pair<void *const, RsContextWrapper *>>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorINS_4pairIKPvP16RsContextWrapperEEEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS9_S9_S9_PNS_6vectorIPvNS1_ISB_EEEEEEEEElLb1EEE",
   "name" : "std::__size_type<std::allocator<std::function<void (InstrumentationEvent, const char *, const char *, const char *, const char *, vector<void *, allocator<void *>> *)>>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorINS_8functionIFvN7android8hardware7details16HidlInstrumentor20InstrumentationEventEPKcS8_S8_S8_PNS_6vectorIPvNS0_ISA_EEEEEEEEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIcEElLb1EEE",
   "name" : "std::__size_type<std::allocator<char>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIcEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIiEElLb1EEE",
   "name" : "std::__size_type<std::allocator<int>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIiEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIlEElLb1EEE",
   "name" : "std::__size_type<std::allocator<long>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIlEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorImEElLb1EEE",
   "name" : "std::__size_type<std::allocator<unsigned long>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorImEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__size_typeINS_9allocatorIwEElLb1EEE",
   "name" : "std::__size_type<std::allocator<wchar_t>, long, true>",
   "size" : 1,
   "source_file" : "external/libcxx/include/memory",
   "template_args" :
   [
    "_ZTINSt3__19allocatorIwEE",
    "_ZTIl"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__116__tree_node_baseIPvEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "__value_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIN7android2spINS_8hardware12renderscript4V1_08IContextEEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111__tree_nodeIN7android2spINS1_8hardware12renderscript4V1_08IContextEEEPvEE",
   "name" : "std::__tree_node<android::sp<android::hardware::renderscript::V1_0::IContext>, void *>",
   "record_kind" : "class",
   "size" : 40,
   "source_file" : "external/libcxx/include/__tree",
   "template_args" :
   [
    "_ZTIN7android2spINS_8hardware12renderscript4V1_08IContextEEE",
    "_ZTIPv"
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__116__tree_node_baseIPvEE"
    }
   ],
   "fields" :
   [
    {
     "field_name" : "__value_",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__112__value_typeIPvP16RsContextWrapperEE"
    }
   ],
   "linker_set_key" : "_ZTINSt3__111__tree_nodeINS_12__value_typeIPvP16RsContextWrapperEES2_EE",
   "name" : "std::__tree_node<std::__value_type<void *, RsContextWrapper *>, void *>",
   "record_kind" : "class",
   "size" : 48,
   "source_file" : "external/libcxx/include/__tree",
   "template_args" :
   [
    "_ZTINSt3__112__value_typeIPvP16RsContextWrapperEE",
    "_ZTIPv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIaNS0_IsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEEEE",
   "name" : "std::__type_list<signed char, std::__type_list<short, std::__type_list<int, std::__type_list<long, std::__type_list<long long, std::__type_list<__int128, std::__nat>>>>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIa",
    "_ZTINSt3__111__type_listIsNS0_IiNS0_IlNS0_IxNS0_InNS_5__natEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111__type_listIhNS0_ItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEEEE",
   "name" : "std::__type_list<unsigned char, std::__type_list<unsigned short, std::__type_list<unsigned int, std::__type_list<unsigned long, std::__type_list<unsigned long long, std::__type_list<unsigned __int128, std::__nat>>>>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIh",
    "_ZTINSt3__111__type_listItNS0_IjNS0_ImNS0_IyNS0_IoNS_5__natEEEEEEEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIDnEE",
   "name" : "std::add_pointer<std::nullptr_t>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIDn"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKN7android2spINS1_8hardware12renderscript4V1_08IContextEEEEE",
   "name" : "std::add_pointer<const android::sp<android::hardware::renderscript::V1_0::IContext>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKN7android2spINS_8hardware12renderscript4V1_08IContextEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKN7android8hardware11hidl_stringEEE",
   "name" : "std::add_pointer<const android::hardware::hidl_string>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKN7android8hardware11hidl_stringE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKN7android8hardware8hidl_vecIhEEEE",
   "name" : "std::add_pointer<const android::hardware::hidl_vec<unsigned char>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKN7android8hardware8hidl_vecIhEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKN7android8hardware8hidl_vecIjEEEE",
   "name" : "std::add_pointer<const android::hardware::hidl_vec<unsigned int>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKN7android8hardware8hidl_vecIjEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKN7android8hardware8hidl_vecImEEEE",
   "name" : "std::add_pointer<const android::hardware::hidl_vec<unsigned long>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKN7android8hardware8hidl_vecImEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPN7android8hardware11hidl_stringENS_9allocatorIS4_EEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<android::hardware::hidl_string *, std::allocator<android::hardware::hidl_string>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPN7android8hardware11hidl_stringENS_9allocatorIS3_EEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPNS_11__tree_nodeIN7android2spINS3_8hardware12renderscript4V1_08IContextEEEPvEENS_22__tree_node_destructorINS_9allocatorISB_EEEEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<std::__tree_node<android::sp<android::hardware::renderscript::V1_0::IContext>, void *> *, std::__tree_node_destructor<std::allocator<std::__tree_node<android::sp<android::hardware::renderscript::V1_0::IContext>, void *>>>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPNS_11__tree_nodeIN7android2spINS2_8hardware12renderscript4V1_08IContextEEEPvEENS_22__tree_node_destructorINS_9allocatorISA_EEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPNS_11__tree_nodeINS_12__value_typeIPvP16RsContextWrapperEES4_EENS_22__tree_node_destructorINS_9allocatorIS8_EEEEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<std::__tree_node<std::__value_type<void *, RsContextWrapper *>, void *> *, std::__tree_node_destructor<std::allocator<std::__tree_node<std::__value_type<void *, RsContextWrapper *>, void *>>>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPNS_11__tree_nodeINS_12__value_typeIPvP16RsContextWrapperEES3_EENS_22__tree_node_destructorINS_9allocatorIS7_EEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPcPFvPvEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<char *, void (*)(void *)>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPcPFvPvEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPhPFvPvEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<unsigned char *, void (*)(void *)>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPhPFvPvEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPiNS_9allocatorIiEEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<int *, std::allocator<int>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPiNS_9allocatorIiEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPjPFvPvEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<unsigned int *, void (*)(void *)>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPjPFvPvEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPlNS_9allocatorIlEEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<long *, std::allocator<long>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPlNS_9allocatorIlEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_17__compressed_pairIPmNS_9allocatorImEEEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair<unsigned long *, std::allocator<unsigned long>>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__117__compressed_pairIPmNS_9allocatorImEEEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_19__map_value_compareIPvNS_12__value_typeIS2_P16RsContextWrapperEENS_4lessIS2_EELb1EEEEE",
   "name" : "std::add_pointer<const std::__map_value_compare<void *, std::__value_type<void *, RsContextWrapper *>, std::less<void *>, true>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__119__map_value_compareIPvNS_12__value_typeIS1_P16RsContextWrapperEENS_4lessIS1_EELb1EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char32_t, std::char_traits<char32_t>, std::allocator<char32_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDiNS_11char_traitsIDiEENS_9allocatorIDiEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char16_t, std::char_traits<char16_t>, std::allocator<char16_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDsNS_11char_traitsIDsEENS_9allocatorIDsEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char8_t, std::char_traits<char8_t>, std::allocator<char8_t>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIDuNS_11char_traitsIDuEENS_9allocatorIDuEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEEEE",
   "name" : "std::add_pointer<const std::__compressed_pair_elem<std::basic_string<char, std::char_traits<char>, std::allocator<char>>::__rep, 0, false>>",
   "size" : 1,
   "source_file" : "external/libcxx/include/type_traits",
   "template_args" :
   [
    "_ZTIKNSt3__122__compressed_pair_elemINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEE5__repELi0ELb0EEE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTINSt3__111add_pointerIKNS_22__compressed_pair_elemINS_12basic_stringIwNS_11char_traitsIwEENS_9allocatorIwEEE5__repELi0ELb0EEEEE",
