{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_A12_f",
   "name" : "float[10][12]",
   "referenced_type" : "_ZTIA12_f",
   "self_type" : "_ZTIA10_A12_f",
   "size" : 480,
   "source_file" : "system/media/audio_utils/include/audio_utils/ChannelMix.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_A2_f",
   "name" : "float[10][2]",
   "referenced_type" : "_ZTIA2_f",
   "self_type" : "_ZTIA10_A2_f",
   "size" : 80,
   "source_file" : "system/media/audio_utils/include/audio_utils/ChannelMix.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_A6_f",
   "name" : "float[10][6]",
   "referenced_type" : "_ZTIA6_f",
   "self_type" : "_ZTIA10_A6_f",
   "size" : 240,
   "source_file" : "system/media/audio_utils/include/audio_utils/ChannelMix.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_A8_f",
   "name" : "float[10][8]",
   "referenced_type" : "_ZTIA8_f",
   "self_type" : "_ZTIA10_A8_f",
   "size" : 320,
   "source_file" : "system/media/audio_utils/include/audio_utils/ChannelMix.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_f",
   "name" : "float[10]",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIA10_f",
   "size" : 40,
   "source_file" : "system/media/audio_utils/include/audio_utils/intrinsic_utils.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA11_f",
   "name" : "float[11]",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIA11_f",
   "size" : 44,

   "linker_set_key" : "_ZTIKNSt3__18functionIFffEEE",
   "name" : "const std::function<float (float)>",
   "referenced_type" : "_ZTINSt3__18functionIFffEEE",
   "self_type" : "_ZTIKNSt3__18functionIFffEEE",
   "size" : 24,
   "source_file" : "system/media/audio_utils/include/audio_utils/Balance.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18functionIFvRKN7android11audio_utils9CsdRecordEEEE",
   "name" : "const std::function<void (const CsdRecord &)>",
   "referenced_type" : "_ZTINSt3__18functionIFvRKN7android11audio_utils9CsdRecordEEEE",
   "self_type" : "_ZTIKNSt3__18functionIFvRKN7android11audio_utils9CsdRecordEEEE",
   "size" : 24,
   "source_file" : "system/media/audio_utils/include/audio_utils/MelAggregator.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKNSt3__18functionIFvRKN7android11audio_utils9MelRecordEEEE",
   "name" : "const std::function<void (const MelRecord &)>",
   "referenced_type" : "_ZTINSt3__18functionIFvRKN7android11audio_utils9MelRecordEEEE",
   "self_type" : "_ZTIKNSt3__18functionIFvRKN7android11audio_utils9MelRecordEEEE",
   "size" : 24,
   "source_file" : "system/media/audio_utils/include/audio_utils/MelAggregator.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKP22audio_utils_fifo_index",
   "name" : "audio_utils_fifo_index *const",
   "referenced_type" : "_ZTIP22audio_utils_fifo_index",
   "self_type" : "_ZTIKP22audio_utils_fifo_index",
   "size" : 4,
   "source_file" : "system/media/audio_utils/include/audio_utils/fifo.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPN7android7RefBase12weakref_implE",
   "name" : "android::RefBase::weakref_impl *const",
   "referenced_type" : "_ZTIPN7android7RefBase12weakref_implE",
   "self_type" : "_ZTIKPN7android7RefBase12weakref_implE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPv",
   "name" : "void *const",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIKPv",
   "size" : 4,
   "source_file" : "system/media/audio_utils/include/audio_utils/fifo.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKb",
   "name" : "const bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIKb",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/intrinsic_utils.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "system/media/audio/include/system/audio-hal-enums.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "system/media/audio_utils/include/audio_utils/primitives.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "system/media/audio_utils/include/audio_utils/ErrorLog.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "system/media/audio/include/system/audio-base-utils.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "system/media/audio_utils/include/audio_utils/channels.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "system/media/audio_utils/include/audio_utils/ErrorLog.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKy",
   "name" : "const unsigned long long",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIKy",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVb",
   "name" : "volatile bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIVb",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/Thread.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mode",
     "referenced_type" : "_ZTI17audio_gain_mode_t"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTI20audio_channel_mask_t"
    },
    {
     "field_name" : "min_value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "max_value",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "default_value",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "step_value",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "min_ramp_ms",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "max_ramp_ms",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI10audio_gain",
   "name" : "audio_gain",
   "referenced_type" : "_ZTI10audio_gain",
   "self_type" : "_ZTI10audio_gain",
   "size" : 32,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "role",
     "field_offset" : 32,
     "referenced_type" : "_ZTI17audio_port_role_t"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTI17audio_port_type_t"
    },
    {
     "field_name" : "name",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA128_c"
    },
    {
     "field_name" : "num_sample_rates",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sample_rates",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIA32_j"
    },
    {
     "field_name" : "num_channel_masks",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_masks",
     "field_offset" : 2208,
     "referenced_type" : "_ZTIA32_20audio_channel_mask_t"
    },
    {
     "field_name" : "num_formats",
     "field_offset" : 3232,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "formats",
     "field_offset" : 3264,
     "referenced_type" : "_ZTIA32_14audio_format_t"
    },
    {
     "field_name" : "num_gains",
     "field_offset" : 4288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gains",
     "field_offset" : 4320,
     "referenced_type" : "_ZTIA16_10audio_gain"
    },
    {
     "field_name" : "active_config",
     "field_offset" : 8416,
     "referenced_type" : "_ZTI17audio_port_config"
    },
    {
     "field_name" : "ext",
     "field_offset" : 10144,
     "referenced_type" : "_ZTIN10audio_portUt_E"
    }
   ],
   "linker_set_key" : "_ZTI10audio_port",
   "name" : "audio_port",
   "referenced_type" : "_ZTI10audio_port",
   "self_type" : "_ZTI10audio_port",
   "size" : 1316,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "num_sources",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sources",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA16_17audio_port_config"
    },
    {
     "field_name" : "num_sinks",
     "field_offset" : 27712,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sinks",
     "field_offset" : 27744,
     "referenced_type" : "_ZTIA16_17audio_port_config"
    }
   ],
   "linker_set_key" : "_ZTI11audio_patch",
   "name" : "audio_patch",
   "referenced_type" : "_ZTI11audio_patch",
   "self_type" : "_ZTI11audio_patch",
   "size" : 6924,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sample_rate",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTI20audio_channel_mask_t"
    },
    {
     "field_name" : "format",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14audio_format_t"
    },
    {
     "field_name" : "offload_info",
     "field_offset" : 128,
     "referenced_type" : "_ZTI20audio_offload_info_t"
    },
    {
     "field_name" : "frame_count",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12audio_config",
   "name" : "audio_config",
   "referenced_type" : "_ZTI12audio_config",
   "self_type" : "_ZTI12audio_config",
   "size" : 88,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "timeLow",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "timeMid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "timeHiAndVersion",
     "field_offset" : 48,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "clockSeq",
     "field_offset" : 64,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "node",
     "field_offset" : 80,
     "referenced_type" : "_ZTIA6_h"
    }
   ],
   "linker_set_key" : "_ZTI12audio_uuid_s",
   "name" : "audio_uuid_s",
   "referenced_type" : "_ZTI12audio_uuid_s",
   "self_type" : "_ZTI12audio_uuid_s",
   "size" : 16,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI12logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "_ZTI12logger_entry",
   "self_type" : "_ZTI12logger_entry",
   "size" : 28,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cb",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 192,
     "referenced_type" : "_ZTIA8_j"
    }
   ],
   "linker_set_key" : "_ZTI13android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "_ZTI13android_ycbcr",
   "self_type" : "_ZTI13android_ycbcr",
   "size" : 56,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "role",
     "field_offset" : 32,
     "referenced_type" : "_ZTI17audio_port_role_t"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTI17audio_port_type_t"
    },
    {
     "field_name" : "name",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA128_c"
    },
    {
     "field_name" : "num_audio_profiles",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "audio_profiles",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIA32_13audio_profile"
    },
    {
     "field_name" : "num_extra_audio_descriptors",
     "field_offset" : 70784,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "extra_audio_descriptors",
     "field_offset" : 70816,
     "referenced_type" : "_ZTIA32_28audio_extra_audio_descriptor"
    },
    {
     "field_name" : "num_gains",
     "field_offset" : 82080,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "gains",
     "field_offset" : 82112,
     "referenced_type" : "_ZTIA16_10audio_gain"
    },
    {
     "field_name" : "active_config",
     "field_offset" : 86208,
     "referenced_type" : "_ZTI17audio_port_config"
    },
    {
     "field_name" : "ext",
     "field_offset" : 87936,
     "referenced_type" : "_ZTIN13audio_port_v7Ut_E"
    }
   ],
   "linker_set_key" : "_ZTI13audio_port_v7",
   "name" : "audio_port_v7",
   "referenced_type" : "_ZTI13audio_port_v7",
   "self_type" : "_ZTI13audio_port_v7",
   "size" : 11040,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "_ZTI14audio_format_t"
    },
    {
     "field_name" : "num_sample_rates",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sample_rates",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA32_j"
    },
    {
     "field_name" : "num_channel_masks",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_masks",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIA32_20audio_channel_mask_t"
    },
    {
     "field_name" : "encapsulation_type",
     "field_offset" : 2144,
     "referenced_type" : "_ZTI26audio_encapsulation_type_t"
    }
   ],
   "linker_set_key" : "_ZTI13audio_profile",
   "name" : "audio_profile",
   "referenced_type" : "_ZTI13audio_profile",
   "self_type" : "_ZTI13audio_profile",
   "size" : 272,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "input",
     "referenced_type" : "_ZTI19audio_input_flags_t"
    },
    {
     "field_name" : "output",
     "referenced_type" : "_ZTI20audio_output_flags_t"
    }
   ],
   "linker_set_key" : "_ZTI14audio_io_flags",
   "name" : "audio_io_flags",
   "record_kind" : "union",
   "referenced_type" : "_ZTI14audio_io_flags",
   "self_type" : "_ZTI14audio_io_flags",
   "size" : 4,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "increment_underrun",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFiP14hal_smoothnessjE"
    },
    {
     "field_name" : "increment_overrun",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiP14hal_smoothnessjE"
    },
    {
     "field_name" : "increment_total_writes",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiP14hal_smoothnessjmE"
    },
    {
     "field_name" : "flush",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP14hal_smoothnessE"
    }
   ],
   "linker_set_key" : "_ZTI14hal_smoothness",
   "name" : "hal_smoothness",
   "referenced_type" : "_ZTI14hal_smoothness",
   "self_type" : "_ZTI14hal_smoothness",
   "size" : 20,
   "source_file" : "system/media/audio_utils/include/audio_utils/hal_smoothness.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reset",
     "referenced_type" : "_ZTIPFvP14resampler_itfeE"
    },
    {
     "field_name" : "resample_from_provider",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFiP14resampler_itfePsPjE"
    },
    {
     "field_name" : "resample_from_input",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiP14resampler_itfePsPjS1_S2_E"
    },
    {
     "field_name" : "delay_ns",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiP14resampler_itfeE"
    }
   ],
   "linker_set_key" : "_ZTI14resampler_itfe",
   "name" : "resampler_itfe",
   "referenced_type" : "_ZTI14resampler_itfe",
   "self_type" : "_ZTI14resampler_itfe",
   "size" : 16,
   "source_file" : "system/media/audio_utils/include/audio_utils/resampler.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI16android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "_ZTI16android_xy_color",
   "self_type" : "_ZTI16android_xy_color",
   "size" : 8,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI21audio_utils_fifo_base"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mFrameSize",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "field_offset" : 288,
     "referenced_type" : "_ZTIKPv"
    },
    {
     "access" : "private",
     "field_name" : "mSingleProcessSharedRear",
     "field_offset" : 320,
     "referenced_type" : "_ZTI22audio_utils_fifo_index"
    },
    {
     "access" : "private",
     "field_name" : "mSingleProcessSharedFront",
     "field_offset" : 352,
     "referenced_type" : "_ZTI22audio_utils_fifo_index"
    }
   ],
   "linker_set_key" : "_ZTI16audio_utils_fifo",
   "name" : "audio_utils_fifo",
   "record_kind" : "class",
   "referenced_type" : "_ZTI16audio_utils_fifo",
   "self_type" : "_ZTI16audio_utils_fifo",
   "size" : 48,
   "source_file" : "system/media/audio_utils/include/audio_utils/fifo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN16resampler_bufferUt_E"
    },
    {
     "field_name" : "frame_count",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI16resampler_buffer",
   "name" : "resampler_buffer",
   "referenced_type" : "_ZTI16resampler_buffer",
   "self_type" : "_ZTI16resampler_buffer",
   "size" : 8,
   "source_file" : "system/media/audio_utils/include/audio_utils/resampler.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sample_rate",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTI20audio_channel_mask_t"
    },
    {
     "field_name" : "format",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14audio_format_t"
    }
   ],
   "linker_set_key" : "_ZTI17audio_config_base",
   "name" : "audio_config_base",
   "referenced_type" : "_ZTI17audio_config_base",
   "self_type" : "_ZTI17audio_config_base",
   "size" : 12,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mode",
     "field_offset" : 32,
     "referenced_type" : "_ZTI17audio_gain_mode_t"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 64,
     "referenced_type" : "_ZTI20audio_channel_mask_t"
    },
    {
     "field_name" : "values",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA32_i"
    },
    {
     "field_name" : "ramp_duration_ms",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17audio_gain_config",
   "name" : "audio_gain_config",
   "referenced_type" : "_ZTI17audio_gain_config",
   "self_type" : "_ZTI17audio_gain_config",
   "size" : 144,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "id",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "role",
     "field_offset" : 32,
     "referenced_type" : "_ZTI17audio_port_role_t"
    },
    {
     "field_name" : "type",
     "field_offset" : 64,
     "referenced_type" : "_ZTI17audio_port_type_t"
    },
    {
     "field_name" : "config_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sample_rate",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 160,
     "referenced_type" : "_ZTI20audio_channel_mask_t"
    },
    {
     "field_name" : "format",
     "field_offset" : 192,
     "referenced_type" : "_ZTI14audio_format_t"
    },
    {
     "field_name" : "gain",
     "field_offset" : 224,
     "referenced_type" : "_ZTI17audio_gain_config"
    },
    {
     "field_name" : "flags",
     "field_offset" : 1376,
     "referenced_type" : "_ZTI14audio_io_flags"
    },
    {
     "field_name" : "ext",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIN17audio_port_configUt_E"
    }
   ],
   "linker_set_key" : "_ZTI17audio_port_config",
   "name" : "audio_port_config",
   "referenced_type" : "_ZTI17audio_port_config",
   "self_type" : "_ZTI17audio_port_config",
   "size" : 216,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mOffset",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mLength",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI17audio_utils_iovec",
   "name" : "audio_utils_iovec",
   "referenced_type" : "_ZTI17audio_utils_iovec",
   "self_type" : "_ZTI17audio_utils_iovec",
   "size" : 8,
   "source_file" : "system/media/audio_utils/include/audio_utils/fifo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "component",
     "field_offset" : 32,
     "referenced_type" : "_ZTI22android_flex_component"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI18android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "_ZTI18android_flex_plane",
   "self_type" : "_ZTI18android_flex_plane",
   "size" : 32,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "content_type",
     "referenced_type" : "_ZTI20audio_content_type_t"
    },
    {
     "field_name" : "usage",
     "field_offset" : 32,
     "referenced_type" : "_ZTI13audio_usage_t"
    },
    {
     "field_name" : "source",
     "field_offset" : 64,
     "referenced_type" : "_ZTI14audio_source_t"
    },
    {
     "field_name" : "flags",
     "field_offset" : 96,
     "referenced_type" : "_ZTI18audio_flags_mask_t"
    },
    {
     "field_name" : "tags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA256_c"
    }
   ],
   "linker_set_key" : "_ZTI18audio_attributes_t",
   "name" : "audio_attributes_t",
   "referenced_type" : "_ZTI18audio_attributes_t",
   "self_type" : "_ZTI18audio_attributes_t",
   "size" : 272,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hw_module",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "handle",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "latency_class",
     "field_offset" : 64,
     "referenced_type" : "_ZTI25audio_mix_latency_class_t"
    }
   ],
   "linker_set_key" : "_ZTI18audio_port_mix_ext",
   "name" : "audio_port_mix_ext",
   "referenced_type" : "_ZTI18audio_port_mix_ext",
   "self_type" : "_ZTI18audio_port_mix_ext",
   "size" : 12,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "_ZTI19android_flex_format"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP18android_flex_plane"
    }
   ],
   "linker_set_key" : "_ZTI19android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "_ZTI19android_flex_layout",
   "self_type" : "_ZTI19android_flex_layout",
   "size" : 12,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "time_nanoseconds",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "position_frames",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI19audio_mmap_position",
   "name" : "audio_mmap_position",
   "referenced_type" : "_ZTI19audio_mmap_position",
   "self_type" : "_ZTI19audio_mmap_position",
   "size" : 16,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mSpeed",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "mPitch",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "mStretchMode",
     "field_offset" : 64,
     "referenced_type" : "_ZTI32audio_timestretch_stretch_mode_t"
    },
    {
     "field_name" : "mFallbackMode",
     "field_offset" : 96,
     "referenced_type" : "_ZTI33audio_timestretch_fallback_mode_t"
    }
   ],
   "linker_set_key" : "_ZTI19audio_playback_rate",
   "name" : "audio_playback_rate",
   "referenced_type" : "_ZTI19audio_playback_rate",
   "self_type" : "_ZTI19audio_playback_rate",
   "size" : 16,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "read",
     "referenced_type" : "_ZTIPFiP19echo_reference_itfeP21echo_reference_bufferE"
    },
    {
     "field_name" : "write",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFiP19echo_reference_itfeP21echo_reference_bufferE"
    }
   ],
   "linker_set_key" : "_ZTI19echo_reference_itfe",
   "name" : "echo_reference_itfe",
   "referenced_type" : "_ZTI19echo_reference_itfe",
   "self_type" : "_ZTI19echo_reference_itfe",
   "size" : 8,
   "source_file" : "system/media/audio_utils/include/audio_utils/echo_reference.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA8_j"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "_ZTIA_f"
    }
   ],
   "linker_set_key" : "_ZTI20android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "_ZTI20android_depth_points",
   "self_type" : "_ZTI20android_depth_points",
   "size" : 36,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "size",
     "field_offset" : 16,
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "sample_rate",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 64,
     "referenced_type" : "_ZTI20audio_channel_mask_t"
    },
    {
     "field_name" : "format",
     "field_offset" : 96,
     "referenced_type" : "_ZTI14audio_format_t"
    },
    {
     "field_name" : "stream_type",
     "field_offset" : 128,
     "referenced_type" : "_ZTI19audio_stream_type_t"
    },
    {
     "field_name" : "bit_rate",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "duration_us",
     "field_offset" : 192,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "has_video",
     "field_offset" : 256,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "is_streaming",
     "field_offset" : 264,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "bit_width",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "offload_buffer_size",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usage",
     "field_offset" : 352,
     "referenced_type" : "_ZTI13audio_usage_t"
    },
    {
     "field_name" : "encapsulation_mode",
     "field_offset" : 384,
     "referenced_type" : "_ZTI26audio_encapsulation_mode_t"
    },
    {
     "field_name" : "content_id",
     "field_offset" : 416,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sync_id",
     "field_offset" : 448,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI20audio_offload_info_t",
   "name" : "audio_offload_info_t",
   "referenced_type" : "_ZTI20audio_offload_info_t",
   "self_type" : "_ZTI20audio_offload_info_t",
   "size" : 64,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "struct_size",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "buffer_id",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "priority",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "tag",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "file",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "line",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "message",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21__android_log_message",
   "name" : "__android_log_message",
   "referenced_type" : "_ZTI21__android_log_message",
   "self_type" : "_ZTI21__android_log_message",
   "size" : 28,
   "source_file" : "system/logging/liblog/include_vndk/android/log.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hw_module",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15audio_devices_t"
    },
    {
     "field_name" : "address",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "encapsulation_modes",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "encapsulation_metadata_types",
     "field_offset" : 352,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI21audio_port_device_ext",
   "name" : "audio_port_device_ext",
   "referenced_type" : "_ZTI21audio_port_device_ext",
   "self_type" : "_ZTI21audio_port_device_ext",
   "size" : 48,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mFrameCount",
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "protected",
     "field_name" : "mFrameCountP2",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "protected",
     "field_name" : "mFudgeFactor",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "protected",
     "field_name" : "mWriterRear",
     "field_offset" : 96,
     "referenced_type" : "_ZTIR22audio_utils_fifo_index"
    },
    {
     "access" : "protected",
     "field_name" : "mWriterRearSync",
     "field_offset" : 128,
     "referenced_type" : "_ZTIK21audio_utils_fifo_sync"
    },
    {
     "access" : "protected",
     "field_name" : "mThrottleFront",
     "field_offset" : 160,
     "referenced_type" : "_ZTIKP22audio_utils_fifo_index"
    },
    {
     "access" : "protected",
     "field_name" : "mThrottleFrontSync",
     "field_offset" : 192,
     "referenced_type" : "_ZTIK21audio_utils_fifo_sync"
    },
    {
     "access" : "protected",
     "field_name" : "mIsShutdown",
     "field_offset" : 224,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTI21audio_utils_fifo_base",
   "name" : "audio_utils_fifo_base",
   "record_kind" : "class",
   "referenced_type" : "_ZTI21audio_utils_fifo_base",
   "self_type" : "_ZTI21audio_utils_fifo_base",
   "size" : 32,
   "source_file" : "system/media/audio_utils/include/audio_utils/fifo.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "raw",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "frame_count",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "delay_ns",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "time_stamp",
     "field_offset" : 96,
     "referenced_type" : "_ZTI8timespec"
    }
   ],
   "linker_set_key" : "_ZTI21echo_reference_buffer",
   "name" : "echo_reference_buffer",
   "referenced_type" : "_ZTI21echo_reference_buffer",
   "self_type" : "_ZTI21echo_reference_buffer",
   "size" : 20,
   "source_file" : "system/media/audio_utils/include/audio_utils/echo_reference.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "source",
     "referenced_type" : "_ZTI14audio_source_t"
    },
    {
     "field_name" : "gain",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "dest_device",
     "field_offset" : 64,
     "referenced_type" : "_ZTI15audio_devices_t"
    },
    {
     "field_name" : "dest_device_address",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA32_c"
    }
   ],
   "linker_set_key" : "_ZTI21record_track_metadata",
   "name" : "record_track_metadata",
   "referenced_type" : "_ZTI21record_track_metadata",
   "self_type" : "_ZTI21record_track_metadata",
   "size" : 44,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "config",
     "referenced_type" : "_ZTI17audio_config_base"
    },
    {
     "field_name" : "mixer_behavior",
     "field_offset" : 96,
     "referenced_type" : "_ZTI22audio_mixer_behavior_t"
    }
   ],
   "linker_set_key" : "_ZTI22audio_mixer_attributes",
   "name" : "audio_mixer_attributes",
   "referenced_type" : "_ZTI22audio_mixer_attributes",
   "self_type" : "_ZTI22audio_mixer_attributes",
   "size" : 16,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "shared_memory_address",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "shared_memory_fd",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "buffer_size_frames",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "burst_size_frames",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTI22audio_mmap_buffer_flag"
    }
   ],
   "linker_set_key" : "_ZTI22audio_mmap_buffer_info",
   "name" : "audio_mmap_buffer_info",
   "referenced_type" : "_ZTI22audio_mmap_buffer_info",
   "self_type" : "_ZTI22audio_mmap_buffer_info",
   "size" : 20,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "session",
     "referenced_type" : "_ZTI15audio_session_t"
    }
   ],
   "linker_set_key" : "_ZTI22audio_port_session_ext",
   "name" : "audio_port_session_ext",
   "referenced_type" : "_ZTI22audio_port_session_ext",
   "self_type" : "_ZTI22audio_port_session_ext",
   "size" : 4,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mIndex",
     "referenced_type" : "_ZTINSt3__16atomicIjEE"
    }
   ],
   "linker_set_key" : "_ZTI22audio_utils_fifo_index",
   "name" : "audio_utils_fifo_index",
   "record_kind" : "class",
   "referenced_type" : "_ZTI22audio_utils_fifo_index",
   "self_type" : "_ZTI22audio_utils_fifo_index",
   "size" : 4,
   "source_file" : "system/media/audio_utils/include/audio_utils/fifo_index.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "underrun_count",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "overrun_count",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "total_writes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "total_frames_written",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "total_frames_lost",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "smoothness_value",
     "field_offset" : 192,
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI22hal_smoothness_metrics",
   "name" : "hal_smoothness_metrics",
   "referenced_type" : "_ZTI22hal_smoothness_metrics",
   "self_type" : "_ZTI22hal_smoothness_metrics",
   "size" : 40,
   "source_file" : "system/media/audio_utils/include/audio_utils/hal_smoothness.h"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI25audio_utils_fifo_provider"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLocalFront",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mThrottleFront",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP22audio_utils_fifo_index"
    },
    {
     "access" : "private",
     "field_name" : "mFlush",
     "field_offset" : 256,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mArmLevel",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mTriggerLevel",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mIsArmed",
     "field_offset" : 352,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mTotalLost",
     "field_offset" : 384,
     "referenced_type" : "_ZTIy"
    },
    {
     "access" : "private",
     "field_name" : "mTotalFlushed",
     "field_offset" : 448,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI23audio_utils_fifo_reader",
   "name" : "audio_utils_fifo_reader",
   "record_kind" : "class",
   "referenced_type" : "_ZTI23audio_utils_fifo_reader",
   "self_type" : "_ZTI23audio_utils_fifo_reader",
   "size" : 64,
   "source_file" : "system/media/audio_utils/include/audio_utils/fifo.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI23audio_utils_fifo_reader"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN23audio_utils_fifo_readerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN23audio_utils_fifo_readerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN23audio_utils_fifo_reader6obtainEP17audio_utils_iovecjPK8timespec"
    },
    {
     "mangled_component_name" : "_ZN23audio_utils_fifo_reader7releaseEj"
    },
    {
     "mangled_component_name" : "_ZN23audio_utils_fifo_reader9availableEv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI25audio_utils_fifo_provider"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLocalRear",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mArmLevel",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mTriggerLevel",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mIsArmed",
     "field_offset" : 288,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mEffectiveFrames",
     "field_offset" : 320,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI23audio_utils_fifo_writer",
   "name" : "audio_utils_fifo_writer",
   "record_kind" : "class",
   "referenced_type" : "_ZTI23audio_utils_fifo_writer",
   "self_type" : "_ZTI23audio_utils_fifo_writer",
   "size" : 48,
   "source_file" : "system/media/audio_utils/include/audio_utils/fifo.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI23audio_utils_fifo_writer"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN23audio_utils_fifo_writerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN23audio_utils_fifo_writerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN23audio_utils_fifo_writer6obtainEP17audio_utils_iovecjPK8timespec"
    },
    {
     "mangled_component_name" : "_ZN23audio_utils_fifo_writer7releaseEj"
    },
    {
     "mangled_component_name" : "_ZN23audio_utils_fifo_writer9availableEv"
    }
   ]
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "time",
     "referenced_type" : "_ZTIA19_c"
    }
   ],
   "linker_set_key" : "_ZTI23audio_utils_time_string",
   "name" : "audio_utils_time_string",
   "referenced_type" : "_ZTI23audio_utils_time_string",
   "self_type" : "_ZTI23audio_utils_time_string",
   "size" : 19,
   "source_file" : "system/media/audio_utils/include/audio_utils/clock.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "usage",
     "referenced_type" : "_ZTI13audio_usage_t"
    },
    {
     "field_name" : "content_type",
     "field_offset" : 32,
     "referenced_type" : "_ZTI20audio_content_type_t"
    },
    {
     "field_name" : "gain",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI23playback_track_metadata",
   "name" : "playback_track_metadata",
   "referenced_type" : "_ZTI23playback_track_metadata",
   "self_type" : "_ZTI23playback_track_metadata",
   "size" : 12,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "c",
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI24audio_metadata_unknown_t",
   "name" : "audio_metadata_unknown_t",
   "referenced_type" : "_ZTI24audio_metadata_unknown_t",
   "self_type" : "_ZTI24audio_metadata_unknown_t",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "base",
     "referenced_type" : "_ZTI21record_track_metadata"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 352,
     "referenced_type" : "_ZTI20audio_channel_mask_t"
    },
    {
     "field_name" : "tags",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA256_c"
    }
   ],
   "linker_set_key" : "_ZTI24record_track_metadata_v7",
   "name" : "record_track_metadata_v7",
   "referenced_type" : "_ZTI24record_track_metadata_v7",
   "self_type" : "_ZTI24record_track_metadata_v7",
   "size" : 304,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI25android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "_ZTI25android_cta861_3_metadata",
   "self_type" : "_ZTI25android_cta861_3_metadata",
   "size" : 8,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hw_module",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "handle",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "usecase",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN25audio_port_config_mix_extUt_E"
    }
   ],
   "linker_set_key" : "_ZTI25audio_port_config_mix_ext",
   "name" : "audio_port_config_mix_ext",
   "referenced_type" : "_ZTI25audio_port_config_mix_ext",
   "self_type" : "_ZTI25audio_port_config_mix_ext",
   "size" : 12,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mFifo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIR16audio_utils_fifo"
    },
    {
     "access" : "protected",
     "field_name" : "mObtained",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "protected",
     "field_name" : "mTotalReleased",
     "field_offset" : 128,
     "referenced_type" : "_ZTIy"
    }
   ],
   "linker_set_key" : "_ZTI25audio_utils_fifo_provider",
   "name" : "audio_utils_fifo_provider",
   "record_kind" : "class",
   "referenced_type" : "_ZTI25audio_utils_fifo_provider",
   "self_type" : "_ZTI25audio_utils_fifo_provider",
   "size" : 24,
   "source_file" : "system/media/audio_utils/include/audio_utils/fifo.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI25audio_utils_fifo_provider"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN25audio_utils_fifo_providerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN25audio_utils_fifo_providerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN25audio_utils_fifo_provider6obtainEP17audio_utils_iovecjPK8timespec"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN25audio_utils_fifo_provider7releaseEj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN25audio_utils_fifo_provider9availableEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "get_next_buffer",
     "referenced_type" : "_ZTIPFiP25resampler_buffer_providerP16resampler_bufferE"
    },
    {
     "field_name" : "release_buffer",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPFvP25resampler_buffer_providerP16resampler_bufferE"
    }
   ],
   "linker_set_key" : "_ZTI25resampler_buffer_provider",
   "name" : "resampler_buffer_provider",
   "referenced_type" : "_ZTI25resampler_buffer_provider",
   "self_type" : "_ZTI25resampler_buffer_provider",
   "size" : 8,
   "source_file" : "system/media/audio_utils/include/audio_utils/resampler.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "_ZTI16android_xy_color"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI26android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "_ZTI26android_smpte2086_metadata",
   "self_type" : "_ZTI26android_smpte2086_metadata",
   "size" : 40,
   "source_file" : "system/core/libsystem/include/system/graphics.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "base",
     "referenced_type" : "_ZTI23playback_track_metadata"
    },
    {
     "field_name" : "channel_mask",
     "field_offset" : 96,
     "referenced_type" : "_ZTI20audio_channel_mask_t"
    },
    {
     "field_name" : "tags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA256_c"
    }
   ],
   "linker_set_key" : "_ZTI26playback_track_metadata_v7",
   "name" : "playback_track_metadata_v7",
   "referenced_type" : "_ZTI26playback_track_metadata_v7",
   "self_type" : "_ZTI26playback_track_metadata_v7",
   "size" : 272,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "z",
     "field_offset" : 64,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTI27audio_microphone_coordinate",
   "name" : "audio_microphone_coordinate",
   "referenced_type" : "_ZTI27audio_microphone_coordinate",
   "self_type" : "_ZTI27audio_microphone_coordinate",
   "size" : 12,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "standard",
     "referenced_type" : "_ZTI16audio_standard_t"
    },
    {
     "field_name" : "descriptor_length",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "descriptor",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA32_h"
    },
    {
     "field_name" : "encapsulation_type",
     "field_offset" : 320,
     "referenced_type" : "_ZTI26audio_encapsulation_type_t"
    }
   ],
   "linker_set_key" : "_ZTI28audio_extra_audio_descriptor",
   "name" : "audio_extra_audio_descriptor",
   "referenced_type" : "_ZTI28audio_extra_audio_descriptor",
   "self_type" : "_ZTI28audio_extra_audio_descriptor",
   "size" : 44,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "hw_module",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "_ZTI15audio_devices_t"
    },
    {
     "field_name" : "address",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA32_c"
    }
   ],
   "linker_set_key" : "_ZTI28audio_port_config_device_ext",
   "name" : "audio_port_config_device_ext",
   "referenced_type" : "_ZTI28audio_port_config_device_ext",
   "self_type" : "_ZTI28audio_port_config_device_ext",
   "size" : 40,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "session",
     "referenced_type" : "_ZTI15audio_session_t"
    }
   ],
   "linker_set_key" : "_ZTI29audio_port_config_session_ext",
   "name" : "audio_port_config_session_ext",
   "referenced_type" : "_ZTI29audio_port_config_session_ext",
   "self_type" : "_ZTI29audio_port_config_session_ext",
   "size" : 4,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "device_id",
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "id",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "device",
     "field_offset" : 288,
     "referenced_type" : "_ZTI15audio_devices_t"
    },
    {
     "field_name" : "address",
     "field_offset" : 320,
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "field_name" : "channel_mapping",
     "field_offset" : 576,
     "referenced_type" : "_ZTIA30_34audio_microphone_channel_mapping_t"
    },
    {
     "field_name" : "location",
     "field_offset" : 1536,
     "referenced_type" : "_ZTI27audio_microphone_location_t"
    },
    {
     "field_name" : "group",
     "field_offset" : 1568,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "index_in_the_group",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sensitivity",
     "field_offset" : 1632,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "max_spl",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "min_spl",
     "field_offset" : 1696,
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "directionality",
     "field_offset" : 1728,
     "referenced_type" : "_ZTI33audio_microphone_directionality_t"
    },
    {
     "field_name" : "num_frequency_responses",
     "field_offset" : 1760,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "frequency_responses",
     "field_offset" : 1792,
     "referenced_type" : "_ZTIA2_A256_f"
    },
    {
     "field_name" : "geometric_location",
     "field_offset" : 18176,
     "referenced_type" : "_ZTI27audio_microphone_coordinate"
    },
    {
     "field_name" : "orientation",
     "field_offset" : 18272,
     "referenced_type" : "_ZTI27audio_microphone_coordinate"
    }
   ],
   "linker_set_key" : "_ZTI33audio_microphone_characteristic_t",
   "name" : "audio_microphone_characteristic_t",
   "referenced_type" : "_ZTI33audio_microphone_characteristic_t",
   "self_type" : "_ZTI33audio_microphone_characteristic_t",
   "size" : 2296,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 1,
   "is_anonymous" : true,
   "linker_set_key" : "_ZTI4$_12",
   "name" : "(lambda)",
   "record_kind" : "class",
   "referenced_type" : "_ZTI4$_12",
   "self_type" : "_ZTI4$_12",
   "size" : 1,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "_ZTIN7log_msgUt_E"
    }
   ],
   "linker_set_key" : "_ZTI7log_msg",
   "name" : "log_msg",
   "referenced_type" : "_ZTI7log_msg",
   "self_type" : "_ZTI7log_msg",
   "size" : 5124,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8log_time",
   "name" : "log_time",
   "referenced_type" : "_ZTI8log_time",
   "self_type" : "_ZTI8log_time",
   "size" : 8,
   "source_file" : "system/logging/liblog/include_vndk/log/log_time.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "device",
     "referenced_type" : "_ZTI21audio_port_device_ext"
    },
    {
     "field_name" : "mix",
     "referenced_type" : "_ZTI18audio_port_mix_ext"
    },
    {
     "field_name" : "session",
     "referenced_type" : "_ZTI22audio_port_session_ext"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN10audio_portUt_E",
   "name" : "audio_port::(unnamed)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN10audio_portUt_E",
   "self_type" : "_ZTIN10audio_portUt_E",
   "size" : 48,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "device",
     "referenced_type" : "_ZTI21audio_port_device_ext"
    },
    {
     "field_name" : "mix",
     "referenced_type" : "_ZTI18audio_port_mix_ext"
    },
    {
     "field_name" : "session",
     "referenced_type" : "_ZTI22audio_port_session_ext"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN13audio_port_v7Ut_E",
   "name" : "audio_port_v7::(unnamed)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN13audio_port_v7Ut_E",
   "self_type" : "_ZTIN13audio_port_v7Ut_E",
   "size" : 48,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN16libutilsinternal16is_complete_typeIN7android11audio_utils12BiquadFilterIfLb1ENS2_7details25DefaultBiquadConstOptionsEEEvEE",
   "name" : "libutilsinternal::is_complete_type<android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>, void>",
   "referenced_type" : "_ZTIN16libutilsinternal16is_complete_typeIN7android11audio_utils12BiquadFilterIfLb1ENS2_7details25DefaultBiquadConstOptionsEEEvEE",
   "self_type" : "_ZTIN16libutilsinternal16is_complete_typeIN7android11audio_utils12BiquadFilterIfLb1ENS2_7details25DefaultBiquadConstOptionsEEEvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "template_args" :
   [
    "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEEE",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "raw",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "i16",
     "referenced_type" : "_ZTIPs"
    },
    {
     "field_name" : "i8",
     "referenced_type" : "_ZTIPa"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN16resampler_bufferUt_E",
   "name" : "resampler_buffer::(anonymous)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN16resampler_bufferUt_E",
   "self_type" : "_ZTIN16resampler_bufferUt_E",
   "size" : 4,
   "source_file" : "system/media/audio_utils/include/audio_utils/resampler.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "device",
     "referenced_type" : "_ZTI28audio_port_config_device_ext"
    },
    {
     "field_name" : "mix",
     "referenced_type" : "_ZTI25audio_port_config_mix_ext"
    },
    {
     "field_name" : "session",
     "referenced_type" : "_ZTI29audio_port_config_session_ext"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN17audio_port_configUt_E",
   "name" : "audio_port_config::(unnamed)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN17audio_port_configUt_E",
   "self_type" : "_ZTIN17audio_port_configUt_E",
   "size" : 40,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "stream",
     "referenced_type" : "_ZTI19audio_stream_type_t"
    },
    {
     "field_name" : "source",
     "referenced_type" : "_ZTI14audio_source_t"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN25audio_port_config_mix_extUt_E",
   "name" : "audio_port_config_mix_ext::(unnamed)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN25audio_port_config_mix_extUt_E",
   "self_type" : "_ZTIN25audio_port_config_mix_extUt_E",
   "size" : 4,
   "source_file" : "system/media/audio/include/system/audio.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIA10_f"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj10EEE",
   "name" : "android::audio_utils::intrinsics::internal_array_t<float, 10>",
   "referenced_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj10EEE",
   "self_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj10EEE",
   "size" : 40,
   "source_file" : "system/media/audio_utils/include/audio_utils/intrinsic_utils.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIA11_f"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj11EEE",
   "name" : "android::audio_utils::intrinsics::internal_array_t<float, 11>",
   "referenced_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj11EEE",
   "self_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj11EEE",
   "size" : 44,
   "source_file" : "system/media/audio_utils/include/audio_utils/intrinsic_utils.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIA12_f"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj12EEE",
   "name" : "android::audio_utils::intrinsics::internal_array_t<float, 12>",
   "referenced_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj12EEE",
   "self_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj12EEE",
   "size" : 48,
   "source_file" : "system/media/audio_utils/include/audio_utils/intrinsic_utils.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIA13_f"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj13EEE",
   "name" : "android::audio_utils::intrinsics::internal_array_t<float, 13>",
   "referenced_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj13EEE",
   "self_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj13EEE",
   "size" : 52,
   "source_file" : "system/media/audio_utils/include/audio_utils/intrinsic_utils.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIA14_f"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj14EEE",
   "name" : "android::audio_utils::intrinsics::internal_array_t<float, 14>",
   "referenced_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj14EEE",
   "self_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj14EEE",
   "size" : 56,
   "source_file" : "system/media/audio_utils/include/audio_utils/intrinsic_utils.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIA15_f"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj15EEE",
   "name" : "android::audio_utils::intrinsics::internal_array_t<float, 15>",
   "referenced_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj15EEE",
   "self_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj15EEE",
   "size" : 60,
   "source_file" : "system/media/audio_utils/include/audio_utils/intrinsic_utils.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIA2_f"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj2EEE",
   "name" : "android::audio_utils::intrinsics::internal_array_t<float, 2>",
   "referenced_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj2EEE",
   "self_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj2EEE",
   "size" : 8,
   "source_file" : "system/media/audio_utils/include/audio_utils/intrinsic_utils.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIA3_f"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj3EEE",
   "name" : "android::audio_utils::intrinsics::internal_array_t<float, 3>",
   "referenced_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj3EEE",
   "self_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj3EEE",
   "size" : 12,
   "source_file" : "system/media/audio_utils/include/audio_utils/intrinsic_utils.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIA5_f"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj5EEE",
   "name" : "android::audio_utils::intrinsics::internal_array_t<float, 5>",
   "referenced_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj5EEE",
   "self_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj5EEE",
   "size" : 20,
   "source_file" : "system/media/audio_utils/include/audio_utils/intrinsic_utils.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIA6_f"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj6EEE",
   "name" : "android::audio_utils::intrinsics::internal_array_t<float, 6>",
   "referenced_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj6EEE",
   "self_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj6EEE",
   "size" : 24,
   "source_file" : "system/media/audio_utils/include/audio_utils/intrinsic_utils.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIA7_f"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj7EEE",
   "name" : "android::audio_utils::intrinsics::internal_array_t<float, 7>",
   "referenced_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj7EEE",
   "self_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj7EEE",
   "size" : 28,
   "source_file" : "system/media/audio_utils/include/audio_utils/intrinsic_utils.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "v",
     "referenced_type" : "_ZTIA9_f"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj9EEE",
   "name" : "android::audio_utils::intrinsics::internal_array_t<float, 9>",
   "referenced_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj9EEE",
   "self_type" : "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj9EEE",
   "size" : 36,
   "source_file" : "system/media/audio_utils/include/audio_utils/intrinsic_utils.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj0ELb0EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<0, false>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj0ELb0EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj0ELb0EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj0ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<0, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj0ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj0ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj10ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<10, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj10ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj10ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj11ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<11, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj11ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj11ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj12ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<12, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj12ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj12ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj13ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<13, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj13ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj13ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj14ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<14, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj14ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj14ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj15ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<15, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj15ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj15ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj16ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<16, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj16ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj16ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj17ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<17, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj17ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj17ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj18ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<18, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj18ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj18ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj19ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<19, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj19ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj19ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj1ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<1, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj1ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj1ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj20ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<20, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj20ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj20ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj21ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<21, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj21ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj21ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj22ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<22, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj22ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj22ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj23ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<23, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj23ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj23ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj24ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<24, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj24ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj24ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj25ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<25, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj25ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj25ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj26ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<26, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj26ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj26ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj27ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<27, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj27ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj27ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj28ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<28, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj28ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj28ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj29ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<29, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj29ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj29ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj2ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<2, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj2ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj2ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj30ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<30, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj30ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj30ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj31ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<31, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj31ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj31ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj3ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<3, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj3ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj3ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj4ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<4, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj4ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj4ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj5ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<5, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj5ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj5ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj6ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<6, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj6ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj6ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj7ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<7, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj7ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj7ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj8ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<8, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj8ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj8ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj9ELb1EEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>::FuncWrap<9, true>",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj9ELb1EEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEE8FuncWrapILj9ELb1EEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mChannelCount",
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mCoefs",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16vectorIfNS_9allocatorIfEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mDelays",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__16vectorIfNS_9allocatorIfEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mFilterOptions",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN7android11audio_utils7details13FILTER_OPTIONE"
    },
    {
     "access" : "private",
     "field_name" : "mFunc",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFvPfPKfjjjS_S1_jN7android11audio_utils7details13FILTER_OPTIONEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEEE",
   "name" : "android::audio_utils::BiquadFilter<float, true, android::audio_utils::details::DefaultBiquadConstOptions>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEEE",
   "self_type" : "_ZTIN7android11audio_utils12BiquadFilterIfLb1ENS0_7details25DefaultBiquadConstOptionsEEE",
   "size" : 36,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h",
   "template_args" :
   [
    "_ZTIf",
    "_ZTIN7android11audio_utils7details25DefaultBiquadConstOptionsE"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils12MelProcessor11MelCallbackE",
   "name" : "android::audio_utils::MelProcessor::MelCallback",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils12MelProcessor11MelCallbackE",
   "self_type" : "_ZTIN7android11audio_utils12MelProcessor11MelCallbackE",
   "size" : 12,
   "source_file" : "system/media/audio_utils/include/audio_utils/MelProcessor.h",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11audio_utils12MelProcessor11MelCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11audio_utils12MelProcessor11MelCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11audio_utils12MelProcessor11MelCallbackD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11audio_utils12MelProcessor11MelCallback14onNewMelValuesERKNSt3__16vectorIfNS3_9allocatorIfEEEEjji"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11audio_utils12MelProcessor11MelCallback19onMomentaryExposureEfi"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11audio_utils12MelProcessor11MelCallbackE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11audio_utils12MelProcessor11MelCallbackD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android11audio_utils12MelProcessor11MelCallbackD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mMel",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "mMels",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16vectorIfNS_9allocatorIfEEEE"
    },
    {
     "field_name" : "mMelsSize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mPort",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils12MelProcessor15MelCallbackDataE",
   "name" : "android::audio_utils::MelProcessor::MelCallbackData",
   "referenced_type" : "_ZTIN7android11audio_utils12MelProcessor15MelCallbackDataE",
   "self_type" : "_ZTIN7android11audio_utils12MelProcessor15MelCallbackDataE",
   "size" : 24,
   "source_file" : "system/media/audio_utils/include/audio_utils/MelProcessor.h"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mCallback",
     "referenced_type" : "_ZTIKN7android2wpINS_11audio_utils12MelProcessor11MelCallbackEEE"
    },
    {
     "field_name" : "mThreadName",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKNSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    },
    {
     "field_name" : "mCallbackRingBuffer",
     "field_offset" : 160,
     "referenced_type" : "_ZTINSt3__16vectorIN7android11audio_utils12MelProcessor15MelCallbackDataENS_9allocatorIS4_EEEE"
    },
    {
     "field_name" : "mRbReadPtr",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__16atomicIjEE"
    },
    {
     "field_name" : "mRbWritePtr",
     "field_offset" : 288,
     "referenced_type" : "_ZTINSt3__16atomicIjEE"
    },
    {
     "field_name" : "mThread",
     "field_offset" : 320,
     "referenced_type" : "_ZTINSt3__16threadE"
    },
    {
     "field_name" : "mCondVar",
     "field_offset" : 352,
     "referenced_type" : "_ZTINSt3__118condition_variableE"
    },
    {
     "field_name" : "mCondVarMutex",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "field_name" : "mStopRequested",
     "field_offset" : 416,
     "referenced_type" : "_ZTIb"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils12MelProcessor9MelWorkerE",
   "name" : "android::audio_utils::MelProcessor::MelWorker",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils12MelProcessor9MelWorkerE",
   "self_type" : "_ZTIN7android11audio_utils12MelProcessor9MelWorkerE",
   "size" : 56,
   "source_file" : "system/media/audio_utils/include/audio_utils/MelProcessor.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCallback",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKN7android2wpINS_11audio_utils12MelProcessor11MelCallbackEEE"
    },
    {
     "access" : "private",
     "field_name" : "mMelWorker",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android11audio_utils12MelProcessor9MelWorkerE"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 576,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mSampleRate",
     "field_offset" : 608,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mFramesPerMelValue",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mChannelCount",
     "field_offset" : 672,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mFormat",
     "field_offset" : 704,
     "referenced_type" : "_ZTI14audio_format_t"
    },
    {
     "access" : "private",
     "field_name" : "mAWeightSamples",
     "field_offset" : 736,
     "referenced_type" : "_ZTINSt3__16vectorIfNS_9allocatorIfEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mFloatSamples",
     "field_offset" : 832,
     "referenced_type" : "_ZTINSt3__16vectorIfNS_9allocatorIfEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mCurrentChannelEnergy",
     "field_offset" : 928,
     "referenced_type" : "_ZTINSt3__16vectorIfNS_9allocatorIfEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mMelValues",
     "field_offset" : 1024,
     "referenced_type" : "_ZTINSt3__16vectorIfNS_9allocatorIfEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mCurrentIndex",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mCascadedBiquads",
     "field_offset" : 1152,
     "referenced_type" : "_ZTINSt3__15arrayINS_10unique_ptrIN7android11audio_utils12BiquadFilterIfLb1ENS3_7details25DefaultBiquadConstOptionsEEENS_14default_deleteIS7_EEEELj3EEE"
    },
    {
     "access" : "private",
     "field_name" : "mAttenuationDB",
     "field_offset" : 1248,
     "referenced_type" : "_ZTINSt3__16atomicIfEE"
    },
    {
     "access" : "private",
     "field_name" : "mDeviceId",
     "field_offset" : 1280,
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    },
    {
     "access" : "private",
     "field_name" : "mRs2UpperBound",
     "field_offset" : 1312,
     "referenced_type" : "_ZTINSt3__16atomicIfEE"
    },
    {
     "access" : "private",
     "field_name" : "mCurrentSamples",
     "field_offset" : 1344,
     "referenced_type" : "_ZTINSt3__16atomicIjEE"
    },
    {
     "access" : "private",
     "field_name" : "mPaused",
     "field_offset" : 1376,
     "referenced_type" : "_ZTINSt3__16atomicIbEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils12MelProcessorE",
   "name" : "android::audio_utils::MelProcessor",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils12MelProcessorE",
   "self_type" : "_ZTIN7android11audio_utils12MelProcessorE",
   "size" : 176,
   "source_file" : "system/media/audio_utils/include/audio_utils/MelProcessor.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11audio_utils12MelProcessorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11audio_utils12MelProcessorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11audio_utils12MelProcessorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android11audio_utils12MelProcessor15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCsdWindowSeconds",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKx"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 128,
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mMelRecords",
     "field_offset" : 160,
     "referenced_type" : "_ZTINSt3__13mapIxN7android11audio_utils9MelRecordENS_4lessIxEENS_9allocatorINS_4pairIKxS3_EEEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mCsdRecords",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__13mapIxN7android11audio_utils9CsdRecordENS_4lessIxEENS_9allocatorINS_4pairIKxS3_EEEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mCurrentMelRecordsCsd",
     "field_offset" : 352,
     "referenced_type" : "_ZTIf"
    },
    {
     "access" : "private",
     "field_name" : "mCurrentCsd",
     "field_offset" : 384,
     "referenced_type" : "_ZTIf"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils13MelAggregatorE",
   "name" : "android::audio_utils::MelAggregator",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils13MelAggregatorE",
   "self_type" : "_ZTIN7android11audio_utils13MelAggregatorE",
   "size" : 56,
   "source_file" : "system/media/audio_utils/include/audio_utils/MelAggregator.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11audio_utils13MelAggregatorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11audio_utils13MelAggregatorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11audio_utils13MelAggregatorD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "coef_",
     "referenced_type" : "_ZTIA5_f"
    },
    {
     "field_name" : "s_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA2_13float32x4x2_t"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils16BiquadStateSpaceI13float32x4x2_tfLb0EEE",
   "name" : "android::audio_utils::BiquadStateSpace<float32x4x2_t, float, false>",
   "referenced_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceI13float32x4x2_tfLb0EEE",
   "self_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceI13float32x4x2_tfLb0EEE",
   "size" : 96,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h",
   "template_args" :
   [
    "_ZTI13float32x4x2_t",
    "_ZTIf"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "coef_",
     "referenced_type" : "_ZTIA5_f"
    },
    {
     "field_name" : "s_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA2_13float32x4x4_t"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils16BiquadStateSpaceI13float32x4x4_tfLb0EEE",
   "name" : "android::audio_utils::BiquadStateSpace<float32x4x4_t, float, false>",
   "referenced_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceI13float32x4x4_tfLb0EEE",
   "self_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceI13float32x4x4_tfLb0EEE",
   "size" : 160,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h",
   "template_args" :
   [
    "_ZTI13float32x4x4_t",
    "_ZTIf"
   ]
  },
  {
   "alignment" : 16,
   "fields" :
   [
    {
     "field_name" : "coef_",
     "referenced_type" : "_ZTIA5_f"
    },
    {
     "field_name" : "s_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA2_19__simd128_float32_t"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils16BiquadStateSpaceI19__simd128_float32_tfLb0EEE",
   "name" : "android::audio_utils::BiquadStateSpace<__attribute__((neon_vector_type(4))) float, float, false>",
   "referenced_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceI19__simd128_float32_tfLb0EEE",
   "self_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceI19__simd128_float32_tfLb0EEE",
   "size" : 64,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h",
   "template_args" :
   [
    "_ZTI19__simd128_float32_t",
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "coef_",
     "referenced_type" : "_ZTIA5_f"
    },
    {
     "field_name" : "s_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA2_N7android11audio_utils10intrinsics16internal_array_tIfLj10EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj10EEEfLb0EEE",
   "name" : "android::audio_utils::BiquadStateSpace<android::audio_utils::intrinsics::internal_array_t<float, 10>, float, false>",
   "referenced_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj10EEEfLb0EEE",
   "self_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj10EEEfLb0EEE",
   "size" : 100,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h",
   "template_args" :
   [
    "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj10EEE",
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "coef_",
     "referenced_type" : "_ZTIA5_f"
    },
    {
     "field_name" : "s_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA2_N7android11audio_utils10intrinsics16internal_array_tIfLj11EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj11EEEfLb0EEE",
   "name" : "android::audio_utils::BiquadStateSpace<android::audio_utils::intrinsics::internal_array_t<float, 11>, float, false>",
   "referenced_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj11EEEfLb0EEE",
   "self_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj11EEEfLb0EEE",
   "size" : 108,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h",
   "template_args" :
   [
    "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj11EEE",
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "coef_",
     "referenced_type" : "_ZTIA5_f"
    },
    {
     "field_name" : "s_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA2_N7android11audio_utils10intrinsics16internal_array_tIfLj12EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj12EEEfLb0EEE",
   "name" : "android::audio_utils::BiquadStateSpace<android::audio_utils::intrinsics::internal_array_t<float, 12>, float, false>",
   "referenced_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj12EEEfLb0EEE",
   "self_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj12EEEfLb0EEE",
   "size" : 116,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h",
   "template_args" :
   [
    "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj12EEE",
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "coef_",
     "referenced_type" : "_ZTIA5_f"
    },
    {
     "field_name" : "s_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA2_N7android11audio_utils10intrinsics16internal_array_tIfLj13EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj13EEEfLb0EEE",
   "name" : "android::audio_utils::BiquadStateSpace<android::audio_utils::intrinsics::internal_array_t<float, 13>, float, false>",
   "referenced_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj13EEEfLb0EEE",
   "self_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj13EEEfLb0EEE",
   "size" : 124,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h",
   "template_args" :
   [
    "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj13EEE",
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "coef_",
     "referenced_type" : "_ZTIA5_f"
    },
    {
     "field_name" : "s_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA2_N7android11audio_utils10intrinsics16internal_array_tIfLj14EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj14EEEfLb0EEE",
   "name" : "android::audio_utils::BiquadStateSpace<android::audio_utils::intrinsics::internal_array_t<float, 14>, float, false>",
   "referenced_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj14EEEfLb0EEE",
   "self_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj14EEEfLb0EEE",
   "size" : 132,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h",
   "template_args" :
   [
    "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj14EEE",
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "coef_",
     "referenced_type" : "_ZTIA5_f"
    },
    {
     "field_name" : "s_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA2_N7android11audio_utils10intrinsics16internal_array_tIfLj15EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj15EEEfLb0EEE",
   "name" : "android::audio_utils::BiquadStateSpace<android::audio_utils::intrinsics::internal_array_t<float, 15>, float, false>",
   "referenced_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj15EEEfLb0EEE",
   "self_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj15EEEfLb0EEE",
   "size" : 140,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h",
   "template_args" :
   [
    "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj15EEE",
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "coef_",
     "referenced_type" : "_ZTIA5_f"
    },
    {
     "field_name" : "s_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA2_N7android11audio_utils10intrinsics16internal_array_tIfLj2EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj2EEEfLb0EEE",
   "name" : "android::audio_utils::BiquadStateSpace<android::audio_utils::intrinsics::internal_array_t<float, 2>, float, false>",
   "referenced_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj2EEEfLb0EEE",
   "self_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj2EEEfLb0EEE",
   "size" : 36,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h",
   "template_args" :
   [
    "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj2EEE",
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "coef_",
     "referenced_type" : "_ZTIA5_f"
    },
    {
     "field_name" : "s_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA2_N7android11audio_utils10intrinsics16internal_array_tIfLj3EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj3EEEfLb0EEE",
   "name" : "android::audio_utils::BiquadStateSpace<android::audio_utils::intrinsics::internal_array_t<float, 3>, float, false>",
   "referenced_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj3EEEfLb0EEE",
   "self_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj3EEEfLb0EEE",
   "size" : 44,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h",
   "template_args" :
   [
    "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj3EEE",
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "coef_",
     "referenced_type" : "_ZTIA5_f"
    },
    {
     "field_name" : "s_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA2_N7android11audio_utils10intrinsics16internal_array_tIfLj5EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj5EEEfLb0EEE",
   "name" : "android::audio_utils::BiquadStateSpace<android::audio_utils::intrinsics::internal_array_t<float, 5>, float, false>",
   "referenced_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj5EEEfLb0EEE",
   "self_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj5EEEfLb0EEE",
   "size" : 60,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h",
   "template_args" :
   [
    "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj5EEE",
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "coef_",
     "referenced_type" : "_ZTIA5_f"
    },
    {
     "field_name" : "s_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA2_N7android11audio_utils10intrinsics16internal_array_tIfLj6EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj6EEEfLb0EEE",
   "name" : "android::audio_utils::BiquadStateSpace<android::audio_utils::intrinsics::internal_array_t<float, 6>, float, false>",
   "referenced_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj6EEEfLb0EEE",
   "self_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj6EEEfLb0EEE",
   "size" : 68,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h",
   "template_args" :
   [
    "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj6EEE",
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "coef_",
     "referenced_type" : "_ZTIA5_f"
    },
    {
     "field_name" : "s_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA2_N7android11audio_utils10intrinsics16internal_array_tIfLj7EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj7EEEfLb0EEE",
   "name" : "android::audio_utils::BiquadStateSpace<android::audio_utils::intrinsics::internal_array_t<float, 7>, float, false>",
   "referenced_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj7EEEfLb0EEE",
   "self_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj7EEEfLb0EEE",
   "size" : 76,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h",
   "template_args" :
   [
    "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj7EEE",
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "coef_",
     "referenced_type" : "_ZTIA5_f"
    },
    {
     "field_name" : "s_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA2_N7android11audio_utils10intrinsics16internal_array_tIfLj9EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj9EEEfLb0EEE",
   "name" : "android::audio_utils::BiquadStateSpace<android::audio_utils::intrinsics::internal_array_t<float, 9>, float, false>",
   "referenced_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj9EEEfLb0EEE",
   "self_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceINS0_10intrinsics16internal_array_tIfLj9EEEfLb0EEE",
   "size" : 92,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h",
   "template_args" :
   [
    "_ZTIN7android11audio_utils10intrinsics16internal_array_tIfLj9EEE",
    "_ZTIf"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "coef_",
     "referenced_type" : "_ZTIA5_f"
    },
    {
     "field_name" : "s_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA2_f"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils16BiquadStateSpaceIffLb0EEE",
   "name" : "android::audio_utils::BiquadStateSpace<float, float, false>",
   "referenced_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceIffLb0EEE",
   "self_type" : "_ZTIN7android11audio_utils16BiquadStateSpaceIffLb0EEE",
   "size" : 28,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h",
   "template_args" :
   [
    "_ZTIf",
    "_ZTIf"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBalance",
     "referenced_type" : "_ZTIf"
    },
    {
     "access" : "private",
     "field_name" : "mVolumes",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16vectorIfNS_9allocatorIfEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mChannelMask",
     "field_offset" : 128,
     "referenced_type" : "_ZTI20audio_channel_mask_t"
    },
    {
     "access" : "private",
     "field_name" : "mChannelCount",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mSides",
     "field_offset" : 192,
     "referenced_type" : "_ZTINSt3__16vectorIN7android11audio_utils8channels19AUDIO_GEOMETRY_SIDEENS_9allocatorIS4_EEEE"
    },
    {
     "access" : "private",
     "field_name" : "mRamp",
     "field_offset" : 288,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "mRampBalance",
     "field_offset" : 320,
     "referenced_type" : "_ZTIf"
    },
    {
     "access" : "private",
     "field_name" : "mRampVolumes",
     "field_offset" : 352,
     "referenced_type" : "_ZTINSt3__16vectorIfNS_9allocatorIfEEEE"
    },
    {
     "access" : "private",
     "field_name" : "mCurve",
     "field_offset" : 448,
     "referenced_type" : "_ZTIKNSt3__18functionIFffEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils7BalanceE",
   "name" : "android::audio_utils::Balance",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils7BalanceE",
   "self_type" : "_ZTIN7android11audio_utils7BalanceE",
   "size" : 80,
   "source_file" : "system/media/audio_utils/include/audio_utils/Balance.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils7details25DefaultBiquadConstOptionsE",
   "name" : "android::audio_utils::details::DefaultBiquadConstOptions",
   "referenced_type" : "_ZTIN7android11audio_utils7details25DefaultBiquadConstOptionsE",
   "self_type" : "_ZTIN7android11audio_utils7details25DefaultBiquadConstOptionsE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/BiquadFilter.h"
  },
  {
   "alignment" : 128,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android11audio_utils8channels11IChannelMixE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMatrix",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIA26_A8_f"
    },
    {
     "access" : "private",
     "field_name" : "mInputChannelMask",
     "field_offset" : 7680,
     "referenced_type" : "_ZTI20audio_channel_mask_t"
    },
    {
     "access" : "private",
     "field_name" : "mInputChannelCount",
     "field_offset" : 7712,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t1599EEE",
   "name" : "android::audio_utils::channels::ChannelMix<AUDIO_CHANNEL_OUT_7POINT1>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t1599EEE",
   "self_type" : "_ZTIN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t1599EEE",
   "size" : 1024,
   "source_file" : "system/media/audio_utils/include/audio_utils/ChannelMix.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t1599EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t1599EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t1599EED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t1599EE19setInputChannelMaskES3_"
    },
    {
     "mangled_component_name" : "_ZNK7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t1599EE19getInputChannelMaskEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t1599EE7processEPKfPfjb"
    },
    {
     "mangled_component_name" : "_ZN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t1599EE7processEPKfPfjbS3_"
    }
   ]
  },
  {
   "alignment" : 128,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android11audio_utils8channels11IChannelMixE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMatrix",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIA26_A12_f"
    },
    {
     "access" : "private",
     "field_name" : "mInputChannelMask",
     "field_offset" : 11008,
     "referenced_type" : "_ZTI20audio_channel_mask_t"
    },
    {
     "access" : "private",
     "field_name" : "mInputChannelCount",
     "field_offset" : 11040,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t185919EEE",
   "name" : "android::audio_utils::channels::ChannelMix<AUDIO_CHANNEL_OUT_7POINT1POINT4>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t185919EEE",
   "self_type" : "_ZTIN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t185919EEE",
   "size" : 1408,
   "source_file" : "system/media/audio_utils/include/audio_utils/ChannelMix.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t185919EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t185919EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t185919EED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t185919EE19setInputChannelMaskES3_"
    },
    {
     "mangled_component_name" : "_ZNK7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t185919EE19getInputChannelMaskEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t185919EE7processEPKfPfjb"
    },
    {
     "mangled_component_name" : "_ZN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t185919EE7processEPKfPfjbS3_"
    }
   ]
  },
  {
   "alignment" : 128,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android11audio_utils8channels11IChannelMixE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMatrix",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIA26_A2_f"
    },
    {
     "access" : "private",
     "field_name" : "mInputChannelMask",
     "field_offset" : 2688,
     "referenced_type" : "_ZTI20audio_channel_mask_t"
    },
    {
     "access" : "private",
     "field_name" : "mInputChannelCount",
     "field_offset" : 2720,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t3EEE",
   "name" : "android::audio_utils::channels::ChannelMix<AUDIO_CHANNEL_OUT_STEREO>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t3EEE",
   "self_type" : "_ZTIN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t3EEE",
   "size" : 384,
   "source_file" : "system/media/audio_utils/include/audio_utils/ChannelMix.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t3EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t3EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t3EED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t3EE19setInputChannelMaskES3_"
    },
    {
     "mangled_component_name" : "_ZNK7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t3EE19getInputChannelMaskEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t3EE7processEPKfPfjb"
    },
    {
     "mangled_component_name" : "_ZN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t3EE7processEPKfPfjbS3_"
    }
   ]
  },
  {
   "alignment" : 128,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android11audio_utils8channels11IChannelMixE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMatrix",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIA26_A6_f"
    },
    {
     "access" : "private",
     "field_name" : "mInputChannelMask",
     "field_offset" : 6016,
     "referenced_type" : "_ZTI20audio_channel_mask_t"
    },
    {
     "access" : "private",
     "field_name" : "mInputChannelCount",
     "field_offset" : 6048,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t63EEE",
   "name" : "android::audio_utils::channels::ChannelMix<AUDIO_CHANNEL_OUT_5POINT1>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t63EEE",
   "self_type" : "_ZTIN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t63EEE",
   "size" : 768,
   "source_file" : "system/media/audio_utils/include/audio_utils/ChannelMix.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t63EEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t63EED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t63EED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t63EE19setInputChannelMaskES3_"
    },
    {
     "mangled_component_name" : "_ZNK7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t63EE19getInputChannelMaskEv"
    },
    {
     "mangled_component_name" : "_ZNK7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t63EE7processEPKfPfjb"
    },
    {
     "mangled_component_name" : "_ZN7android11audio_utils8channels10ChannelMixIL20audio_channel_mask_t63EE7processEPKfPfjbS3_"
    }
   ]
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN7android11audio_utils8channels11IChannelMixE",
   "name" : "android::audio_utils::channels::IChannelMix",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8channels11IChannelMixE",
   "self_type" : "_ZTIN7android11audio_utils8channels11IChannelMixE",
   "size" : 4,
   "source_file" : "system/media/audio_utils/include/audio_utils/ChannelMix.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android11audio_utils8channels11IChannelMixE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android11audio_utils8channels11IChannelMixD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android11audio_utils8channels11IChannelMixD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11audio_utils8channels11IChannelMix19setInputChannelMaskE20audio_channel_mask_t"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11audio_utils8channels11IChannelMix19getInputChannelMaskEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android11audio_utils8channels11IChannelMix7processEPKfPfjb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android11audio_utils8channels11IChannelMix7processEPKfPfjb20audio_channel_mask_t"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata13compound_typeIJEEE",
   "name" : "android::audio_utils::metadata::compound_type<>",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata13compound_typeIJEEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata13compound_typeIJEEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata13compound_typeIJixfdEEE",
   "name" : "android::audio_utils::metadata::compound_type<int, long long, float, double>",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata13compound_typeIJixfdEEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata13compound_typeIJixfdEEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata13compound_typeIJixfdNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEENS1_4DataEEEE",
   "name" : "android::audio_utils::metadata::compound_type<int, long long, float, double, basic_string<char>, Data>",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata13compound_typeIJixfdNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEENS1_4DataEEEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata13compound_typeIJixfdNSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEENS1_4DataEEEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb0EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata17is_specializationINSt3__13mapINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEENS1_5DatumENS3_4lessISA_EENS8_INS3_4pairIKSA_SB_EEEEEENS3_6vectorEEE",
   "name" : "android::audio_utils::metadata::is_specialization<std::map<std::basic_string<char, std::char_traits<char>, std::allocator<char>>, android::audio_utils::metadata::Datum, std::less<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, std::allocator<std::pair<const std::basic_string<char, std::char_traits<char>, std::allocator<char>>, android::audio_utils::metadata::Datum>>>, std::vector>",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata17is_specializationINSt3__13mapINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEENS1_5DatumENS3_4lessISA_EENS8_INS3_4pairIKSA_SB_EEEEEENS3_6vectorEEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata17is_specializationINSt3__13mapINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEENS1_5DatumENS3_4lessISA_EENS8_INS3_4pairIKSA_SB_EEEEEENS3_6vectorEEE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h",
   "template_args" :
   [
    "_ZTINSt3__13mapINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android11audio_utils8metadata5DatumENS_4lessIS6_EENS4_INS_4pairIKS6_SA_EEEEEE"
   ]
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__117integral_constantIbLb1EEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata17is_specializationINSt3__13mapINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEENS1_5DatumENS3_4lessISA_EENS8_INS3_4pairIKSA_SB_EEEEEES4_EE",
   "name" : "android::audio_utils::metadata::is_specialization<std::map<std::basic_string<char, std::char_traits<char>, std::allocator<char>>, android::audio_utils::metadata::Datum, std::less<std::basic_string<char, std::char_traits<char>, std::allocator<char>>>, std::allocator<std::pair<const std::basic_string<char, std::char_traits<char>, std::allocator<char>>, android::audio_utils::metadata::Datum>>>, std::map>",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata17is_specializationINSt3__13mapINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEENS1_5DatumENS3_4lessISA_EENS8_INS3_4pairIKSA_SB_EEEEEES4_EE",
   "self_type" : "_ZTIN7android11audio_utils8metadata17is_specializationINSt3__13mapINS3_12basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEENS1_5DatumENS3_4lessISA_EENS8_INS3_4pairIKSA_SB_EEEEEES4_EE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h",
   "template_args" :
   [
    "_ZTINSt3__13mapINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android11audio_utils8metadata5DatumENS_4lessIS6_EENS4_INS_4pairIKS6_SA_EEEEEE"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata3KeyINS1_4DataEvEE",
   "name" : "android::audio_utils::metadata::Key<android::audio_utils::metadata::Data, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata3KeyINS1_4DataEvEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata3KeyINS1_4DataEvEE",
   "size" : 12,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h",
   "template_args" :
   [
    "_ZTIN7android11audio_utils8metadata4DataE",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata3KeyINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEvEE",
   "name" : "android::audio_utils::metadata::Key<std::basic_string<char, std::char_traits<char>, std::allocator<char>>, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata3KeyINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEvEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata3KeyINSt3__112basic_stringIcNS3_11char_traitsIcEENS3_9allocatorIcEEEEvEE",
   "size" : 12,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h",
   "template_args" :
   [
    "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata3KeyIdvEE",
   "name" : "android::audio_utils::metadata::Key<double, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata3KeyIdvEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata3KeyIdvEE",
   "size" : 12,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h",
   "template_args" :
   [
    "_ZTId",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata3KeyIfvEE",
   "name" : "android::audio_utils::metadata::Key<float, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata3KeyIfvEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata3KeyIfvEE",
   "size" : 12,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h",
   "template_args" :
   [
    "_ZTIf",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata3KeyIivEE",
   "name" : "android::audio_utils::metadata::Key<int, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata3KeyIivEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata3KeyIivEE",
   "size" : 12,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h",
   "template_args" :
   [
    "_ZTIi",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata3KeyIxvEE",
   "name" : "android::audio_utils::metadata::Key<long long, void>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata3KeyIxvEE",
   "self_type" : "_ZTIN7android11audio_utils8metadata3KeyIxvEE",
   "size" : 12,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h",
   "template_args" :
   [
    "_ZTIx",
    "_ZTIv"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__13mapINS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEN7android11audio_utils8metadata5DatumENS_4lessIS6_EENS4_INS_4pairIKS6_SA_EEEEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata4DataE",
   "name" : "android::audio_utils::metadata::Data",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata4DataE",
   "self_type" : "_ZTIN7android11audio_utils8metadata4DataE",
   "size" : 12,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTINSt3__13anyE"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata5DatumE",
   "name" : "android::audio_utils::metadata::Datum",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata5DatumE",
   "self_type" : "_ZTIN7android11audio_utils8metadata5DatumE",
   "size" : 16,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android11audio_utils8metadata8any_typeE",
   "name" : "android::audio_utils::metadata::any_type",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata8any_typeE",
   "self_type" : "_ZTIN7android11audio_utils8metadata8any_typeE",
   "size" : 1,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "timestamp",
     "referenced_type" : "_ZTIKx"
    },
    {
     "field_name" : "duration",
     "field_offset" : 64,
     "referenced_type" : "_ZTIKj"
    },
    {
     "field_name" : "value",
     "field_offset" : 96,
     "referenced_type" : "_ZTIKf"
    },
    {
     "field_name" : "averageMel",
     "field_offset" : 128,
     "referenced_type" : "_ZTIKf"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils9CsdRecordE",
   "name" : "android::audio_utils::CsdRecord",
   "referenced_type" : "_ZTIN7android11audio_utils9CsdRecordE",
   "self_type" : "_ZTIN7android11audio_utils9CsdRecordE",
   "size" : 24,
   "source_file" : "system/media/audio_utils/include/audio_utils/MelAggregator.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "portId",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mels",
     "field_offset" : 32,
     "referenced_type" : "_ZTINSt3__16vectorIfNS_9allocatorIfEEEE"
    },
    {
     "field_name" : "timestamp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTIN7android11audio_utils9MelRecordE",
   "name" : "android::audio_utils::MelRecord",
   "referenced_type" : "_ZTIN7android11audio_utils9MelRecordE",
   "self_type" : "_ZTIN7android11audio_utils9MelRecordE",
   "size" : 24,
   "source_file" : "system/media/audio_utils/include/audio_utils/MelAggregator.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "_ZTINSt3__16atomicIiEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "self_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "template_args" :
   [
    "_ZTIN7android19VirtualLightRefBaseE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android14ReferenceMoverE",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android14ReferenceMoverE",
   "self_type" : "_ZTIN7android14ReferenceMoverE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIN7android16ReferenceRenamerE",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android16ReferenceRenamerE",
   "self_type" : "_ZTIN7android16ReferenceRenamerE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEj"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIbEE",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIcEE",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIdEE",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIfEE",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIhEE",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIiEE",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIjEE",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIlEE",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyImEE",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIsEE",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIs"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyItEE",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIt"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIvEE",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIxEE",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_copyIyEE",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_copyIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorImEE",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIs"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorItEE",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIt"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_ctorIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorImEE",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIs"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorItEE",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIt"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_dtorIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIbEE",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIbEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIb"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIcEE",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIcEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIc"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIdEE",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIdEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTId"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIfEE",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIfEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIf"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIhEE",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIhEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIh"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIiEE",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIiEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIjEE",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIjEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIj"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIlEE",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIlEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIl"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveImEE",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveImEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIm"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIsEE",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIsEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIs"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveItEE",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveItEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIt"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIvEE",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIvEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIv"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIxEE",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIxEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIx"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android18trait_trivial_moveIyEE",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "self_type" : "_ZTIN7android18trait_trivial_moveIyEE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" :
   [
    "_ZTIy"
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTIN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android19VirtualLightRefBaseE",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "self_type" : "_ZTIN7android19VirtualLightRefBaseE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/LightRefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android11audio_utils12MelProcessor11MelCallbackE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_11audio_utils12MelProcessor11MelCallbackEEE",
   "name" : "android::sp<android::audio_utils::MelProcessor::MelCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_11audio_utils12MelProcessor11MelCallbackEEE",
   "self_type" : "_ZTIN7android2spINS_11audio_utils12MelProcessor11MelCallbackEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" :
   [
    "_ZTIN7android11audio_utils12MelProcessor11MelCallbackE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android6ThreadE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2spINS_6ThreadEEE",
   "name" : "android::sp<android::Thread>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2spINS_6ThreadEEE",
   "self_type" : "_ZTIN7android2spINS_6ThreadEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h",
   "template_args" :
   [
    "_ZTIN7android6ThreadE"
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "_ZTIPN7android11audio_utils12MelProcessor11MelCallbackE"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPN7android7RefBase12weakref_typeE"
    }
   ],
   "linker_set_key" : "_ZTIN7android2wpINS_11audio_utils12MelProcessor11MelCallbackEEE",
   "name" : "android::wp<android::audio_utils::MelProcessor::MelCallback>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android2wpINS_11audio_utils12MelProcessor11MelCallbackEEE",
   "self_type" : "_ZTIN7android2wpINS_11audio_utils12MelProcessor11MelCallbackEEE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "template_args" :
   [
    "_ZTIN7android11audio_utils12MelProcessor11MelCallbackE"
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android4base19ScopedLockAssertionE",
   "name" : "android::base::ScopedLockAssertion",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android4base19ScopedLockAssertionE",
   "self_type" : "_ZTIN7android4base19ScopedLockAssertionE",
   "size" : 1,
   "source_file" : "system/libbase/include/android-base/thread_annotations.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTIRN7android5MutexE"
    }
   ],
   "linker_set_key" : "_ZTIN7android5Mutex8AutolockE",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android5Mutex8AutolockE",
   "self_type" : "_ZTIN7android5Mutex8AutolockE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/Mutex.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "_ZTI15pthread_mutex_t"
    }
   ],
   "linker_set_key" : "_ZTIN7android5MutexE",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android5MutexE",
   "self_type" : "_ZTIN7android5MutexE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/Mutex.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTIRN7android6RWLockE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6RWLock9AutoRLockE",
   "name" : "android::RWLock::AutoRLock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6RWLock9AutoRLockE",
   "self_type" : "_ZTIN7android6RWLock9AutoRLockE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/RWLock.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTIRN7android6RWLockE"
    }
   ],
   "linker_set_key" : "_ZTIN7android6RWLock9AutoWLockE",
   "name" : "android::RWLock::AutoWLock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6RWLock9AutoWLockE",
   "self_type" : "_ZTIN7android6RWLock9AutoWLockE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/RWLock.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRWLock",
     "referenced_type" : "_ZTI16pthread_rwlock_t"
    }
   ],
   "linker_set_key" : "_ZTIN7android6RWLockE",
   "name" : "android::RWLock",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6RWLockE",
   "self_type" : "_ZTIN7android6RWLockE",
   "size" : 40,
   "source_file" : "system/core/libutils/include/utils/RWLock.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "_ZTIN7android7RefBaseE"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCanCallJava",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKb"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 96,
     "referenced_type" : "_ZTIN7android5MutexE"
    },
    {
     "access" : "private",
     "field_name" : "mThreadExitedCondition",
     "field_offset" : 128,
     "referenced_type" : "_ZTIN7android9ConditionE"
    },
    {
     "access" : "private",
     "field_name" : "mStatus",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "mExitPending",
     "field_offset" : 192,
     "referenced_type" : "_ZTIVb"
    },
    {
     "access" : "private",
     "field_name" : "mRunning",
     "field_offset" : 200,
     "referenced_type" : "_ZTIVb"
    },
    {
     "access" : "private",
     "field_name" : "mHoldSelf",
     "field_offset" : 224,
     "referenced_type" : "_ZTIN7android2spINS_6ThreadEEE"
    },
    {
     "access" : "private",
     "field_name" : "mTid",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN7android6ThreadE",
   "name" : "android::Thread",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android6ThreadE",
   "self_type" : "_ZTIN7android6ThreadE",
   "size" : 44,
   "source_file" : "system/core/libutils/include/utils/Thread.h",
   "vtable_components" :
   [
    {
     "component_value" : 36,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcij"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Thread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIN7android7RefBase12weakref_typeE",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "self_type" : "_ZTIN7android7RefBase12weakref_typeE",
   "size" : 1,
   "source_file" : "system/core/libutils/include/utils/RefBase.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 32,
     "referenced_type" : "_ZTIKPN7android7RefBase12weakref_implE"
    }
   ],
   "linker_set_key" : "_ZTIN7android7RefBaseE",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android7RefBaseE",
   "self_type" : "_ZTIN7android7RefBaseE",
   "size" : 8,
   "source_file" : "system/core/libutils/include/utils/RefBase.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "mCode",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "mCount",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "mFirstTime",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "mLastTime",
     "field_offset" : 128,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTIN7android8ErrorLogIiE5EntryE",
   "name" : "android::ErrorLog<int>::Entry",
   "referenced_type" : "_ZTIN7android8ErrorLogIiE5EntryE",
   "self_type" : "_ZTIN7android8ErrorLogIiE5EntryE",
   "size" : 24,
   "source_file" : "system/media/audio_utils/include/audio_utils/ErrorLog.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mErrors",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "private",
     "field_name" : "mIdx",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mAggregateNs",
     "field_offset" : 192,
     "referenced_type" : "_ZTIKx"
    },
    {
     "access" : "private",
     "field_name" : "mEntries",
     "field_offset" : 256,
     "referenced_type" : "_ZTINSt3__16vectorIN7android8ErrorLogIiE5EntryENS_9allocatorIS4_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8ErrorLogIiEE",
   "name" : "android::ErrorLog<int>",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8ErrorLogIiEE",
   "self_type" : "_ZTIN7android8ErrorLogIiEE",
   "size" : 48,
   "source_file" : "system/media/audio_utils/include/audio_utils/ErrorLog.h",
   "template_args" :
   [
    "_ZTIi"
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "_ZTINSt3__15mutexE"
    },
    {
     "access" : "private",
     "field_name" : "mCurrentTime",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    },
    {
     "access" : "private",
     "field_name" : "mCurrentEnergy",
     "field_offset" : 128,
     "referenced_type" : "_ZTIf"
    },
    {
     "access" : "private",
     "field_name" : "mCurrentFrames",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mIdx",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mConsecutiveZeroes",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "mSampleRate",
     "field_offset" : 256,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "mChannelCount",
     "field_offset" : 288,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "mFormat",
     "field_offset" : 320,
     "referenced_type" : "_ZTIK14audio_format_t"
    },
    {
     "access" : "private",
     "field_name" : "mFramesPerEntry",
     "field_offset" : 352,
     "referenced_type" : "_ZTIKj"
    },
    {
     "access" : "private",
     "field_name" : "mEntries",
     "field_offset" : 384,
     "referenced_type" : "_ZTINSt3__16vectorINS_4pairIxfEENS_9allocatorIS2_EEEE"
    }
   ],
   "linker_set_key" : "_ZTIN7android8PowerLogE",
   "name" : "android::PowerLog",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android8PowerLogE",
   "self_type" : "_ZTIN7android8PowerLogE",
   "size" : 64,
   "source_file" : "system/media/audio_utils/include/audio_utils/PowerLog.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCond",
     "referenced_type" : "_ZTI14pthread_cond_t"
    }
   ],
   "linker_set_key" : "_ZTIN7android9ConditionE",
   "name" : "android::Condition",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android9ConditionE",
   "self_type" : "_ZTIN7android9ConditionE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/Condition.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "_ZTIA5121_h"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "_ZTI12logger_entry"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN7log_msgUt_E",
   "name" : "log_msg::(anonymous)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN7log_msgUt_E",
   "self_type" : "_ZTIN7log_msgUt_E",
   "size" : 5124,
   "source_file" : "system/logging/liblog/include_vndk/log/log_read.h"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION7android11audio_utils8metadata4DataE",
   "name" : "android::audio_utils::metadata::Data &&",
   "referenced_type" : "_ZTIN7android11audio_utils8metadata4DataE",
   "self_type" : "_ZTION7android11audio_utils8metadata4DataE",
   "size" : 4,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION7android2spINS_11audio_utils12MelProcessor11MelCallbackEEE",
   "name" : "android::sp<android::audio_utils::MelProcessor::MelCallback> &&",
   "referenced_type" : "_ZTIN7android2spINS_11audio_utils12MelProcessor11MelCallbackEEE",
   "self_type" : "_ZTION7android2spINS_11audio_utils12MelProcessor11MelCallbackEEE",
   "size" : 4,
   "source_file" : "system/core/libutils/include/utils/StrongPointer.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIONSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "name" : "std::basic_string<char, std::char_traits<char>, std::allocator<char>> &&",
   "referenced_type" : "_ZTINSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "self_type" : "_ZTIONSt3__112basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE",
   "size" : 4,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIOd",
   "name" : "double &&",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIOd",
   "size" : 4,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIOf",
   "name" : "float &&",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIOf",
   "size" : 4,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIOi",
   "name" : "int &&",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIOi",
   "size" : 4,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIOx",
   "name" : "long long &&",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIOx",
   "size" : 4,
   "source_file" : "system/media/audio_utils/include/audio_utils/Metadata.h"
  }
 ]
}
