{
 "array_types" :
 [
  {
   "alignment" : 2,
   "linker_set_key" : "_ZTIA16_s",
   "name" : "short[16]",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIA16_s",
   "size" : 32,
   "source_file" : "external/libyuv/include/libyuv/row.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA256_j",
   "name" : "unsigned int[256]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA256_j",
   "size" : 1024,
   "source_file" : "external/libyuv/include/libyuv/row.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA32_h",
   "name" : "unsigned char[32]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA32_h",
   "size" : 32,
   "source_file" : "external/libyuv/include/libyuv/row.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIa",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTId",
   "size" : 8
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIf",
   "name" : "float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIf",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,

   "name" : "const unsigned int *",
   "referenced_type" : "_ZTIKj",
   "self_type" : "_ZTIPKj",
   "size" : 4,
   "source_file" : "external/libyuv/include/libyuv/row.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKt",
   "name" : "const unsigned short *",
   "referenced_type" : "_ZTIKt",
   "self_type" : "_ZTIPKt",
   "size" : 4,
   "source_file" : "external/libyuv/include/libyuv/convert.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPN6libyuv12MJpegDecoderE",
   "name" : "libyuv::MJpegDecoder *",
   "referenced_type" : "_ZTIN6libyuv12MJpegDecoderE",
   "self_type" : "_ZTIPN6libyuv12MJpegDecoderE",
   "size" : 4,
   "source_file" : "external/libyuv/include/libyuv/mjpeg_decoder.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPN6libyuv14SetJmpErrorMgrE",
   "name" : "libyuv::SetJmpErrorMgr *",
   "referenced_type" : "_ZTIN6libyuv14SetJmpErrorMgrE",
   "self_type" : "_ZTIPN6libyuv14SetJmpErrorMgrE",
   "size" : 4,
   "source_file" : "external/libyuv/include/libyuv/mjpeg_decoder.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPN6libyuv6BufferE",
   "name" : "libyuv::Buffer *",
   "referenced_type" : "_ZTIN6libyuv6BufferE",
   "self_type" : "_ZTIPN6libyuv6BufferE",
   "size" : 4,
   "source_file" : "external/libyuv/include/libyuv/mjpeg_decoder.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPPh",
   "name" : "unsigned char ***",
   "referenced_type" : "_ZTIPPh",
   "self_type" : "_ZTIPPPh",
   "size" : 4,
   "source_file" : "external/libyuv/include/libyuv/mjpeg_decoder.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPh",
   "name" : "unsigned char **",
   "referenced_type" : "_ZTIPh",
   "self_type" : "_ZTIPPh",
   "size" : 4,
   "source_file" : "external/libyuv/include/libyuv/mjpeg_decoder.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPf",
   "name" : "float *",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIPf",
   "size" : 4,
   "source_file" : "external/libyuv/include/libyuv/planar_functions.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 4,
   "source_file" : "external/libyuv/include/libyuv/convert.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPi",
   "name" : "int *",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIPi",
   "size" : 4,
   "source_file" : "external/libyuv/include/libyuv/mjpeg_decoder.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 4,
   "source_file" : "external/libyuv/include/libyuv/row.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPt",
   "name" : "unsigned short *",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIPt",
   "size" : 4,
   "source_file" : "external/libyuv/include/libyuv/convert.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "external/libyuv/include/libyuv/mjpeg_decoder.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIA256_Kj",
   "name" : "const unsigned int[256]",
   "referenced_type" : "_ZTIA256_j",
   "self_type" : "_ZTIA256_Kj",
   "size" : 1024,
   "source_file" : "external/libyuv/include/libyuv/row.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN6libyuv12YuvConstantsE",
   "name" : "const libyuv::YuvConstants",
   "referenced_type" : "_ZTIN6libyuv12YuvConstantsE",
   "self_type" : "_ZTIKN6libyuv12YuvConstantsE",
   "size" : 160,
   "source_file" : "external/libyuv/include/libyuv/convert_argb.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKPKh",
   "name" : "const unsigned char *const",
   "referenced_type" : "_ZTIPKh",
   "self_type" : "_ZTIKPKh",
   "size" : 4,
   "source_file" : "external/libyuv/include/libyuv/mjpeg_decoder.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "external/libyuv/include/libyuv/planar_functions.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/libyuv/include/libyuv/cpu_id.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "external/libyuv/include/libyuv/planar_functions.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/libyuv/include/libyuv/compare.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "external/libyuv/include/libyuv/compare.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "external/libyuv/include/libyuv/mjpeg_decoder.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "external/libyuv/include/libyuv/convert.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buffers",
     "referenced_type" : "_ZTIPN6libyuv6BufferE"
    },
    {
     "field_name" : "len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pos",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6libyuv12BufferVectorE",
   "name" : "libyuv::BufferVector",
   "referenced_type" : "_ZTIN6libyuv12BufferVectorE",
   "self_type" : "_ZTIN6libyuv12BufferVectorE",
   "size" : 12,
   "source_file" : "external/libyuv/include/libyuv/mjpeg_decoder.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "buf_",
     "referenced_type" : "_ZTIN6libyuv6BufferE"
    },
    {
     "access" : "private",
     "field_name" : "buf_vec_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN6libyuv12BufferVectorE"
    },
    {
     "access" : "private",
     "field_name" : "decompress_struct_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIP22jpeg_decompress_struct"
    },
    {
     "access" : "private",
     "field_name" : "source_mgr_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP15jpeg_source_mgr"
    },
    {
     "access" : "private",
     "field_name" : "error_mgr_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPN6libyuv14SetJmpErrorMgrE"
    },
    {
     "access" : "private",
     "field_name" : "has_scanline_padding_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "num_outbufs_",
     "field_offset" : 288,
     "referenced_type" : "_ZTIi"
    },
    {
     "access" : "private",
     "field_name" : "scanlines_",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPPPh"
    },
    {
     "access" : "private",
     "field_name" : "scanlines_sizes_",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPi"
    },
    {
     "access" : "private",
     "field_name" : "databuf_",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPPh"
    },
    {
     "access" : "private",
     "field_name" : "databuf_strides_",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPi"
    }
   ],
   "linker_set_key" : "_ZTIN6libyuv12MJpegDecoderE",
   "name" : "libyuv::MJpegDecoder",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN6libyuv12MJpegDecoderE",
   "self_type" : "_ZTIN6libyuv12MJpegDecoderE",
   "size" : 56,
   "source_file" : "external/libyuv/include/libyuv/mjpeg_decoder.h"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "field_name" : "kUVToB",
     "referenced_type" : "_ZTIA32_h"
    },
    {
     "field_name" : "kUVToG",
     "field_offset" : 256,
     "referenced_type" : "_ZTIA32_h"
    },
    {
     "field_name" : "kUVToR",
     "field_offset" : 512,
     "referenced_type" : "_ZTIA32_h"
    },
    {
     "field_name" : "kYToRgb",
     "field_offset" : 768,
     "referenced_type" : "_ZTIA16_s"
    },
    {
     "field_name" : "kYBiasToRgb",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIA16_s"
    }
   ],
   "linker_set_key" : "_ZTIN6libyuv12YuvConstantsE",
   "name" : "libyuv::YuvConstants",
   "referenced_type" : "_ZTIN6libyuv12YuvConstantsE",
   "self_type" : "_ZTIN6libyuv12YuvConstantsE",
   "size" : 160,
   "source_file" : "external/libyuv/include/libyuv/row.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data",
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "len",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTIN6libyuv6BufferE",
   "name" : "libyuv::Buffer",
   "referenced_type" : "_ZTIN6libyuv6BufferE",
   "self_type" : "_ZTIN6libyuv6BufferE",
   "size" : 8,
   "source_file" : "external/libyuv/include/libyuv/mjpeg_decoder.h"
  }
 ],
 "rvalue_reference_types" : []
}
